var I0=Object.defineProperty;var S0=(i,s,d)=>s in i?I0(i,s,{enumerable:!0,configurable:!0,writable:!0,value:d}):i[s]=d;var J=(i,s,d)=>(S0(i,typeof s!="symbol"?s+"":s,d),d);import{w as j0}from"./singletons.33274246.js";import{J as e0}from"./scheduler.b74d2183.js";function on(i){return(i==null?void 0:i.length)!==void 0?i:Array.from(i)}const T0=`藍色（あいいろ）,"['000', '076', '113']","['90', '11', '00', '66']",#004C71,"藍色（あいいろ）とは、縹色（はなだいろ）ほど純粋な青ではない暗い青色のことです。藍は青色染料として使われた最古の染料の一つで、平安時代には『黄蘗 』や『刈安 』が掛けられた『緑色』のことをいっていました。
純粋な深い青色を藍色と呼ぶようになったのは、江戸時代以降になってからです。手ぬぐいや暖簾などを藍に染めて愛用されたり、歌川広重をはじめ多くの絵師が用いたことから外国では「ジャパンブルー」とも呼ばれていました。",https://irocore.com/ai-iro/
藍色鳩羽（あいいろはとば）,"['117', '109', '145']","['40', '40', '00', '40']",#756D91,"藍色鳩羽（あいいろはとば）とは、文字通り「藍色がかった鳩羽色」の意味で、青みがかった鈍い紫色のことです。藍色が今のような青系統として一般化した江戸以降に誕生した色名でしょう。（※藍は古くは緑系統もさしていました。）
『鳩羽色』は古くから見れる色名であり、天皇が平常着用された袍 の色として禁色でもありました。色相の変化により『鳩羽鼠』や『鳩羽紫』など藍色鳩羽の他にも鳩羽のつく色名は数多く見られます。",https://irocore.com/aiirohatoba/
藍媚茶（あいこびちゃ）,"['085', '086', '071']","['55', '40', '52', '28']",#555647,"藍媚茶（あいこびちゃ）とは、江戸時代の流行色であるオリーブ系の茶「媚茶」を藍がからせた暗い緑褐色のことです。『諸色染手鑑』や『手鑑模様節用』などの染見本帳にその色名が見られます。
浅黄に下染めした上に、揚桃皮 と刈安の煮汁で染め、明礬媒染 で出された色のことです。",https://irocore.com/aikobicha/
相済茶（あいすみちゃ）,"['055', '060', '056']","['86', '72', '68', '47']",#373C38,"相済茶（あいすみちゃ）とは、藍みを帯びた墨色のことで、一般的に「藍墨茶」と書かれます。色名に「茶」とありますが「暗くくすんだ色合い」という意味で、黒の色譜です。渋みがあり、質実剛健を尊んだ江戸中期に愛用されました。
色名の由来は『手鑑模様節用』によると、「昔、根津権現の祭りの時に、浅草で三右衛門とか助七などという連中が喧嘩をし、その仲直りができた祝儀のしるしに、同じ色を染めさせて揃って着用した」とあり、手打ちが済んだということから、その色を「相済茶」というようになりました。なお「藍墨」の方は当て字です。",https://irocore.com/aisumicha2/
藍墨茶（あいすみちゃ）,"['055', '060', '056']","['86', '72', '68', '47']",#373C38,"藍墨茶（あいすみちゃ）とは、藍みを帯びた墨色のことで、「相済茶」とも書かれます。「藍墨」は当て字。色名に「茶」とありますが、「くろ」の色譜です。
色名の由来は『手鑑模様節用』によると、「昔、根津権現の祭りの時に、浅草で三右衛門とか助七などという連中が喧嘩をし、その仲直りができた祝儀のしるしに、同じ色を染めさせて揃って着用した」ことから、一件落着という意味で、その色を「あいすみ茶」というようになったとのことです。
江戸中期に愛用されました。",https://irocore.com/aisumicha/
藍鉄色（あいてついろ）,"['069', '070', '155']","['90', '00', '23', '80']",#003A47,"藍鉄色（あいてついろ）とは、緑みを含んだ濃い青色のことです。『紺鉄 』『鉄紺色 』ともよばれ、『藍色 』の変異色の中でも暗い部類に入ります。
茶系や鼠系が流行した江戸時代ですが、藍色もまた「江戸前」の色として広く愛好されており、そのため『藍』がつく色名も数多く生まれました。『藍鉄色』もそんな人気の藍色に『鉄色 』を組み合わせた、いかにも江戸時代らしい渋好みの色になります。
江戸時代に生まれた『藍』が付く色名には、流行色の『鼠色 』に藍を合わせた『藍鼠 』や古くからの色名『鳩羽色 』に藍を合わせた『藍色鳩羽 』などが有名です。",https://irocore.com/aitetsu-iro/
藍鼠（あいねず）,"['107', '129', '142']","['70', '50', '40', '00']",#6B818E,"藍鼠（あいねず）とは、藍みをおびた暗い鼠色のことです。「○○鼠」のように鼠がつく色名は江戸中期からみられます。暗い色や色味をおさえた鼠色は色調も豊富で、「四十八茶百鼠」としてもてはやされました。『手鑑模様節用』にも「今のあゐねづみ、これ又、にぶいろなるべし」との表記が見られます。
鼠がつく色名は、他にも「利休鼠」「源氏鼠」「小町鼠」などのように人物に因むものや、「深川鼠」や「鴨川鼠」などの地名に因むものなど様々な色名が生まれました。",https://irocore.com/ainezu/
藍海松茶（あいみるちゃ）,"['086', '086', '075']","['00', '00', '13', '66']",#56564B,藍海松茶（あいみるちゃ）とは、濃く黒ずんで藍みを帯びた茶色のことです。海松と茶という二つの流行色名を色名ですが、『愚雑俎（ぐざつそ）』に「今あいみる茶といふものは、素みる茶に藍をかけし色なれば」と書かれています。元文（一七三六〜四一）の頃、男子の小袖に、また宝暦（一七五一〜六四）の頃には麻裃にこの色が流行したと伝えられています。,https://irocore.com/aimirucha/
青（あお）,"['000', '113', '176']","['100', '25', '00', '25']",#0071B0,"青（あお）とは、基本色名の一つで、晴れた日の海や瑠璃のような色の総称のことです。原始的な露草の花による摺染の後、ほとんど藍染によって染め出されました。青は古くから広い範囲を示す色名で、植物の緑色や黒、白をも指しており、平安時代には青色といえば青白橡（あおしろつるばみ）のくすんだ橙味のある黄色でした。現代ではシアン色のほか、空や海や水の澄んだ色、青葉や野菜の青物など緑色系統の色をもいいます。加法混色における三原色（赤・緑・青）のひとつです。
色票として一般的な青とカラー印刷の青（シアン）を掲載しておきます。",https://irocore.com/ao/
葵色（あおいいろ）,"['170', '137', '189']","['38', '50', '00', '00']",#AA89BD,"葵色（あおいいろ）とは、葵の花のような灰色がかった明るい紫色のことです。平安の頃からの古い伝統色。葵の花は白や紅、紫、黄、斑 など様々な色の花を咲かせますが、当時から人気があり高貴な色であった紫が選ばれて『葵』の色名となったようです。
葵はアオイ科の多年草で、古くは薬草として用いられていました。ちなみに、色名となったのは初夏に大輪の花を咲かせる「立葵 」のこと。ちょうど梅雨の頃に花を咲かせることになぞらえて、「梅雨葵 」とも呼ばれています。また、この立葵三枚を意匠化したのが徳川家の家紋の「三つ葉葵」です。
葵色の重 ねの色目としては「表・浅青、裏・薄紫」などがあり、夏の色として用いられました。
葵の花
葵の花",https://irocore.com/aoi-iro/
青朽葉（あおくちば）,"['173', '162', '080']","['00', '06', '54', '32']",#ADA250,"青朽葉（あおくちば）とは、緑みのにぶい朽葉色で渋みがかった黄緑色のことです。染色は藍と黄蘗 を掛けあわせて染めます。
「朽葉色」は秋に樹々が紅葉し朽ちていくさまを表した色名で、衣服の色として広く用いられました。朽葉色には青朽葉の他に「黄朽葉」「赤朽葉」「濃朽葉」「薄朽葉」などの色名があります。",https://irocore.com/aokuchiba/
青白橡（あおしろつるばみ）,"['133', '145', '109']","['35', '17', '40', '20']",#85916D,"青白橡（あおしろつるばみ）とは、灰みのあるくすんだ黄緑色のことです。宮中の年中行事の作法書『西宮記 』に「麹塵与 青白橡 一物」とあり、「麹塵 」と同じ色とされています。平安文学『栄花物語』には「青き白橡」と記されており、一般には「青色」と呼ばれていました。
ちなみに、天皇が平常着用された袍 を「青白橡の袍」「麹塵の袍」「山鳩色の袍」などと呼ばれ、臨時祭、舞楽、庭座、弓馬初などのときに、着用されていたようです。",https://irocore.com/aoshirotsurubami/
青竹色（あおたけいろ）,"['126', '190', '171']","['34', '00', '10', '25']",#7EBEAB,青竹色（あおたけいろ）は、成長した青竹の幹のような青みの冴えた明るく濃い緑のことです。江戸中期から使われる色名で「手鑑模様節用」には、「ぬれは色、或ハ青竹いろともいふ」とあります。竹は、古くから自生し、食用、楽器、建築物にと生活に身近な植物だったためか、色名としても数多くみられました。ちなみに、青竹より薄めの色は「若竹」、鈍い調子の鼠がかった色は「老竹」となっています。,https://irocore.com/aotake-iro/
青丹（あおに）,"['133', '137', '84']","['56', '43', '76', '00']",#858954,"青丹（あおに）とは、昔、顔料や化粧料の黛に使われた青粘土のような暗く鈍い黄緑色のことです。この場合の青は緑のこと。丹は土を意味し、緑みのある土の色を指しています。ちなみに、もともとは青土とかいて「あおに」と読んでいました。
青丹は、顔料となる岩緑青（いわろくしょう）を表わす古名であり、奈良が産地として有名です。そのため、『万葉集』にも「青丹よし 寧楽ならの京師みやこは咲く花の 薫にほふがごとく 今盛りなり」とうたわれ、「青丹よし」は奈良にかかる枕詞となっています。
襲の色としては、表地に青を、裏地にも青を配した色目です。",https://irocore.com/aoni/
青鈍（あおにび）,"['093', '105', '112']","['20', '00', '00', '70']",#5d6970,"青鈍（あおにび）とは、青みの暗い灰色のことです。『鈍色 』の派生色。別に「あおにぶ」とも読まれます。

古くからの色名で、平安時代 （七九四-一一八五）の衣服令では凶時の服色（凶色）として、僧尼の衣に用いる色とされました。（出典：装束抄）
ただし、平安文学の「宇津保物語 」では「あおにびのさしぬき」、「源氏物語」では「青鈍の織物」「青鈍の細長」「あおにびの紙」「青鈍の几帳」など多くの記述が見られるように、青みの暗い灰色の形容に使われる一般的な色名でもあったようです。
『青鈍』の染色は、白樫 の樹皮や堅果 の鉄媒染 した『鈍色』に藍を淡く重ねるという説と、藍を染めた後に『鈍色』を重ねて染めるという説があり、色合も大きく異なります。
ちなみに、『鈍色 』とは平安時代における無彩色系統（黒と白の中間色）の総称で、現在で言えば『灰色』や『鼠色 』にあたります。色相も薄い色から濃い色まで広い範囲を指しており、その中で青みを帯びた色が『青鈍』と呼ばれました。
江戸の頃になると『鈍色』の色相は寂 のきいた粋な色として流行色となり『〇〇鼠』と呼ばれ細分化されていきます。そのため、『青鈍』の色名も『藍鼠』と呼ばれ使われなくなり、この色に対する「凶色」としての概念も完全に消えてしまいました。",https://irocore.com/aonibi/
青藤（あおふじ）,"['138', '162', '211']","['50', '31', '00', '00']",#8AA2D3,"青藤（あおふじ）とは、青がかった藤色のことで、青みの強いうすい青紫色のことです。藤色の派生色。
『藤色 』は藤の花の色に因 んだ平安の頃より女性に人気の伝統色で、江戸時代になってもその人気は変わらず、江戸後期には『藤鼠 』『藤納戸 』『薄藤 』など多くの派生色が生まれました。青藤色もその一つ。
青みがかった青藤に対し、赤みがかった藤色は『紅藤 』と呼ばれました。また青藤色よりさらに青みが濃い藤色に『紺藤 』があります。",https://irocore.com/aofuji/
青緑（あおみどり）,"['000', '164', '151']","['100', '00', '08', '36']",#00A497,"青緑（あおみどり）とは、青色とも緑色ともいえない青みがかった緑色のことです。『延喜式』縫殿寮に見られる色名で、藍に黄蘖（きはだ）をわずかに掛けた、縹色（はなだいろ）に近い緑色と言えます。ちなみに、平安時代は緑系の色も青と表現されていました。現在でも、信号機の『青』は厳密には青緑色になります。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/aomidori/
青紫（あおむらさき）,"['059', '070', '155']","['85', '77', '00', '00']",#3B469B,"青紫（あおむらさき）とは、青みを帯びた鮮やかな紫色のことです。平安時代の歴史物語「栄花物語 」にも記された古くからの伝統色。
一般的には『青』と『紫』の中間色調を表すのに使われることが多いため、色のイメージは幅広く、色彩体系も紅みの濃い紫から青みの強い紫までさまざまです。
『青紫』はご説明したように古くからの色名ですが、同系統に『菫色 』『桔梗色 』『竜胆色 』など多くの色が見られることもあり、現在では伝統色の色名としてより体系色として使われることがほとんどです。
ちなみに下記の色見本は、左が伝統色としての『青紫』の色で、右が色彩体系での青と紫の中間にあたる『青紫』の色になります。",https://irocore.com/aomurasaki/
青柳（あおやぎ）,"['123', '170', '023']","['50', '00', '100', '20']",#7BAA17,"青柳（あおやぎ）とは、青みを増した春の柳の葉のような強い黄緑色のことです。古くからの色名で、元は平安時代の重色目 に由来しています。ただし『青柳』の名は平安文学にも見られますが、衣の色名では登場していません。
重色目では「表 淡萌黄 ・裏 濃萌黄 」で表し、青々と垂れ下った春の枝垂柳 を表わした色です。出典：服飾管見
また別説に「表 濃青・裏 紫」や「表 濃青・裏 濃青」などの説もあります。
ちなみに、『濃青 』は現代でいう『緑』のことです。
『青柳』の衣の着用時期は春。
『青柳』の派生色には、江戸時代に流行した「四十八茶百鼠」の『青柳鼠』や『青柳茶』などがあります。
余談ですが「青柳の」は枕詞で、柳の葉が眉毛に似ていることから「細き眉根（まよね）」にかかりますし、その細枝を糸に見立てて「糸」にもかかります。さらに、柳の鬘 （髪飾り）から地名の「葛城山 」にもかかる枕詞です。
「青柳の糸よりかくる春しもぞ　乱れて花のほころびにける」（古今和歌集）紀貫之。
日本の春といえば「桜」ですが、「古今和歌集」にも数多くの歌が詠まれているように、『青柳』もまた、古くから日本の春を表した色のひとつといえるでしょう。

川辺の青柳

",https://irocore.com/aoyagi/
赤色（あか）,"['242', '000', '000']","['00', '95', '83', '05']",#F20000,"赤色（あか）とは、熟した苺 や血液のような色のことであり、赤系統の色の総称です。日本最古の色名の1つで、明（アケ、アカ）が語源。「朱・緋（あけ）」の表記が用いられることもりました。
赤には人類共通の普遍性があり、多くの言語で「血」か「火」の色のどちらかの言葉から派生しています。また、呪術的な意味合い、魔除けの意味合いが込められているのも世界的に共通した特徴です。我が国でも縄文時代の土偶や古墳時代の埴輪には、赤く彩色された人物像が多くあり、これらには祭祀的な意味合いがあると考えられています。
ちなみに、太古の時代では「しろ、くろ、あか、あを」は光の明暗を指す言葉でしたが、時代が下がると『赤』と『青』は色相を表す言葉となっていきます。また、平安時代には禁色 と呼ばれる高貴な身分のみに着用が許された特別な色として扱われました。
現代においては、赤はJIS規格の基本色名の一つです。なお、赤は英語ではレッド（red）に相当しましますが、JIS規格では赤とレッドは異なる色となっています。",https://irocore.com/aka/
赤支子（あかくちなし）,"['239', '187', '044']","['10', '32', '90', '00']",#F2934E,"赤支子（あかくちなし）とは、明るい赤みの黄色のことです。『支子色 』が少し赤みがかった色で、支子染 による黄色に紅花染 めを重ねて赤を加えた色になります。
「支子」の色名は平安時代からみられ、もともとは支子色のみでしたが、『深支子 』『黄支子 』『浅支子 』の三種類にわかれました。ちなみに、赤支子の染色法は平安時代の『延喜式 』の『縫殿寮 』に記された深支子と同じ染色法であり、いつからか赤みの支子色ということ「赤支子」と呼ばれるようになったようです。",https://irocore.com/akaikuchinashi/
赤朽葉（あかくちば）,"['219', '132', '073']","['0', '40', '67', '14']",#db8449,赤朽葉（あかくちば）とは、赤みがかった朽葉色で赤茶色のことです。平安時代からある色名で、襲の色としては「表・経紅緯洗黄、裏・黄」を配し、晩秋の頃の赤く色づいた朽葉の色を表した色目です。「朽葉色」に似ていますが、色譜ではそれより華やかものになります。「赤朽葉」の衣は『源氏物語』に「赤朽葉の羅のかざみ」、『かげろふ日記』に「うすもののあかくちばをきたるを･･･」と見えています。,https://irocore.com/akakuchiba/
赤香（あかこう）,"['246', '184', '148']","['00', '25', '40', '04']",#F6B894,赤香（あかこう）とは、赤みがかった淡い橙色のことです。『丁子色 』を薄くしたのが『香色 』で、『丁子色』や『香色』の布地は僧衣に用いられ、平安時代は非常に高価でした。その中でより赤みを増したものが『赤香色』です。ちなみに丁子は生薬 や香辛料として知られていますが、かぐわしい香りのする香木としても知られています。,https://irocore.com/akako-iro/
赤白橡（あかしろつるばみ）,"['254', '210', '174']","['00', '25', '35', '00']",#FED2AE,赤白橡（あかしろつるばみ）とは、櫨で黄色く下染めし、うすく茜の赤を重ねた赤みがかった白茶色です。橡（つるばみ）はブナ科クヌギの古名で、その実のドングリは濃い灰色の染色に用いられるますが、赤白橡はドングリを使った染物の色ではありません。『源氏物語』に｢赤き白橡｣との記述がみられるように、白橡を基本名とした色名です。古くは上皇の着用する高貴な色であり、禁色とされる時代もありました。,https://irocore.com/akashirotsurubami/
赤橙（あかだいだい）,"['234', '085', '006']","['00', '64', '97', '08']",#EA5506,赤橙（あかだいだい）とは、一般にやや赤みの濃い橙色のことです。せきとう色ともいいます。橙色とはミカン科の果実ダイダイの熟した実の色をいいますが、赤橙は成熟がさらに進んだ色で、熟した柿の色に似ています。ちなみに一般的なアカトンボは成長すると赤橙色になります。,https://irocore.com/akadaidai/
茜色（あかねいろ）,"['183', '040', '046']","['00', '78', '75', '28']",#B7282E,茜色（あかねいろ）とは、茜草の根で染めた暗い赤色のことです。夕暮れ時の空の形容などに良く用いられることで知られています。茜草を染料として得る色には他に、緋色がありますが、こちらは鮮やかな赤色で茜色よりはるかに明るい色合いです。ちなみに、やや明るい茜色を英語ではマダーとあらわします。,https://irocore.com/akane-iro/
赤紅（あかべに）,"['216', '031', '053']","['00', '95', '71', '10']",#D81F35,"赤紅（あかべに）とは、鮮やかで濃い赤色のことです。江戸初期から愛用された染色で、天保-貞享の頃には「赤紅の鹿の子染 」が大流行しました。京都上流層の婦人の小袖 の好みを記した『女鏡秘傳書 』にも「赤きもの召し玉はば緋綸子 紅かのこなどよし」と推賞している一文があり、赤や紅 系統が人気があったことがわかります。
それらの赤系統の染色には高価な紅花染めの他に、蘇芳 を用いる代用紅染 めが盛んに行われていました。赤紅の染色もまた蘇芳と明礬 による蘇芳染で染められています。
鹿の子絞りとは、絞り染めの一種で目結 、纐纈 ともよばれます。総絞りにした模様があたかも小鹿の背のまだらに似ていることからその名で呼ばれるようになりました。
鹿の子絞りの原型は奈良時代にまでさかのぼり、江戸時代以降に本格的に発展、現在でも主に和装向けの高級品として流通しています。
",https://irocore.com/akabeni/
赤紫（あかむらさき）,"['146', '007', '131']","['10', '70', '08', '00']",#EB6EA5,"赤紫（あかむらさき）とは、牡丹 や躑躅 のような赤みが強い鮮やかな紫色、または暗く渋い紅色のことです。古代では茜と紫根を用い、酢と椿の灰汁で染めていました。
『赤紫』は一般的に『赤』と『紫』の中間を指しますが、色のイメージが幅広く、JIS規格で定められた色と伝統色では色合いに大きな違いがあります。また、平安の頃で比べても文武天皇の定めた服制では『赤紫』は浅い（淡い）紫ですが、『延喜式 』では暗い『紅色』のことでした。
律令時代の朝服では『濃紫 』に次ぐ高貴な色とされ、源氏物語の『宿木』では、光源氏が唐渡の紫の錦や赤紫の綺 の調度品を用いて拡張の高さを誇る場面が書かれています。赤紫は王朝文化を代表する色の一つだといえるでしょう。
『源氏物語』「絵合」紫式部。長保三年（一◯◯一）頃。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/akamurasaki/
灰汁色（あくいろ）,"['188', '176', '156']","['35', '32', '42', '00']",#BCB09C,灰汁色（あくいろ）とは、灰汁のような黄みがかった灰色のことです。灰汁は藁（わら）や木を燃やしてできた灰に湯を注いだものの上澄みのことで、古くから染色の媒染剤や布の洗剤として利用されました。似た色に灰色がありますが、それは石炭のもえた後にできる中明度の灰の色のことです。,https://irocore.com/aku-iro/
緋（あけ）,"['186', '038', '054']","['34', '97', '82', '03']",#BA2636,緋（あけ）とは、やや黄色みのある鮮やかな赤色のことで、平安時代から用いられた伝統色名です。山野に自生する多年草の茜の根を染料とし、灰汁で媒染しました。色名の｢あけ｣は日や火の色のことです。推古天皇の時代以来、紫に次ぐ高位の色になり、奈良時代に定められた服飾尊卑では19色の中で5番目に位置づけられました。平安時代の中頃から染法が変わり、それに伴い色調も鮮やかな紅緋色に、読み方も｢緋色｣となりました。一般的に、それぞれを区別する場合は茜色を「やや暗い赤」のイメージ、緋色を「鮮やかな赤」のイメージとします。,https://irocore.com/ake/
曙色（あけぼのいろ）,"['249', '163', '131']","['00', '50', '50', '00']",#F9A383,曙色（あけぼのいろ）とは、曙の空を思わせる、朝焼けのような淡い黄赤色です。｢東雲色｣ともいいます。江戸時代前期に、裾を白くし、上部を紅や紫などでぼかしていく｢曙染｣が流行しました。英語色名のオーロラ(英語: aurora/英語: auroral)と同一の色です。,https://irocore.com/akebono-iro/
浅緋（あさあけ）,"['223', '113', '099']","['15', '68', '55', '00']",#DF7163,"浅緋（あさあけ）とは、茜で薄く染めた緋色のこで、わずかに黄みの赤色に用いられます。大宝元年の服制では「直冠上四階深緋。下四階浅緋」となっており、『延喜式』においては紫、深緋、浅緋と、上から3番目に高位だった色です。一般に緋あるいは真緋といわれる色はこの浅緋を指しています。「うすきひ」、「うすあけ」ともいいます。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/asaake/
浅蘇芳（あさきすおう）,"['209', '135', '139']","['00', '50', '25', '20']",#D1878B,"浅蘇芳（あさきすおう）とは、蘇芳染 めの薄い色で明るく渋い紅色のことです。古くからの色名で、別に「あさすおう」とも読まれます。薄く染められた『蘇芳色』に、「薄い」を意味する「浅 」を冠して色名となりました。
平安時代の式目「延喜式 」では、『蘇芳色』は色が濃い順に『深蘇芳 』『中蘇芳 』『浅蘇芳 』と紹介されています。ちなみに、古代では濃い色ほど尊い色とされ、浅い色は下位とされていました。",https://irocore.com/asakisuo/
浅葱色（あさぎいろ）,"['000', '165', '191']","['76', '20', '26', '00']",#00A5BF,"浅葱色（あさぎいろ）とは、蓼藍 で染めた明るい青緑色のことです。浅葱とは薄い葱 の葉に因 んだ色で、平安時代にはその名が見られる古くからの伝統色。
「葱」と「黄」の字を混同されて『浅黄』と表記されている古実書もありますが、これは完全に誤用です。
江戸時代の有職故実 研究家の“伊勢貞丈 ”も、自身の随筆『安斎随筆』に「アサギと云ひて浅黄を用ふるは誤りなり、浅葱の字を用ふるべし」と記しているように、この２色はまったくの別の色になります。ちなみに『浅黄色』は「あさきき」や「あさき」、「うすき」と読まれる文字どおり薄い黄色のことです。
ただし、昔の人はあまり漢字を気にせず当て字を使うことも多く、『浅葱色』を指して『浅黄色』と書いてある場合もあるので読みとく際は注意が必要でしょう。
※有職故実は、朝廷や公家、武家の行事や法令・制度・風俗・習慣・官職・儀式・装束などの先例、典故。また、それらを研究する学問。
日本の伝統色の中でも「浅葱」が付く色名は数多くみられ、『水浅葱 』『花浅葱 』『錆浅葱 』『鴇浅葱 』『薄浅葱 』など様々な派生色が存在しています。
江戸時代、田舎出の武士は着物の裏地に流行遅れの浅葱色を着ることが多かったことから、「浅葱裏 」といえば「野暮な人」の代名詞でした。
浅葱色は幕末に新撰組のダンダラ模様の羽織の色として使用されたことが有名で、伝統色の中でも最も人気の色の一つといえるでしょう。ただし、実際は結成より１年ほどで廃止されており、映画やドラマで見るほど浅葱の羽織は着られませんでした。
また、羽織の色は『浅葱色』ではなく『浅黄色』とする説もあります。",https://irocore.com/asagi-iro/
浅葱鼠（あさぎねず）,"['148', '168', '176']","['30', '00', '11', '30']",#94A8B0,"浅葱鼠（あさぎねず）とは、曇天の空の色に近い青緑色をおびた渋い鼠色のことです。
色名は文字どおり『浅葱色 』がかった『鼠色 』に由来しており、鼠色が流行した江戸時代に生まれた色名です。
浅葱鼠は鼠色の系統ですが、色合い的には鼠色がかった浅葱色というほうが近く、『錆浅葱 』より彩度が低い色合いになります。
江戸時代は鼠色が大流行しましたが、「浅葱」が付く色名も数多く生まれました。『水浅葱 』『花浅葱 』『鴇浅葱 』『薄浅葱 』などの色も同時代に派生した色です。",https://irocore.com/asaginezu/
浅縹（あさはなだ）,"['132', '185', '203']","['35', '09', '00', '20']",#84B9CB,"浅縹（あさはなだ）とは、やわらかい青色のことで藍染により浅く染めた縹色に用いられます。また『水縹 』も同じ程度の色です。『薄縹 』とも呼ばれることもありますが、『浅葱色 』という色名のほうがよく用いられるようになりました。
「養老律令 （七五七）」の朝服条によれば、『浅縹』は朝廷への出仕に着用する朝服の初位の色とされており、対語の『深縹』は八位の色と規定されています。",https://irocore.com/asahanada/
浅緑（あさみどり）,"['155', '207', '151']","['44', '00', '50', '00']",#9BCF97,"浅緑（あさみどり）とは、春に芽吹いた若葉のような、うすい緑色のこと。または、黄みがかった明るい緑色のことです。別に「あさきみどり」「せんりょく」とも読まれます。『万葉集』にも「浅緑 染め懸けたりと みるまでに 春の楊 は 萌えにけるかも」と詠まれているように、万葉の頃からの伝統色です。対になる色は『深緑 』。
現在では浅緑といえば薄い緑色のほうが一般的ですが、古くは黄緑色のほうを指していました。実際、平安時代の式目『延喜式 』でも「あさきみどり」と読まれ、『深緑』や『中緑 』とともに明るい黄緑色として紹介されています。
律令制に定められた官位と服色では浅緑は深緑に次ぐ色で、深緑が常緑樹の青みの深い緑色を表すのに対し、浅緑は春の柔らかな若葉、特に柳の若葉の色を表し、『紅梅色 』と組み合わせて初春によく用いられました。ちなみに、浅緑は「糸」「野辺」に掛かる枕詞でもあります。
",https://irocore.com/asamidori/
浅紫（あさむらさき）,"['196', '163', '191']","['00', '17', '03', '23']",#C4A3BF,浅紫（あさむらさき）とは、薄い紫色のことで、薄紫（うすむらさき）ともいいます。平安時代の頃、紫は最高位の色とされ、なかでも最上位である深紫か黒紫よりやや劣るものの、その次にあたる高貴な色でした。また薄色といえば紫の薄い色をさしていました。,https://irocore.com/asamurasaki/
小豆色（あずきいろ）,"['160', '073', '064']","['50', '85', '80', '00']",#A04940,小豆色（あずきいろ）とは、赤小豆の実の色のような茶色がかった赤紫のことです。江戸時代になってから色名として用いられています。同系統の「小豆茶」、「小豆鼠」とともに着物の表などに多く使われました。古代から赤は祈願の色として使われ、小豆を使った赤飯は、子供のお食い初め、祝い事、年中行事には欠かせないものです。,https://irocore.com/azuki-iro/
小豆鼠（あずきねず）,"['113', '84', '84']","['62', '69', '69', '14']",#715454,小豆鼠（あずきねず）とは、小豆色がかった鼠色のことです。赤みのある鼠色に用いられます。江戸時代、小豆色よりくすんだ色に鼠をつけ小豆鼠としました。百鼠の一部で、ほかに臙脂鼠、紅鼠などもあります。,https://irocore.com/azukinezu/
亜麻色（あまいろ）,"['199', '184', '151']","['00', '11', '30', '30']",#C7B897,"亜麻色（あまいろ）とは、亜麻を紡 いだ糸の色のような黄色がかった薄茶色のことです。日本古来のものではなく、明治以降に使われるようになった比較的新しい色名。
フランスの作曲家“ドビュッシー”の前奏曲『亜麻色の髪の乙女（La fille aux cheveux de lin）』が有名であるため、一般的に髪の色として知られています。ただ、亜麻色は「金髪の一種」という誤解があるようですが、正しくは薄い栗色の髪を指しており、金髪とは少しイメージが異なります。
亜麻はヨーロッパが原産で紀元前から栽培されており、人類最古の繊維とも言われています。亜麻の種子を絞れば亜麻仁油 に、茎からとれる繊維で織ったリンネル（リネン）製品は高級な麻織物になります。
日本では明治初期、ロシア公使だった“榎本武揚 ”が寒冷地に適した亜麻の栽培を推奨し、北海道開拓使によって北海道での栽培が始まったと言われています。
同じ読みの色に『天色 』という色がありますが、こちらは鮮やかな青色のことです。
ちなみに、“ヴィレッジ・シンガーズ”や“島谷ひとみ”が同名の「亜麻色の髪の乙女」という曲を歌っていますが、その歌詞には亜麻色の他に、『薔薇色 』と「青い空」という単語が象徴的にでてきます。もしかしたらこの青い空とは、もう一つの『天色 』を指しているのかもしれませんね。",https://irocore.com/ama-iro/
天色（あまいろ）,"['000', '134', '204']","['85', '32', '00', '00']",#0086CC,"天色（あまいろ）とは、晴天の澄んだ空のような鮮やかな青色のことです。『真空色 』の別名も。「天」は「あめ」とも読まれますが「あま」と読むのが一般的です。
天色は読み方によって色や意味が違っています。「あめいろ」と読む場合は天色 と同じ色を指しますが、「そらいろ」と読まれる場合は『空色 』と同じ色を意味し、天色 よりも薄い青色を指しました。また「てんしょく」とも読まれ、
この場合は色ではなく単に天候や空模様 を指すことが多いようです。
ちなみに、同じ読みの色に『亜麻色 』がありますが、こちらは黄色がかった薄茶色のことです。",https://irocore.com/amairo/
飴色（あめいろ）,"['205', '097', '024']","['00', '68', '90', '20']",#CD6118,"飴色（あめいろ）とは、水飴 に由来する、深みのある強い橙色のことです。現在の水飴は無色透明なものが一般的ですが、古くからの水飴は麦を原料とした麦芽水飴で、透明感のある『琥珀色 』をしています。ちなみに、古くは飴 といえば「水飴」を指しました。
水飴は、米や芋などのデンプンに麦芽の酵素を加えて作ったもの。琥珀色の透明感がある粘液状の甘味料。我が国では古くから作られており、『日本書紀』にもその名が見られます。
水飴はそのまま食べられるほか、砂糖が伝来する前には主要な甘味料として利用されていました。現在でも和菓子などでは甘味料のひとつとして使われています。
飴色は、琥珀色とともに透明感のある濃い橙色を表す色です。使い込まれた木製の家具や、革製品の色を表現する際に使われており、また、タマネギを甘みが出るまで炒めるときも「あめ色になるまで」と表現されるように、「時間の積み重ねを表す色」ともいえるでしょう。
飴色と同じ読みの色に『天色 』がありますが、こちらは鮮やかな青色のことです。",https://irocore.com/ame-iro/
菖蒲色（あやめいろ）,"['177', '104', '168']","['30', '55', '05', '00']",#B168A8,"菖蒲色（あやめいろ）とは、菖蒲 の紫の花の色に似た赤みがかった紫色のことです。「あやめ」は花の色も呼び名も美しいことから、古くから用いられた色名ですが、もともとは襲の色名で「表・青、裏・紅または紅梅」が夏に用いられました。
染め色として現れたのは後世のこと。江戸時代の染色技法の指南書『手鑑模様節用』には「あゐかちたるをききやうといふ、赤みかちたるを、あやめと、となふ」とあります。
最近は「菖蒲」の字は「しょうぶ」と読む方が一般的ですが、中世の日本では「あやめ」と読まれていました。また、しょうぶの花はあやめの花に似たイメージがあるかと思いますが、実際のしょうぶの花は稲穂のような形であり、まったく別の種類です。あやめに似た花は「花菖蒲」というまた違う種類になります。ちょっとややこしいですね。",https://irocore.com/ayame-iro/
洗柿（あらいがき）,"['240', '182', '148']","['00', '25', '30', '05']",#F0B694,洗柿（あらいがき）とは、柿色が淡くなった橙色のことです。｢洗柿｣とは、洗って晒され薄くなった柿色の意味です。西鶴の『好色一代男』にも洗柿という色の染色の色名が使われていて、それがあまりきれいな色とは思われなかったことがわかります。ちなみに「洗」という修飾語はオレンジから赤系統の染色によく使われていました。,https://irocore.com/araigaki/
洗朱（あらいしゅ）,"['208', '130', '108']","['00', '38', '48', '18']",#D0826C,洗朱（あらいしゅ）とは、薄い朱色のことで黄色みを帯びた朱色、くすんだ黄赤に近い色のことです。主に朱塗りの漆器で用いられほか、布地の染色にも使われています。朱色を洗って薄くなったような色を形容していますが、はじめから洗朱に塗った色をさしています。,https://irocore.com/araishu/
退紅（あらぞめ）,"['255', '179', '167']","['0', '30', '20', '10']",#FFB3A7,退紅（あらぞめ）とは、桜色と一斤染の中間の赤みのごく薄い赤紫色で、色名は褪めた紅の意味です。九世紀頃は「洗染」の略語とされていました。『延喜弾正台式』では、韓紅花、中紅花のつぎの薄い紅花染めの染色名で「あらぞめ」と訓まれていますが、従者などの身分の低い者が着用した場合は「たいこう」と訓んだそうです。,https://irocore.com/arazome/
淡藤色（あわふじいろ）,"['210', '208', '232']","['20', '18', '00', '00']",#D2D0E8,"淡藤色（あわふじいろ）とは、うすく淡い青紫色のことです。優しく女性らしい『藤色 』をさらに淡くした色で、『うすふじいろ』とも読まれます。
藤色は平安の頃から女性に人気の色で、染色技術が発達した江戸時代には「藤」の名を冠する多くの派生色が生まれました。『紅藤 』や『紺藤』、『藤紫 』などもこの時代に生まれた色名です。なお、同じ薄い藤色に色名も似ている『薄藤色 』がありますが、『淡藤色』より少し色合いが濃い別の色になります。",https://irocore.com/awafuji-iro/
杏色（あんずいろ）,"['244', '164', '102']","['0', '45', '60', '0']",#F4A466,"杏色（あんずいろ）とは、熟した杏の果実のようなやわらかい橙色のことです。
杏はバラ科サクラ属の落葉小高木で梅やスモモの近縁種。我が国でも古くから栽培されていましたが、果肉を食すためではなく種の中にある『杏仁 』を漢方薬として使用するために収穫されていました。
平安時代には『唐桃 』と呼ばれ『古今和歌集 』にもその名が見られます。
「あふからも ものはなほこそ 悲しけれ 別れんことを かねて思へば」（古今和歌集）。
ただし、『杏』が色名となったのは明治以降に『アプリコットカラー』が伝わりそれが和訳されてから。
日本では古来より実の色が色名となることは少なく、多くは花の色が色名となっています。ちなみに、杏の花は淡い薄紅色。逆に西洋では実の色が色名となることがほとんどであり、杏色（アプリコットカラー）もその例にもれず実の色が元になっています。
杏色に似た色に『枇杷色 』がありますが、やはり近代になってできた色名です。
杏の果実
杏の果実",https://irocore.com/anzu-iro/
威光茶（いこうちゃ）,"['168', '162', '086']","['34', '36', '66', '00']",#A8A256,"威光茶（いこうちゃ）とは、柳葉色より茶みを帯びた明るい色でやや茶みのある黄緑色のことです。別に『威公茶 』とも表記します。
「手鑑模様節用 」の威光茶の色譜に「威光茶。或いは柳茶ともいふ。」と記されていることからも『柳茶 』と同色と思われますが、厳密には威光茶よりも柳茶のほうが黄みがかっています。
ちなみに威公 とは、水戸徳川の祖 “徳川頼房 ” の諡号 （※）、威光茶の色合いを頼房が好んだ事から付いた色名のようです。
※諡号とは、死後に贈られる名前。",https://irocore.com/ikoucha/
苺色（いちごいろ）,"['187', '085', '097']","['34', '78', '52', '00']",#bb5561,苺色（いちごいろ）とは、鮮やかに色づいた苺の実のような、少し紫がかった赤色のことです。ここでいう苺は江戸時代末期にオランダから伝わったオランダ苺のことで、それ以前は木苺を指していました。日本古来の色名ではありません。,https://irocore.com/ichigo-iro/
一斤染（いっこんぞめ）,"['252', '212', '213']","['01', '20', '09', '00']",#FCD4D5,"一斤染（いっこんぞめ）は、染料の紅花一斤 で絹一疋 を染めた淡い紅色のことです。平安時代は紅花が高価であったため、濃い紅染は『禁色 』とされ、天皇の許可がない限り着用が禁止されていました。ただ、一斤染のような薄い紅染の場合は、『聴し色 』として身分の低いものの着用が許されており、このことから一斤染の別名を『聴色 』とも呼ばれます。
聴し色である淡い紅色には、他に『退紅 』がありますが、こちらは一斤染の半分の紅花八両で染めらました。また『今様色 』も同様に淡い色でしたが、後世になるにしたがって段々と濃くなっていったようです。ちなみに、『韓紅 』のような鮮やかな紅赤に染めるには紅花十斤が必要といわれ、一斤染の布が二十反も染められるほどの量でした。
※一斤=600g、八両=300g　※一疋は二反。一反は大人一人分の布地の量。
",https://irocore.com/ikkonzome/
今紫（いまむらさき）,"['086', '055', '121']","['29', '55', '00', '53']",#563779,"今紫（いまむらさき）とは、青みを帯びた鮮やかな紫色のことです。一般的に「江戸紫」として知られており、歌舞伎の「助六」が頭に巻いている鉢巻の色はこの色です。
青みを帯びた「江戸紫」に対し、赤みを帯びた紫は「京紫」と呼ばれました。この京紫系に「古代紫」というくすんだ紫があり、その色に対して「今紫」と呼ばれるようになったようです。染色法としては、藍下の上に蘇枋で染めました。",https://irocore.com/imamurasaki/
今様色（いまよういろ）,"['208', '087', '107']","['23', '78', '45', '00']",#D0576B,"今様色（いまよういろ）とは、「今流行 りの色」という意味で少し淡い紅色のことです。なお「今」とは平安時代のこと。遅くとも１０世紀頃には流行していました。重 ねの色目にもみられ、「表・紅梅 、裏・濃紅梅 」を配し、平安文学でもよくみられます。
今様色の色合いは、書物によって「一斤染 より薄い紅色」や「紅梅色より濃い色」など表記がバラバラなのですが、『源氏物語』の玉鬘の巻において、光源氏が、最愛の妻である “紫の上 ” への贈り物の衣装に「今様色」を用いていることからも、聴色 である『一斤染 』より色合いの濃い、『禁色 』に入るほどの色相ではないかと思われます。
実際、“一条兼良 ” による源氏物語の注釈書『花鳥余情 』にも「今様色とは紅梅の濃きを云なり。」との記述があり、『濃紅梅 』と『紅梅色』の中間にあたる少し濃い紅梅色の説が有力とえいるでしょう。",https://irocore.com/imayou-iro/
岩井茶（いわいちゃ）,"['111', '111', '067']","['71', '60', '85', '00']",#6F6F43,"岩井茶（いわいちゃ）とは、やや茶みがかった黄緑色のことです。江戸後期、文化文政の頃、町人社会に取材した生世話物（きぜわもの）を当たり役として大活躍した五世岩井半四郎が愛用したことによる流行色です。
「目千両」と呼ばれるほどの眼差しと、すこし下唇が出たおちょぼ口が魅力的で、しかも容姿抜群、愛嬌もたっぷりという三拍子揃った五代目は、すぐに江戸一の人気役者。芸の方もしっかりしており、愛用した岩井茶は江戸の女性の間で大評判となりました。さらに、彼が使用して流行したものには、半四郎鹿の子、岩井櫛、半四郎小紋、岩井香などがあります。",https://irocore.com/iwaicha/
不言色（いわぬいろ）,"['253', '216', '118']","['00', '18', '60', '00']",#FDD876,"不言色（いわぬいろ）とは、少し赤みのある黄色のことです。クチナシの実で染められた『支子色 』の別名で、クチナシの読みを「口無し」にかけた色名。『言わぬ色』『謂わぬ色』とも表記します。
不言色は言葉遊びがそのまま色名になったような伝統色ですが、用例は古く、平安文学の「狭衣物語 」や「新古今和歌集 」にもその名が見られます。
不言色が生まれた後も支子色のほうが一般的に使われていることから、不言色はちょっと洒落た言い方をする場合や、和歌の文字数の関係で使われるだけの、あまり一般的な色ではなかったようです。


",https://irocore.com/iwanu-iro/
鶯色（うぐいすいろ）,"['131', '139', '013']","['23', '00', '90', '50']",#838B0D,"鶯色（うぐいすいろ）とは、鶯の羽のような暗くくすんだ黄緑色のことです。江戸時代からの色名ですが、当時は茶系が流行色であったため、鶯色を茶色がからせた『鶯茶 』のほうが粋な色として人気があり、当時「ウグイス」といえば『鶯茶』を指していました。
鶯色が一般に認められるようになったのは明治後期に流行色となってからです。
鶯はスズメ目ウグイス科の小鳥で、日本全土に分布する留鳥 。古くから親しまれ、奈良時代には「法告鳥 」と呼ばれました。また春に「ホーホケキョ」の美しい囀 りを聴かせてくれることから「春告げ鳥」とも呼ばれ、『万葉集』には鶯を読んだ詩が四十八種もあります。
鶯色の染法は、江戸時代の書物『染物秘傳 』に「白豆汁一返、もみ出し豆汁一返、其上かりやすに白凡三匁入」とありますが、春を感じさせる色として用いるときは、新緑のイメージもあってやや薄く明るい色にすることがあります。
ちなみに、鶯色の使われ方としては青豌豆 を煮た「鶯豆 」、蓬 などを混ぜた「鶯餠 」、最近で言えば菓子パンの「うぐいすパン」などが典型的。
この系統の色として、明るい新緑の色『萌黄色 』、黒ずんだ鶯色の『鶯煤竹 』、さらに黒みを増した『千歳茶 』などがあります。
ウグイスというと下記の写真の鳥をイメージしがちですが、こちらは「メジロ」という鳥で目の周りが白いことが特徴です。

ウグイスの写真は下記になります。メジロのように目の周りは白くありません。
",https://irocore.com/uguisu-iro/
鶯茶（うぐいすちゃ）,"['113', '092', '031']","['00', '19', '73', '56']",#715C1F,鶯茶（うぐいすちゃ）とは、鶯の羽のような褐色がかった渋みのある黄緑色のことです。江戸以後によく使われた色名で、海松色とならんで数少ない黄緑系の和式名のひとつとして現在でもよく用いられています。江戸時代には落ち着いた色合いとして、女性の小紋などに愛用され色で、浮世草子や浄瑠璃などに色名が見られるほか、浮世絵の美人画や役者絵の着物の色に使われています。,https://irocore.com/uguisucha/
鬱金色（うこんいろ）,"['247', '194', '041']","['07', '30', '85', '00']",#F7C229,"鬱金色（うこんいろ）とは、鬱金草の根で染めた赤みの鮮やかな黄色のことです。英名では『ターメリック』。派手で目立つ色が好まれた江戸前期頃には、赤系の『緋色 』に次いで紬 や着物の地色として愛好され、また鬱金という字が「金が盛んに増える」という意味に通じることから、縁起 を担いで財布や風呂敷などの染色として人気の色でした。
鬱金はショウガ科ウコン属の多年草。インド原産で日本には奈良時代に伝来しました。ちなみに「鬱金」の原義は「鮮やかな黄色」。呉音「ウッコン」が転訛しウコンとなったようです。古くから生薬として、またその根から鮮やかな黄色の染料が取れることから沢庵漬けなど食品の着色料、そして黃染めの原料として広く用いられてきました。
鬱金による染色は、灰汁 を利かせると赤みが強くなり、酢を利かせると赤みの少ない鮮やかな黄色になりますが、「うこん。底にあかみなきを黄染といふ」と『手鏡模様節用 』にも記されているように、『鬱金色』といえば後者の赤みの少ない色を指します。
また『日本居家秘用』には「うこんの粉を、絹一反には八両ほど水へいれ、茶碗に酢を半分ほど入そむる。但二時ばかりつけ置たるがよし。冬ならは湯にて染る」との記述もあります。
『鬱金色』は、江戸幕府の奢侈禁止令 等もあり江戸中期には流行から一旦消えてしまった色ですが、その豪華で鮮やかな色合いは元禄文化を象徴する色の一つとも言えそうです。",https://irocore.com/ukon-iro/
薄青（うすあお）,"['160', '206', '168']","['40', '00', '40', '05']",#A0CEA8,"薄青（うすあお）とは、黄みの淡い浅緑色のことです。緑は現代では緑色系統の総称ですが、昔は『緑色』は『青 』の系統に含まれており、『萌黄 』の色名で表現していました。いまでも木の葉が茂るさまを「青々」と形容するのはそのためです。
また、成長した植物の葉の色を、一般名として「青」と呼び、公式名として「緑」とよんでいることから、淡青は『延喜式 』の『縫殿寮 』に記述がある『浅緑 』にあたる色だと思われます。
薄青の染色法は、藍染 めに黄蘗 で黄みを加えて染められました。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/usuao/
薄浅葱（うすあさぎ）,"['162', '215', '221']","['40', '00', '15', '00']",#A2D7DD,"薄浅葱（うすあさぎ）とは、浅葱色 を薄くしたような淡い青緑色のことです。『淡浅葱』とも表記します。『浅葱色』は平安時代からの伝統色で、もとは若い葱 に因 んだ色。ただ実物の葱よりも青みが強く浅い色となっています。
浅葱色は江戸時代の元禄期 から正徳期 にかけて流行し、多くの派生色が生まれました。水色がからせた『水浅葱 』、くすませた『錆浅葱 』、花色がからせた『花浅葱 』など。薄浅葱もまた、薄い浅葱色の染め色を形容したものが、そのまま色名として定着したものでしょう。
薄浅葱の涼しげで爽やかな色合いは、上品でお淑 やかな色として現在でも人気の色です。",https://irocore.com/usuasagi/
薄色（うすいろ）,"['206', '180', '185']","['25', '35', '20', '00']",#CEB4B9,"薄色（うすいろ）とは、紫根に椿灰汁または明礬で染めた薄い紫色のことです。一般的に薄色といえば淡い色を指しますが、濃い紫を濃色（こいろ）というのに対し、淡い紫色を薄色とよびました。これは平安時代、紫が高貴な色であるため色の代表として扱われていたことによります。『延喜式』縫殿寮にはその染色法が書かれており、綾一疋を紫草五斤で染めるとあり、これは深紫を染める紫根の量の六分の一にすぎません。ちなみに、薄色は紫の色みが淡いので、禁色とはされませんでした。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/usu-iro/
薄柿（うすがき）,"['212', '172', '173']","['20', '38', '25', '00']",#D4ACAD,"薄柿（うすがき）とは、柿渋 で染められた淡い柿色のことです。また薄い『柿色』の総称で、『洒落柿 』のような黄みが強い淡い柿色から、色見本のような赤みが残る薄い柿色まで幅広い色合いを指します。
江戸時代中末期の安永・天明期(一七七二〜一七八九)に帷子 を『薄柿』に、足袋 を『白薄柿 』に染めることが流行しました。
『柿色』は江戸時代の流行色の一つで、『黒柿 』『大和柿 』『照柿 』『水柿 』など様々な色があります。",https://irocore.com/usugaki/
浅黄（うすき）,"['237', '211', '161']","['00', '11', '32', '07']",#EDD3A1,"浅黄（うすき）は、苅安草と灰汁で浅く染めたうすい黄色のことです。平安時代の格式『延喜式 』にも記された古い色名で、『深黄色 』の対色。古い呼び名は「あさぎ」、別に「あさきき」「あさき」とも読まれます。
古くから浅い藍色の『浅葱色 』と混同された色で、平安後期の歴史物語『今鏡 』にも「あさぎと日記に侍 なるをば『青き色か、黄なる色か』などおぼつかなてく、」と書かれています。
近世になっても「浅黄」と書いて『浅葱色』を指すことが多く、江戸時代では『浅葱色』との混同を避けるため、うすい黄色には『薄玉子 』と呼んで区別しました。また、混同を避けるために「うすき」の読みが定着したのでしょう。
『浅黄』の染料は『延喜式』縫殿寮 の雑染用度によれば「綾一疋に、苅安草大三斤八両、灰一斗二升、薪三十斤。」とあり、対色の『深黄』の用度が『綾一疋に、苅安草大五斤、灰一斗五升、薪六十斤。』とあるので、苅安の用度の差により『浅黄』の黄色の濃度を知ることができます。
※綾 は無地染めの綾織りの絹。一疋 は二反 分の長さで22ｍ前後。
※一斤は約600g。両は1/16斤で約37.3g。
※斗は18リットル、升は1/10斗で1.8リットル。
一説に新選組の羽織の色は『浅葱』ではなく、『浅黄』だとする説もあります。
これは当時の資料に羽織の色を『浅黄』と表記するものが多く見られるからです。
ただし、近代まで当て字をすることはそれほど珍しくなかったため「浅黄」と書いて『浅葱』を指していた可能性も十分にありえます。",https://irocore.com/usuki/
淡黄蘗（うすきはだ）,"['249', '241', '192']","['00', '02', '30', '05']",#F9F1C0,"淡黄蘗（うすきはだ）とは、黄蘗染 めの薄い色で明るく淡い黄色のことです。薄い黄色を表す『淡黄 』よりも更に薄い色になります。ちなみに『黄蘗 』は『刈安 』と並んで日本の代表的な黄染の染料であり色名です。
黄蘗とはミカン科の落葉高木。日本全土に自生し樹皮をはぐと黄色の内皮があらわれることからこの名がつけられました。黄蘗の樹皮は「おうばく」とも呼ばれ、古くから染料や腹痛に効く漢方薬として用いられてきました。平安時代の『延喜式 』によれば藍と黄蘗で『緑』や『藍色 』を染めたという記述があります。また、黄蘗による黄染は紙を染めると虫食いを防ぐ効果があることから、写経用の染紙にも用いらました。
明るいのに儚げ な雰囲気のある『淡黄蘗』は、まるで暗い水平線から顔を出したばかりの月の色のようです。",https://irocore.com/usukihada/
薄紅（うすくれない）,"['177', '92', '101']","['0', '64', '32', '24']",#B15C65,薄紅（うすくれない）とは色名の一つで、淡く、ややくすんだ紅色（べにいろ）のことです。「くれない」は古い読み方で、近世以降は「べに」とも読みます。『万葉集』を詠んだ万葉歌人はこの色の衣を「くれなゐの薄染衣」と詠んでかりそめの思いを託していました。薄紅は紅色を帯びた色合いの形容として一般に用いられ、薄さの程度は時代によって少しずつ異なり、桃色に近い色から、赤みの強い色まで幅広い階調をあらわしています。,https://irocore.com/usukurenai/
淡香（うすこう）,"['243', '191', '136']","['00', '21', '44', '05']",#F3BF88,淡香（うすこう）とは、黄みの淡い黄褐色のことです。香料の丁子で染めるため、しばらくは丁子の香りがします。『源氏物語』に｢うすいろのこうのさしぬき｣とあるように、薫香趣味が盛んだった平安時代に愛好されました。練色より白さが抑えられ、やや大人しい印象です。,https://irocore.com/usuko/
薄桜（うすざくら）,"['252', '245', '247']","['00', '05', '01', '02']",#FCF5F7,"薄桜（うすざくら）とは、薄い桜の花の色のようなほんのり紅みを含んだ白のことです。『薄花桜 』の別名も。最も薄い紅染 めの色とされる『桜色』の中でも、さらに薄い色になります。
淡い紅色をさらに細かく区別したこの色名には、日本人にとって特別な花である「桜花」を大切に思う心と、繊細な感性があらわれているといえるでしょう。
ちなみに「桜」を冠する伝統色としては、他にも穏やかで落ち着いた薄紅色の『灰桜 』や、江戸時代の流行色である鼠色系の『桜鼠 』などの色があります。",https://irocore.com/usuzakura/
薄墨色（うすずみいろ）,"['163', '163', '162']","['00', '00', '01', '36']",#A3A3A2,薄墨色（うすずみいろ）とは、墨を薄めたようなやや薄い灰色のことです。淡墨色ともかきます。色名としても古く、鼠色や灰色という色名が使われる以前から用いられてきました。薄墨色は平安時代、喪服の染色や訃報を知らせる手紙の墨に用いられ、あまりよい色ではありませんでした。ちなみに今も薄墨衣といえば、多くは喪服に使用されています。,https://irocore.com/usuzumi-iro/
薄花色（うすはないろ）,"['130', '169', '218']","['52', '25', '00', '00']",#82A9DA,"薄花色（うすはないろ）とは、花色 を薄くしたような、明るくうすい青紫色のことです。平安時代からの色名。『花色』は藍 の単一染めの『縹色 』の別名で『花田 』とも呼ばれていました。その花色の薄い色が色名として定着したのが薄花色です。ちなみに、花色の由来は、かつて月草 の花の青い汁で摺染 をしたことに因 んでいます。
一般的に薄い縹色は『浅縹 』や『浅葱色 』と呼ばれるため、薄花色をこれらの色と同色とする説もありますが、薄花色のほうが紫みが強い色になります。
平安中期の女流歌人にして三十六歌仙の一人“小大君 ”の歌集『小大君集』には、薄花色の色合いの微妙さや、月草で染めたものが色が移りやすいことにかけて、心の移ろいを描いている歌を詠みました。
「人ごころ　うす花染めの狩衣 　さてだにあらで　色やかはらむ」",https://irocore.com/usuhana-iro/
薄藤（うすふじ）,"['199', '195', '225']","['25', '23', '00', '00']",#C7C3E1,"薄藤（うすふじ）とは、伝統色の藤色をより薄くした淡い青紫色のことです。色名が見られるようになるのは江戸時代から。『藤色』は平安の頃より日本女性の着物の色として人気で、その時々で様々な派生色が現れました。
染色は紫草と紅花で染められますが、浸している時間や染材の温度変化によって色調が微妙にかわり、そのわずかな色合いごとに『薄藤色』『紅藤色 』といった色名が付けられました。
ちなみに、同じ読みの色に『淡藤 』がありますが、こちらは『薄藤』よりさらに薄い青紫色です。 なお、『淡藤』は「あわふじ」とも読まれます。",https://irocore.com/usufuji-iro/
淡紅藤（うすべにふじ）,"['233', '195', '220']","['08', '30', '00', '00']",#E9C3DC,"淡紅藤（うすべにふじ）とは、やや赤みをふくんだ薄い紫色のことです。
江戸時代後期に流行した『紅藤色 』の派生色。『薄紅藤 』と表記される場合もあります。
和装の色としては『紅藤』は若向きの色とされており、『淡紅藤』もまた、ほんのり紅みの慎ましやかな色合いが若い女性に人気の色でした。ちなみに『紅藤』も元は『藤色 』の派生色です。",https://irocore.com/usubenifuji/
薄水色（うすみずいろ）,"['188', '225', '223']","['30', '00', '15', '00']",#BCE1DF,"薄水色（うすみずいろ）とは、文字通り水色を薄くしたような、淡い青緑色のことです。
『万葉集』で『水縹 』と呼ばれていた色が、江戸時代になると『水色 』と呼ばれるようになります。それをさらに淡くしたのが『薄水色』で、もとは水色の薄い色を形容していたものが、色名として定着したようです。
ちなみに、同じ読みの色名で『淡水色 』がありますが、淡水色のほうがさらに薄い色をしています。",https://irocore.com/usumizu-iro/
薄緑（うすみどり）,"['202', '229', '205']","['25', '00', '25', '00']",#CAE5CD,"薄緑（うすみどり）とは、その名のとおり薄い緑色のことです。『淡緑 』とも表記され、その場合は「たんりょく」とも読まれます。もとは文字どおり「薄い緑」を形容したものが色名となりました。
同じような薄い緑色を指す色名に『浅緑 』がありますが、こちらは平安時代の格式『延喜式 』にも表記された伝統色で、色みも黄みがかった薄い緑色になります。
ちなみに、平安末期の武将“源義経”は熊野別当（※）から贈られた刀「吠丸 」の名を、刀身に映した熊野の春の山の色にちなみ「薄緑 」に改め愛用しました。
この刀「薄緑」はもともと「膝丸 』という名で、「髭切 」とともに源氏重代 の太刀。「蜘蛛切 」「吠丸」「薄緑」と持ち主により度々名を変えています。
※熊野別当とは、熊野三山（熊野本宮大社、熊野速玉大社、熊野那智大社）の統括にあたった役職
※重大の太刀とは、代々伝わる太刀のこと。",https://irocore.com/usumidori/
薄柳（うすやなぎ）,"['224', '231', '170']","['13', '00', '40', '05']",#E0E7AA,"薄柳（うすやなぎ）とは、春の日差しを受けた柳 の若葉のような淡い黄緑色のことです。
江戸時代に登場した『柳染 』の派生色。薄く染めた柳染で春の淡い柳の葉を表現した色だと思われます。


柳は、ヤナギ科ヤナギ属の樹木の総称。日本には約30種類のヤナギ属の種が存在しますが、一般に「柳」と言えば細長い葉を垂らした『枝垂柳 』を指します。これは枝垂柳が古くから街路樹として用いられてきたため馴染み深いからでしょう。また江戸時代には水辺、水路沿いの護岸の意味でよく植えられてきました。


柳は春の季語にもなっているように、葉がまだ瑞々しい頃が特に美しく、春風に細く垂れ下がった無数の枝がゆらぐさまは、思わず見入ってしまうほど幻想的な景色です。

そんな春の柳を表現した『薄柳』ですが『凶色』とも言われています。これは『薄柳』の淡く儚い色合いと江戸の頃より柳といえば幽霊がつきものということが関係があるのかもしれません。



",https://irocore.com/usuyanagi/
空五倍子色（うつぶしいろ）,"['157', '137', '108']","['00', '13', '31', '38']",#9D896C,"空五倍子色（うつぶしいろ）とは、五倍子 で染めた灰色がかった淡い茶色のことです。
五倍子は白膠木 の木にできる虫の瘤 のこと。中が空洞なことから空五倍子と呼ばれ、これを粉にして染めたことからこの色名になりました。
五倍子にはタンニンが多く含まれ、染め色は薄墨色に近い色になります。薄墨と同様に凶色とされ、古来より喪服の色として使われました。古典小説などに登場する「薄墨の衣」の多くは五倍子で染めたものです。
五倍子粉 の主成分である可溶性タンニンが鉄漿 の定着をよくすることから、明治以前の習慣であるお歯黒の材料として使われてきました。",https://irocore.com/utsubushi-iro/
卯の花色（うのはないろ）,"['251', '251', '246']","['01', '00', '04', '02']",#FBFBF6,"卯の花色（うのはないろ）とは、卯の花のようなわずかに黄みがかった白色のことです。平安時代からの伝統色名で、代表的な『白色』のひとつ。卯の花は空木 の木に咲く初夏の花ですが、小さい白い花が枝いっぱいに咲くさまが平安時代には「雪かとまがう」と形容され、古来より「白さ」をあらわす言葉として用いられました。
卯の花とは空木 の花の別称。空木はアジサイ科ウツギ属の落葉性低木。北海道南部から九州にかけて広く分布し、日本各地の山野でふつうに見られます。
初夏の季節、枝先に1cm程の小さな白い花を数多く咲かせ、その花が雪のように見えることから「雪見草」とも呼ばれました。
空木の名の由来は、枝の内部が空 なことに因 み「空ろな木=空木」から。「卯の花」の名の由来は「空木 の花」を省略して「うのはな」と名付けられています。また、旧暦四月を「卯月 」というのも「卯」の花が咲く「月」ということから名付けられました。
ちなみに、豆腐の残りカスの「おから」を「卯の花」と呼ぶのは、色と形状が似ていることと、空木の枝の芯が空（から）なことにかけた言葉遊びによるものです。
重 ねの色目としての卯花襲は、「表地・白、裏地・青」を配して卯の花を表現した夏の色です。ちなみに、この場合の「青」とは今でいう『緑色』のこと。
このように襲の色目には白・白以外の配色でも「白い色」を表している色目がいくつかあります。例えば、春の色の『梅の衣』は「白と蘇芳 」、秋の色の『白菊』は「白と青」、冬の色の『雪の下』は「白と紅梅」などです。これらの色は裏に配する色によって表の白を際立たせ、より白く見せようとしたものかもしれません。",https://irocore.com/unohana-iro/
梅重（うめがさね）,"['233', '084', '107']","['00', '80', '40', '00']",#E9546B,"梅重（うめがさね）とは、重なり合った紅い梅の花のような明るい紅赤 色のことです。平安時代の重 ねの装束 に由来した色名で、色目としては「表・濃紅 、裏・紅梅 」で紅梅の花の重なりを表した配色となっており、十一月から二月にかけて着用されていました。
梅の花といえば一般的には白なこともあり、「表・白、裏・紅梅」で白梅と紅梅の重なりを表現しているのが『梅重』という別説もありますが、平安後期の有職家の源雅亮 が記した『満佐須計装束抄 』の襲色目にも紅梅の襲が見られますので、やはり紅赤系の色が有力でしょう。
淡 い『薄紅梅 』の着物に鮮やかな『梅重』の帯でアクセントをきかせるような同系色での組み合わせは、伝統的な配色で「匂 い」と呼ばれました。ちなみに、上に濃い色を配し下にいくほど色を薄くするグラデーションも「匂い」と呼びます。
紅梅",https://irocore.com/umegasane/
梅染（うめぞめ）,"['180', '138', '118']","['00', '23', '34', '29']",#B48A76,梅染（うめぞめ）とは、紅梅の樹皮や根を煎じた汁で染めたものやその色のことです。赤みのある茶色のものを赤梅染、黒ずんだ茶色のものを黒梅染といいます。室町時代から加賀で行われている無地染の染色技法で、加賀染、お国染ともよばれていました。,https://irocore.com/umezome/
梅鼠（うめねずみ）,"['173', '121', '132']","['08', '35', '15', '25']",#AD7984,"梅鼠（うめねずみ）とは、赤みのある薄い鼠色 のことです。赤い色合いの形容として『紅梅色』の「梅」の字を冠しています。ちなみに、梅の特産地「豊後（現在の大分県）」にちなみ『豊後鼠 』とも呼ばれます。
江戸時代、幕府の「奢侈禁止令 」により染色が茶系、鼠系、紺系などに制限されたなかで、市井の人々は微妙な色の違いを生み出し、それを着物にして楽しました。それがいわゆる「四十八茶百鼠 」といわれる流行色です。
『梅鼠』もその一つ。他にも『桜鼠 』『柳鼠 』など様々な色があります。",https://irocore.com/umenezumi/
梅紫（うめむらさき）,"['170', '094', '129']","['00', '60', '00', '40']",#AA5E81,梅紫（うめむらさき）とは、鈍い赤紫色のことで紅藤 をさらに紅色がからせた色合いです。ちなみに、色名の「梅」とは紅梅 の紅色を指します。この色名は江戸時代の染色書に見当たらないことから、江戸末期から明治時代に派生した比較的新しいものではないでしょうか。,https://irocore.com/umemurasaki/
裏葉柳（うらはやなぎ）,"['193', '216', '172']","['11', '00', '20', '15']",#C1D8AC,"裏葉柳（うらはやなぎ）とは、柳の葉裏のような淡い黄みを含んだ薄い緑色のことです。別名「裏柳 」とも。
柳の葉っぱの裏側の薄い緑色を表現した染めの色です。
『裏葉柳』の染色方法は江戸時代の染色技法の指南書『手鑑模様節用 』などから、「藍 」と「刈安 」による淡萌黄染 の手法によるものだと思われます。",https://irocore.com/urahayanagi/
裏葉色（うらばいろ）,"['164', '194', '169']","['30', '00', '30', '20']",#A4C2A9,"裏葉色（うらはいろ）とは、木の葉や草の葉裏のような渋くくすんだ薄緑色のことです。別に「うらばいろ」とも。『草色』を薄めた染色に付けられた色名で、平安時代にはすでにその名がみられました。また、とくに葛 の葉の葉裏に因んだ色とも言われています。
ちなみに、『裏葉色』と同様ように「裏」という字をあてた色名としては、柳の葉裏の色を表現した『裏柳 』『裏葉柳 』などがありますが、こちらのほうが少し黄みが強い色になります。
『裏葉色』は上品な色合いであるため現代でも着物の色としてよく用いられていますが、爽やかで清潔感もある色なので、乳幼児の御包 の色などにも人気です。",https://irocore.com/uraha-iro/
裏柳（うらやなぎ）,"['193', '216', '172']","['11', '00', '20', '15']",#C1D8AC,"裏柳（うらやなぎ）とは、柳の葉裏の色からきた色名で淡い黄緑色のことです。『裏葉柳 』の別名もあります。
草木の葉裏の色は、表よりも白っぽい場合が多く、とくに葛 や柳の葉裏などは古くから特徴的に用いられました。例えば浄瑠璃『芦屋道満大内鑑 』、通称「葛の葉」の中にも、女主人公の葛の葉の詠む、「恋しくば 尋ね来てみよ 和泉なる 信田の森の うらみ葛の葉」の歌の「うらみ」には「恨み」と「裏を見る」がかけてあります。
『手鑑模様節用』などから藍と刈安による淡萌黄染の手法による染め色だと思われます。",https://irocore.com/urayanagi/
江戸茶（えどちゃ）,"['205', '140', '092']","['00', '32', '55', '20']",#CD8C5C,江戸茶（えどちゃ）とは、黄みの深い赤褐色のことです。江戸時代前期の流行色でした。江戸好みの茶色という意味で使われましたが、江戸とつけることで都である京都に対して新趣向の色目であることを強調したと思われます。小袖の地色としてよく用いられました。江戸後期には「当世茶」とも呼ばれています。,https://irocore.com/edocha/
江戸紫（えどむらさき）,"['116', '083', '153']","['24', '46', '00', '40']",#745399,"江戸紫（えどむらさき）とは、江戸で染められた紫の意で、青みを帯びた紫のことです。代表的なものに歌舞伎の『助六由縁江戸桜』で助六が頭に巻いている鉢巻の色があります。本来の紫に江戸の名をつけるのは、京都の「京紅」に対してのことで、紫染は江戸が優れ紅染は京都が優れているというところからの表現であり色そのものを指しているのではありません。ちなみに、さびた赤みの京紫系の紫を『京紫 』や『古代紫 』というのに対し、江戸紫の冴えた青みの紫を『今紫』ともよばれました。
",https://irocore.com/edomurasaki/
海老色（えびいろ）,"['147', '46', '64']","['00', '80', '40', '50']",#932e40,"海老色（えびいろ）とは、伊勢海老の殻ような深く渋い赤色のことです。
「えび色」といえば平安の頃からある色名ですが、それは山葡萄 の色で染められた赤紫色の『葡萄色 』のこと。山葡萄は葡萄蔓 の古名で「えび」と呼ばれました。
しかし、近世には同じ音の「海老」を連想するようになり、「海老色」という字があてられるようになります。 そのため、色合いも海老の殻の色へと変化していきました。
ただ、伊勢海老は食べている餌によって色合いが変わることもあり、『海老色』の色合いも「濃い赤紫」から「濃い赤茶色」まで大きく幅があります。
坂内青嵐お茶の水女子大学所蔵海老の付く色名には、伊勢海老を茹でたあとの色を表す『海老赤 』や、他に『海老色』と同色の説もある『海老茶 』があります。ただし、『海老色』より『海老茶』のほうが少し茶みが強い色になっています。
坂内青嵐お茶の水女子大学所蔵
余談ですが、明治中期から後期にかけて、女学生の間で『海老茶』の袴と矢絣 のお召 を組み合わせた衣装が流行し「海老茶式部」と呼ばれていました。
江戸時代中期の学者“新井白石 ”によれば、海老の名前の由来は「海にいる伊勢海老の色が山葡萄の色に似ているから」としています。（出典：東雅）だとすると本来『海老色』は『葡萄色』と同じ色だったはず、それが現代では色合いがこのように違うというのは実に面白いものです。
伊勢海老",https://irocore.com/ebi-iro2/
葡萄色（えびいろ）,"['110', '30', '81']","['20', '80', '00', '60']",#6E1E51,"葡萄色（えびいろ）とは、山葡萄 の熟した実のような暗い赤紫色のこと。または、薄く渋い紅色のことです。『葡萄』は「えび」と読まれた山葡萄の古名で、葡萄葛 のこと。江戸中期頃から「ぶどういろ」と呼ばれるようになり、『海老色 』と区別されるようになりました。王朝文学にもたびたび登場し、古くから宮廷の人々に親しまれた色の一つ。
もともと葡萄色は色域が広く、暗い色からかなり明るい色まで含まれていました。今日では葡萄色といえば暗めの色で古代でいうところの『深葡萄 』のことですが、『延喜式』によれば明るい色であり『浅葡萄 』と同一のようです。
ちなみに、天武十四年（六八五）年に定められた『四十八階制』では、深葡萄は正位から四番目の追位の色、浅葡萄は五番目の進位の色とされています。
襲の色目としては四季に通用する「表・蘇芳、裏・縹」などがありました。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。
山葡萄",https://irocore.com/ebi-iro/
葡萄染（えびぞめ）,"['122', '065', '113']","['00', '47', '07', '52']",#7A4171,"葡萄染（えびぞめ）とは、赤みがかった少し薄い紫色のことです。葡萄葛 の熟した実のような色で、紫草の根を用いて染められました。平安時代に宮廷の女官に好まれたらしく、『枕草子』に「女の表着は薄色、葡萄染、萌黄、桜、紅梅、すべて薄色の類 」という表記がみられます。『衣服令』によると服色条九番目の色です。
襲の色目としては、「表・蘇芳、裏・縹 」を配した四季に通用する色目です。ちなみに「葡萄」の文字は江戸中期頃から「ぶどう」とよばれるようになりました。",https://irocore.com/ebizome/
海老茶（えびちゃ）,"['108', '44', '47']","['0', '59', '56', '58']",#6c2c2f,海老茶（えびちゃ）とは、伊勢海老のような色、赤みの茶色もしくは紫みの暗い赤色のことで「蝦茶」とも書きます。山葡萄の葡萄茶（えびちゃ）と両者の色が近いことと葡萄（えび）と海老（えび）と音が通じるため、近年では混同されるようになりました。明治中期から後期にかけて女学生の袴の色として好んで用いられました。,https://irocore.com/ebicha2/
葡萄茶（えびちゃ）,"['100', '1', '37']","['0', '99', '63', '64']",#640125,葡萄茶（えびちゃ）とは、やや紫を帯びた暗い赤色のことです。葡萄酒の色をさす英語の色名ワインレッド(wine-red)に近い色です。 名前の由来は山葡萄（やまぶどう）の一種ののエビカズラからですが、伊勢海老の甲羅の色に由来する海老色（蝦色）と両者の色が近いことと葡萄（えび）と海老（えび）と音が通じるため、近年では混同されるようになりました。,https://irocore.com/ebicha/
遠州茶（えんしゅうちゃ）,"['202', '130', '105']","['00', '36', '48', '21']",#CA8269,"遠州茶（えんしゅうちゃ）とは、赤みの鈍い橙色のことです。戦国時代の武将であり江戸前期の茶人小堀遠州 が好んだ色ということからこの色名が付きました。遠州は号で、名は正一 。建築・造園・茶道に多彩な才能を発揮した人です。
『手鑑模様節用』にも、「もと織物の地色にして小堀遠州候このみ給ふところを云」と記されています。",https://irocore.com/enshucha/
臙脂色（えんじいろ）,"['155', '000', '063']","['00', '95', '36', '45']",#9B003F,"臙脂色（えんじいろ）とは、黒みをおびた深く艶やかな紅色のことです。臙脂とは古代に中国より伝わった化粧紅などの顔料の名前に由来しますが、『臙脂色 』として一般的に広く使われる様になったのは、化学染料が広まった明治中期頃からです。
古代の中国では、辰砂 から作られる顔料の『朱 』にヤギの脂を加えて化粧紅を作っていたことから、「脂」の字が化粧紅を指していました。
また当時、「燕 」の国の紅が非常にすぐれていたため、燕産の化粧紅がブランド化し「燕脂 」と呼ばれました。それが後に『臙脂 』と呼ばれるようになったようです。
いまでいえば、海外で「KOBE」といえば、神戸牛を指すような感じでしょうか？
また別の説では、中国の紅花の一大産地「燕支山 」に由来するともいわれています。
我が国では奈良時代の『正倉院文書 』に『烟子 』『烟紫 』と、また平安時代の辞書『和名類聚抄 』には、『焉支』『烟支』『燕支』などと記されていますが、いずれも顔料の名前を指しており、色名ではありません。
色料の臙脂には。紅花を染料とする植物性の『正臙脂 』と、臙脂虫 （ラックカイガラ虫・紫鉱 ）やサボテンに寄生するコチニールの雌虫の赤い色素からとれた動物性の『生臙脂 』の二種類に分けられます。ともに『深紅 』のような濃い紅色ですが、『生臙脂』のほうがわずかに紫色を帯びて濃厚です。
ちなみに、臙脂虫などから採集された天然の色素は、化学染料が広まった現在でも友禅や紅型の染料として広く利用されています。またコチニールといえば食品を赤く染める天然の着色料として有名ですが、コチニールでより濃く染めた色は『洋紅色 』と呼ばれます。
臙脂色は、最近では「早稲田大学」のスクールカラーとして認知度が高い伝統色名といえるでしょう。",https://irocore.com/enji-iro/
臙脂鼠（えんじねず）,"['133', '100', '108']","['00', '35', '9', '60']",#85646C,"臙脂鼠（えんじねず）は、重厚かつ華やかな紅みがかった鼠色 のことです。
臙脂鼠は江戸期に人気があった色で、『四十八茶百鼠 』と呼ばれる流行色のひとつ。
江戸時代は『百鼠』といわれるように、たくさんの鼠色が生まれましたが、紅みの鼠色だけでも『紅鼠 』『小豆鼠 』『桜鼠 』『梅鼠 』など多数みられます。
ちなみに、色名の「臙脂 」ですが、当時は『臙脂色 』が色名として確立していなかったことから、化粧紅のブランド名『臙脂』の色を表現した鼠色ということでしょう。",https://irocore.com/enji-nezu/
鉛丹色（えんたんいろ）,"['236', '109', '081']","['00', '54', '66', '07']",#EC6D51,"鉛丹色（えんたんいろ）とは、酸化鉛のやや赤みを強くした鮮やかな橙色のことです。別名で光明丹、赤鉛とも。鉛丹は、錆止めや腐敗防止の働きもあること、さらに赤という色が崇 められていたこともあり、神社仏閣をはじめ建物などの下塗りに用いられました。また最古の顔料の一つとしても知られ、正倉院に保存されています。
丹は「赤い土」をさす色名で、酸化鉛を空気中で熱してつくりますが、他に酸化鉄、硫化水銀なども、みな「丹」とよんでいました。",https://irocore.com/entan-iro/
老竹色（おいたけいろ）,"['118', '145', '100']","['19', '00', '31', '43']",#769164,老竹色（おいたけいろ）は、年を経た意味の灰みをおびた老竹のような、ややくすんで灰色がかった緑色のことです。若々しくみずみずしい若竹色や青竹色に対して、灰みがかった色になります。伝統式名では「老」は「若」の鮮やかな調子に比べ、くすんだ鈍い色に用いられてきました。ちなみに、すすけた古色をおびた竹の色ということで煤竹色 の色名がありますが、煤竹色は茶系です。,https://irocore.com/oitake-iro/
老緑（おいみどり）,"['064', '092', '054']","['45', '00', '60', '70']",#405C36,"老緑（おいみどり）とは、老松 の葉のような灰みを帯びた深い緑色のことです。常緑針葉高木の松が年輪を重ねて年を経たものを「老松 」と呼びますが、その老松の深く渋い葉の色を象徴化した色名。また、明るい若葉の色である『若緑 』の対語にあたります。
ちなみに、「若」と「老」は主に緑系の色を形容するのに使われる修飾語であり、「若」は明るい、鮮やかさを、「老」はくすんだ、鈍い、暗いなどを形容しています。
「若」と「老」がつく日本の伝統色名には他に、『若竹色 』『老竹色 』などがみられますが、紫系の色の『若紫 』の対になる『老紫』という色はありません。",https://irocore.com/oimidori/
黄褐色（おうかっしょく）,"['199', '177', '131']","['00', '55', '100', '50']",#8C4C00,"黄褐色（おうかっしょく）とは、暗い橙色 のことです。「褐 」は粗い毛で織った衣服のことで、黒みを帯びた茶色を表します。また別に『きかっしょく』とも読まれます。
近代までは同じ字で濃い青系の『褐色 』が武家の色として一般的だったため、茶系の色を『黄褐色』や『茶褐色 』と呼び区別しました。
ただし、現代では単に『褐色 』といえば、こちらの『黄褐色』のほうが一般的になり、コーヒーの黒みの濃い茶色から日焼けした肌の色まで、茶色系の形容に幅広く使われています。",https://irocore.com/oukasshoku/
楝色（おうちいろ）,"['165', '150', '199']","['43', '43', '05', '00']",#a596c7,"楝色（おうちいろ）とは、初夏に咲く楝の花のような薄い青紫色のことです。
楝は栴檀（せんだん）の古称で古くから親しまれてきたセンダン科の落葉高木。栴壇と呼ばれるようになったのは焼くと香木のようないい香りがするからです。
平安時代には五月五日の節句の日に菖蒲や蓬（よもぎ）と共に飾られ、邪気を払うものとして用いていましたが、中世頃からは不浄の木として、斬罪の生首を懸けるのに用いられたことが『平家物語』に見られます。
襲の色目としては、四月〜五月のものを「表・紫あるいは薄色、裏・青」に配した色目で表現しています。
栴檀（センダン）",https://irocore.com/ouchi-iro/
黄土色（おうどいろ）,"['206', '155', '14']","['00', '32', '90', '25']",#CE9B0E,"黄土色（おうどいろ）とは、顔料の『黄土』の色のような赤みがかった黄色のことです。黄土はありふれた帯黄の土を精製してできた顔料。高塚古墳の壁画やアルタミラの洞窟画にも使われている色で、人類最古の顔料の一つです。また奈良時代の『正倉院文書』にも壁色として表記されています。黄土色は壁画の色のほか、絵画の下染料としても古くから愛用されてきました。
英名はイエローオーカー（yellow ocher）、仏名はオークルジョーヌ（オークルジョーヌ）。一般的に『黄褐色』『駱駝色 』も同様の色をさします。",https://irocore.com/odo-iro/
黄丹（おうに）,"['252', '089', '000']","['00', '71', '95', '00']",#FC5900,"黄丹（おうに）とは、支子 の下染めに紅花を上掛けして染め重ねられたあざやかな赤みの橙色のことです。皇太子の袍 の色で、天皇の御袍の色である『黄櫨染 』とともに『絶対禁色 』。別に「おうたん」とも読みます。
『黄丹』はもともと顔料の『鉛丹 』の別名で、染められた色が似ているところから染色名となりました。その染料は『延喜式 』縫殿寮 の雑染用度によると、「綾一疋、紅花大十斤八両、支子一斗二升、麩五斤、藁四囲、薪百八十斤」を用いることになっています。
※綾 は無地染めの綾織りの絹。一疋 は二反 分の長さで22ｍ前後。
※一斤は約600g。両は1/16斤で約37.3g。
※斗は18リットル、升は1/10斗で1.8リットル。囲 は草の束を数える単位。
『黄丹』の染色名が現れるのは大宝律令（七◯一年）の服制からで、天子の『白』に次ぐ皇太子の色として『禁色 』とされました。これは『黄丹』が曙の太陽の色を表して、やがて天位につく皇太子の地位を意味しています。
天武天皇十四年（六八六年）の服制にある『朱華 』は同じ色とされています。ただ、色合いにかなりの違いがあるため、同じ紅花と支子で染められるものですが、その配合の比率が変わったものではないでしょうか。
明治以降、禁色の規制が緩和された現代でも皇太子以外着ることが許されない『黄丹』は、2600年も続く皇室を象徴した色の１つと言えるでしょう。",https://irocore.com/oni/
鸚緑（おうりょく）,"['159', '187', '000']","['38', '00', '100', '15']",#9FBB00,"鸚緑（おうりょく）とは、オウムの緑色の羽のような、色みの強い黄緑色のことです。　オウムは漢字で「鸚鵡」と表記されますが、『鸚緑』は文字通り鸚鵡 の羽の黄緑色を表現した色となっています。ちなみに『鸚歌緑 』の別名もありますが、厳密にいえば鸚歌緑はインコ（鸚哥 ）の羽の色に因 んだ色名です。
オウム（鸚鵡）は、オウム目オウム科に属する21種の鳥の総称。自然界での生息域はオーストラレーシアに限られています。オウム目の中では中型から大型の鳥で、体長は30–60cm、体重300–1,200gに及びます。
九官鳥と同様、教えることによって人語を操るようになり、「鸚鵡返し」という言葉もありますが、じつは人語をマネするのはあまり上手いほうではありません。
オウムが日本に輸入されたのはかなり古く、最古のものは647年に新羅から献上されており、その後もたびたび輸入されてきました。江戸時代に入ってからは、将軍、大名家で飼育され、また見せ物小屋などで庶民にも見られていたようです。
奈良時代にはオウムに因んだ鸚鵡文様 という吉祥紋がありましたが、鸚緑が色名として定着したのは近代になってからです。",https://irocore.com/ouryoku/
乙女色（おとめいろ）,"['243', '166', '150']","['00', '45', '34', '0']",#F9D0C5,"乙女色（おとめいろ）とは、乙女椿 の花のような黄みをふくんだ淡い赤色のことです。
『鴇色 』の別名ともいわれますが、江戸時代に薄紅色 の色相は、一般的に「鴇色」と呼ばれていたので、乙女色もその中の一色といえるでしょう。現在で例えるなら、『水色』や『紺色 』も「青」と呼べるようなイメージです。
乙女色の名前は、乙女椿の花が由来するといわれています。
ちなみに、乙女椿とは早春に八重咲きの花をつける椿で、花言葉は「控えめな美」「控えめな愛」。その花のように色彩も色名もやわらかく優しいイメージです。",https://irocore.com/otome-iro/
御納戸色（おなんどいろ）,"['000', '112', '131']","['80', '00', '20', '50']",#007083,"御納戸色（おなんどいろ）とは、江戸時代の代表的な色で緑みの暗い青色のことです。鉄納戸 、錆納戸 、藤納戸 などのほか、多くの派生した色があり、現代でも和服の色として根強い人気があります。
色名にある「納戸」とは衣服や調度などを収めておく部屋のことですが、この色名の由来には諸説あります。江戸城内の、納戸に出入りした役人の服の色、納戸にかかっていた幕の色、納戸に貯蔵されていた藍染の色、また納戸の中のほの暗いイメージからきたという説まであります。",https://irocore.com/onando-iro/
御納戸茶（おなんどちゃ）,"['070', '093', '076']","['81', '60', '68', '22']",#465D4C,"御納戸茶（おなんどちゃ）とは、灰みの暗い青色の「御納戸色」に、茶みを加えたような暗い青緑色のことです。江戸時代の随筆集によれば、長年、納戸にしまっておいた藍海松茶 の布が、変色してしまったがとても粋な色合いだったため、これを「御納戸茶」として売りだしたところ、大流行したと記されています。

江戸時代に四十八茶として流行した茶系の色は、「番茶」「ひき茶」「煎茶」の色に由来する赤茶、黄茶、青茶の三系統に分かれますが、御納戸茶は煎茶の変相色にあたります。



",https://irocore.com/onandocha/
女郎花（おみなえし）,"['242', '242', '176']","['00', '00', '27', '05']",#F2F2B0,女郎花（おみなえし）とは、秋に咲く女郎花の花のような明るい緑みのある黄色のことです。女郎花は秋の七草の一つ。｢思い草」ともいわれて、万葉集以来、多くの歌に詠まれました。平安時代の襲の色目としては、「表が黄、または経が青で緯が黄とする麹塵（きくじん）、裏は青」で、秋に着用されています。秋草文様のひとつとして、夏の着物などにも染められました。,https://irocore.com/ominaeshi/
御召御納戸（おめしおなんど）,"['076', '100', '115']","['34', '13', '00', '55']",#4C6473,"御召御納戸（おめしおなんど）とは、灰がかった渋みのある青色のことで、本来は「御召縮緬 の御納戸」の意です。御召は「着ること」の尊敬語で、11代将軍徳川家斉が高級縮緬を愛用したことからその類を「御召」と呼ぶようになりました。また納戸は衣類や調度類を収めておく部屋のことで、暗い処の意味から付けられた江戸時代の代表的な色で緑みの暗い青色でもあります。
つまり、将軍様が御召になった縮緬 の御納戸色がこの色名の由来のようです。
ちなみに、御召を冠する染色には他に「御召茶」「御召鉄」があります。",https://irocore.com/omeshionando/
御召茶（おめしちゃ）,"['067', '103', '107']","['37', '04', '00', '58']",#43676B,"御召茶（おめしちゃ）とは、御召の着物のようなくすんだ緑みのある青色のことです。
江戸幕府の第11代将軍“徳川家斉 ”が縮緬 を好んで愛用し徳川家の着物としたことから「上様の御召物」の意で「御召 」や「御召縮緬 」と呼ぶようになりました。　そのため「御召縮緬」の先染めの色にも「御召」を冠して『御召茶』の名がついたようです。
『御召茶』の染法は江戸後期の染色指南書「染物早指南 」（一八五三）によれば、「下染薄藍 」と記されており、藍で下染めし矢車 や鉄漿 を重ねて染めていました。
また同じく江戸時代の「染物重賓記 」（一八一一）では「藍海松茶 』『御納戸茶 』とともに『花色 』で下染めする「茶」として類されており、江戸時代の「茶」とつく色が現在の『茶色』より多種多様だったことがわかります。
ちなみに、「御召」を冠する色名には他に『御召鉄 』『御召御納戸 』といったものがあり、いずれも「上様の愛用する色」ということで格式の高いものだったと思われます。",https://irocore.com/omeshicha/
織部（おりべ）,"['018', '081', '021']","['68', '00', '90', '70']",#125115,"織部（おりべ）とは、焼き物の織部焼 の色のような深みのある美しい暗緑色のことです。色名はその名のとおり織部焼から。
織部焼は“千利休 ”の高弟“古田織部 ”が故郷の美濃国（現在の岐阜県土岐市）の窯元で、萌え出でる若葉や自然を象徴する『緑青色』を器に再現しようと緑色の釉薬 『緑釉 』を用いて作らせた焼き物です。
古田織部は武将であり茶人。江戸幕府二代目将軍の“徳川秀忠”や芸術家の“本阿弥光悦”などを弟子に持つ桃山時代随一の文化人です。織部が好んだ大胆かつ自由な気風は、その時代に大流行し「織部好み」と呼ばれました。
千利休により完成された侘茶 を独自の感性で発展させ、その真髄を取り入れた織部焼。
そんな織部焼の色に由来する『織部』もまた味わい深い色です。",https://irocore.com/oribe/
柿色（かきいろ）,"['222', '106', '028']","['00', '68', '90', '10']",#DE6A1C,"柿色（かきいろ）とは、柿の果実のような鮮やかで濃い橙色のことです。柿色は古くからある色名ですが、一口に「柿色」と呼んでも4種類の色みがあり、柿の実の色に因 んだ色の系統と柿渋 で染めた色の二系統に分かれます。
柿の実の色の系統の柿色としては、色見本の一般的な『柿色』。そして、熟した柿の実を思わせる赤みの濃い『照柿色 』。この照柿色も略して「柿色」と呼ばれます。
一方、柿渋で染めらた色の系統としては、その名も『柿渋色 』という色名があり、こちらも略して「柿色」と呼ばれました。さらに歌舞伎用語では“成田屋”の茶色、通称『団十郎茶 』も柿渋と紅柄 で染めたことから「柿色」と呼ばれています。
このように４種類の通称「柿色」がありますが、江戸時代以前は「柿色」といえば柿渋の柿色だけを指しており、柿の実にちなんだ冴えた赤味の橙色が、いつ頃から「柿色」と呼ばれるようになったのかはハッキリしていません。
柿は、カキノキ科の1種の落葉樹。弥生時代以降に桃や梅、杏子などとともに大陸から伝来したもので、沖縄県を除く日本の全都道府県に分布しています。
古くから熟した果実は食用に、柿渋は防腐剤に、幹は家具材に、葉は茶の代わりとして飲まれており、我々日本人にとってはとても馴染み深い植物であるといえます。
ちなみに、中世の山伏たちが柿色の衣装で修行をしていたのは、柿渋に防水効果があるため、山野を巡る際に衣服が濡れないように染めていたのでしょう。",https://irocore.com/kaki-iro-2/
柿渋色（かきしぶいろ）,"['189', '120', '098']","['35', '65', '65', '00']",#BD7862,柿渋色（かきしぶいろ）とは、灰がかった黄赤色で、色づく前のカキの実をしぼって作られます。歌舞伎役者の一門、市川家がよく用いていた色であるところから、俗に｢団十郎茶｣とも呼ばれます。江戸時代では、｢柿色｣と呼ばれますが、これは「柿渋色」を略したもので、柿の実の色にちなんだ「柿色」とは異なります。,https://irocore.com/kakishibu-iro/
杜若（かきつばた）,"['094', '056', '098']","['74', '88', '45', '09']",#5E3862,"杜若（かきつばた）とは、菖蒲色よりも赤みの強い紫色のことです。杜若はアヤメ科の多年草で、名前は美しく咲いた花びらを摘みとって布にこすりつけて染めたことから、掻付花 に由来するといわれています。
江戸中期の旗本であり有職故実研究家の伊勢貞丈 の著書『安齋随筆』に「今江戸紫と云ふ色はカキツバタの花の色の如し是葡萄染なり、紫蘇の色に赤きに青色を帯びたり」とあるように、江戸時代には「江戸紫」の名で親しまれていました。
襲の色目としては「表・二藍、裏・萌葱」、「表・萌葱、裏・淡紅梅」などがあります。",https://irocore.com/kakitsubata/
褐色（かちいろ）,"['000', '056', '071']","['100', '80', '65', '35']",#003847,"褐色（かちいろ）とは、紺よりもさらに濃い、黒色に見えるほどの藍色のことです。「かちん色」とも読まれます。
現代では「褐色」と書くと「かっしょく」と音読みし、茶系統の『赤褐色 』や『黄褐色 』を指しますが、中世や近世の日本では濃い藍色のことでした。
色名の「かち」は、藍を濃く染み込ませるために布などを搗 つ事からきており、『搗色』『褐色』『勝色』が当てられました。また、武家の間で「かち＝勝ち」の読み方が好まれたため、「褐色威 」や「褐色の直垂 」などの表記が軍記物語などによくみられます。
※搗つ：臼 でつく。",https://irocore.com/kachiiro-2/
勝色（かついろ）,"['24', '27', '56']","['60', '45', '00', '85']",#181B39,"勝色（かついろ）とは、紺よりもさらに濃い、黒色に見えるほどの暗い藍色のことです。『かちいろ』『かちんいろ』とも。色名の「かつ」は、藍を濃く染み込ませるために布などを搗 つ（叩くの意）ことからきており、『搗色』『褐色』の字があてられました。
鎌倉時代になると武士たちが濃い藍染の質実剛健さを好み、さらに「かつ」に「勝」の字をあてて縁起色としたのが色名の由来です。
ちなみに、日清・日露戦争時の軍服の紺色も『勝色』と呼ばれ、特別に『軍勝色 』とされました。
このように勝色は勝利にこだわる武士や軍人に好まれた勇ましい色名といえます。",https://irocore.com/kachiiro/
金糸雀色（かなりあいろ）,"['236', '224', '052']","['19', '16', '83', '0']",#ECE038,"金糸雀色（かなりあいろ）とは、野生のカナリアの羽色のような少しくすみのある黄色のことです。カナリアは漢字で「金糸雀」と表記し『金糸雀色』は文字どおり、カナリアの羽を表現した色になります。また、別に「きんしじゃくいろ」とも読まれます。
なお、カタカナで『カナリア色』といえばサッカーのブラジル代表のユニフォームの色として有名ですが、『金糸雀色』より『カナリア色』のほうがあざやかな黄色を指します。
これは日本に伝わった頃のカナリアが、現在のように品種改良が進んでいなかったため、野生のカナリアに近い少しくすんだ黄色をしていたからでしょう。
カナリアはスズメ目アトリ科の小鳥で、愛玩鳥フィンチの一種。名前は「カナリア諸島」に由来します。
日本へは江戸時代の天明期（一七八一〜八九）に持ち込まれ、「金糸雀」と呼ばれました。カナリアは姿形やさえずりの美しさから、ペットとしてたちまち人気となり、とくに武士や貴族、知識層に愛玩されたようです。その人気ぶりを表すように“葛飾北斎 ”の日本画にもその姿が見られます。
カナリアが日本に伝わったのが江戸中期〜末期ですから、『金糸雀色』の色名ができたのは明治以降の近代になってからだと思われます。
ちなみに、日本では古くから鳥を飼う習慣があることから、色名にも鳥の羽に由来したものが数多くみられます。古くは『鶸色 』や『鴇色 』、『鴨の羽色 』、『濡羽色 』など。近代でも『鶯色 』『鸚鵡 』や『孔雀緑 』など、色相もさまざまです。",https://irocore.com/kanaria-iro/
樺色（かばいろ）,"['197', '089', '026']","['30', '80', '95', '00']",#C5591A,樺色（かばいろ）とは、赤みのある橙色で蒲色とも書きます。樺の樹皮または水草の蒲の穂の色を喚起させる色です。｢樺茶｣と同色視されることが多いですが、実は色調が異なります。,https://irocore.com/kaba-iro/
樺茶（かばちゃ）,"['114', '098', '080']","['00', '14', '30', '55']",#726250,樺茶（かばちゃ）とは、樺色（かばいろ）を帯びた茶色のことです。樺色も茶みを帯びた色のため、一般的に樺色と樺茶は同色視されていますが、染め色としては区別されています。江戸時代前期から使われる色名です。,https://irocore.com/kabacha/
甕覗（かめのぞき）,"['197', '228', '237']","['25', '00', '06', '03']",#C5E4Ed,"甕覗（かめのぞき）とは、藍染の淡い青色を指す色名でやわらかい緑みの青のことです。別名は『覗色 』。
藍染は布や糸を何度も藍甕 に浸けては取り出し、浸けては取り出すことを繰り返して濃く染めていくのですが、甕覗は白い布を少し浸した程度に染めただけ、あるいは甕 をちょっと覗いただけという意味で付けられた色名です。ただし、あくまでも比喩的な表現であり、実際にそういう染め方をするわけではありません。
また別に、甕 に張られた水に映った空の色を人が覗き見た色などという説もあり、なかなか遊び心のある色名です。
藍染は浸す回数によって色の濃さが変わるので、淡い順に『藍白 』『白殺し 』『浅葱』『縹』『藍色』『紺』など微妙な色ごとにそれぞれ色名が付けられています。その色の差は職人の腕や環境などによっても違っており、濃い色は浸けては取り出す作業を何度も繰り返す必要があり、とても高額でした。",https://irocore.com/kamenozoki/
鴨の羽色（かものはいろ）,"['105', '91', '0']","['89', '50', '70', '09']",#00695B,"鴨の羽色（かものはいろ）とは、真鴨 の頭の羽色に由来する少し暗い青緑色のことです。別に『鴨羽色』『真鴨色 』とも。色名の出典は古く「万葉集」にその名がみられます。
真鴨
真鴨（マガモ）はカモ目カモ科に分類される鳥類の一種で、アヒルの原種。冬に飛来する渡り鳥でもあります。日本では古代より食用として狩猟されてきました。ちなみに、真鴨の中でも頭が青緑色なのはオスだけです。
この『鴨の羽色』は「青葉」や「春山」にかかかる枕詞 にもなっています。
真鴨",https://irocore.com/kamonoha-iro/
茅色（かやいろ）,"['199', '177', '131']","['00', '15', '40', '30']",#C7B183,"茅色（かやいろ）とは、葺 き替えたばかりの茅葺 き屋根のようなわずかに赤みを帯びたくすんだ黄色のことです。別に『萱色 』の字もあてられ、その名のとおり枯 れた茅に由来する色です。
茅はススキの別名で、チガヤなどの総称。茅葺屋根につかわれるなど古くから日本人に親しまれた植物で、縄文時代には茅を用いた屋根だけの住居が作られていたようです。
枯れた茅の自然で穏やかな色合いは、秋の情緒を感じさせることから大変好まれ、『万葉集』などに多くの歌が詠まれました。
茅色の他にも枯れた植物に由来する『枯色 』や『枯野 』といった色がありますが、一見、華やかさもないこういった地味な色に美を見出す、日本人の精神性を象徴した色といえるかもしれません。

茅葺の屋根
茅葺の屋根",https://irocore.com/kaya-iro/
韓紅（からくれない）,"['244', '0', '25']","['3', '100', '80', '0']",#EA0032,"韓紅（からくれない）とは、紅花で染めた濃い紅赤色のことです。奈良時代には『紅の八塩 』と呼ばれていた色で、別に『唐紅 』とも表記しました。『深紅 』は同色。『紅 』とは「呉の国からやってきた染料」という意味の『呉藍 』が色目に転化したもの。八塩 とは八回染め重ねるの意。紅花 による濃染 のことをいいます。
平安時代には濃い紅花の赤色が、舶来の赤の意味と美しさを強調するために『唐紅、韓紅』となったといいます。ちなみにここでの「韓」の字は朝鮮半島の三韓ではなく、紅花の産地であった中国を意味しています。
当時の紅花は黄金に例えられるほど高価だったことから、濃い紅色は『禁色 』とされていました。とは言え、いつの時代も人は美しい色に惹かれるもの、濃く鮮やかに染められた『韓紅』の色は貴族たちにとって憧れだったようです。",https://irocore.com/karakurenai/
唐紅（からくれない）,"['244', '0', '25']","['3', '100', '80', '0']",#EA0032,"唐紅（からくれない）とは、紅花で染めた濃い紅赤色のことです。
『韓紅 』の別表記。『深紅 』は同色。
※ 詳しい色の説明は、『韓紅』のページをご確認ください。

",https://irocore.com/karakurenai-2/
乾鮭色（からさけいろ）,"['235', '151', '147']","['00', '50', '30', '5']",#EB9793,"乾鮭色（からさけいろ）とは、乾燥させた鮭の身のような橙色がかった桃色のことです。
英名は『サーモンピンク』。その名のとおり乾燥させた鮭の身の部分に因んだ色です。『鮭色 』という名の色もありますが、こちらは生の鮭の身の色で、『乾鮭色』よりも薄い色を指します。
明治以降に『サーモンピンク』の色が西洋から伝わった際に、和訳して作られた色名だと思われますが、現在でも『サーモンピンク』のほうが一般的です。
ちなみに、『乾鮭色』のような橙色がかった桃色系の色としては『鴇色 』や『珊瑚色 』などがあります。
鮭は、サケ目サケ科サケ属の魚。日本では北海道・東北地方の川が主ですが、本州中部から西部の日本海側や関東地方の川にも遡上し産卵します。我が国において鮭は古代より重要な食用魚であり、塩引きや干物にした物は朝廷や幕府への献上物となるなど租税の代わりでした。
鮭は歴史上の人物も大好きで鎌倉幕府の“源頼朝”が鮭の美味しさに感動した話や、出羽地方の戦国大名“最上義光”の大好物であったなどたくさんの逸話が伝わっています。
数ある日本の伝統色の中でも、魚に因んだ色名があるのは『鮭』くらいなものです。
鮭とば",https://irocore.com/karsake-iro/
芥子色（からしいろ）,"['208', '175', '076']","['00', '16', '63', '18']",#D0AF4C,芥子色（からしいろ）とは、芥子菜の種子を粉にして練った香辛料「カラシ」のようなやや鈍い黄色のことです。芥子菜はアブラナ科の多年草で、春に小さな黄色い花が咲き小さな種子ができます。その種子を粉末にした香辛料が「和辛子」。ちなみに西洋のマスタードは白辛子や黒辛子の種から作られています。,https://irocore.com/karashi-iro/
唐茶（からちゃ）,"['160', '103', '005']","['50', '70', '100', '00']",#A06705,唐茶（からちゃ）とは、黄みがかった茶色のことです。「唐」はもともと中国伝来の事物に添えられた語ですが、転じて新来の物に添える語となり、さらに新しい、美しいことへの修飾語として使われるようになりました。色名は後者の意味です。ちなみに唐茶 と読むと中国渡来のお茶、又は僧侶仲間の隠語でお酒を意味します。,https://irocore.com/karacha/
刈安（かりやす）,"['255', '222', '000']","['00', '15', '95', '00']",#FFED00,刈安（かりやす）とは、緑みの鮮あざやかな黄色で、山野に自生するイネ科ススキ属の植物「刈安」で染めたものです。一般に言われている刈安は「近江刈安」のことを指しています。古代、ススキの類は黄色染に用いられましたが、中でも刈安は、名前のように刈りやすく入手しやすかったため多用されました。刈安の黄染料は赤みを含まないため、緑色に染める時用いると、藍との交染で鮮やかな緑色を出すことができます。,https://irocore.com/kariyasu/
枯野（かれの）,"['218', '194', '144']","['00', '15', '40', '20']",#DAC290,"枯野（かれの）とは、冬枯れした芒 の原のような薄い黄褐色のことです。
『枯野』は重 ねの色に由来する古くからの色名で、『枯色 』とは同色とする説もあります。ただし、平安文学の「狭衣物語 」にもその名が見られるように『枯野』のほうが古い色名であり、『枯色』はあとから派生したものでしょう。
重 ねの色では「表黄・裏淡青」の色目で、冬枯れした草木とわずかに残る緑を表しました。
また、他に「表黄・裏白」の色目もあり、こちらでは枯草に積もった雪や霜を表しています。
ちなみに、『枯野』の着用時期は冬。

草が枯れた荒野の風景は華やかさなど微塵もない物悲しいものですが、古来より我々日本人の琴線にふれるものがあるようです。 だからこそ、色名になったり、歌や俳句に詠まれたりしたのでしょう。
そう考えると『枯野』の色は、日本人の心の中にある寂寥感 が漂う心象風景の一つを表現した色といえるかもしれません。
枯野
枯野
",https://irocore.com/kareno/
土器色（かわらけいろ）,"['195', '120', '084']","['00', '38', '57', '24']",#C37854,土器色（かわらけいろ）とは、土器のようにくすんだ黄褐色のことです。浅い赤黄色がかった茶色に用いられ、「土器茶」「枇杷茶」ともよばれます。土器色という色名は中世の頃から用いられるようになりましたが、土器の色だけでなく着物の色にも用いられました。,https://irocore.com/kawarake-iro/
萱草色（かんぞういろ）,"['253', '169', '000']","['00', '45', '96', '00']",#FDA900,萱草色（かんぞういろ）とは、明るい黄みがかった橙色のことです。萱草の花の色からついたもので、『源氏物語』に「萱草の袴」などとあるように古来から親しまれてきた色名です。古くは「くわぞう色」ともいわれました。萱草の別名は忘れ草といい、別離の悲しみを忘れさせる花として喪の色とされました。,https://irocore.com/kanzo-iro/
黄浅緑（きあさみどり）,"['140', '177', '085']","['53', '19', '79', '00']",#8CB155,"黄浅緑（きあさみどり）とは、鮮やかな黄緑色のことです。「きのあさみどり」とも読まれる古くからある色名で、『浅緑』の派生色。平安時代の格式『延喜式 』によれば「黄蘗 八両に藍小半囲を染め重ねる」との記述があり、黄みの強い黄緑を指しています。
延喜式に『青浅緑』も同量の染材で染めるとの記述があることから黄浅緑と同じ色とする説もありますが、同じ染材を用いても媒染剤や染める順番など他の要素で色合いが変わることはよくありますので、黄みが強いものが黄浅緑、青みが強いものが青浅緑とするのが自然でしょう。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/kiasamidori/
黄色（きいろ）,"['255', '217', '000']","['00', '15', '100', '00']",#FFD900,黄色（きいろ、おうしょく）とは、基本色名の一つであり、色の三原色の一つ、あるいは黄色系統の総称としても用いられます。現代では卵の黄身、レモンの皮、ヒマワリの花のような色をさします。人類最古の黄色い顔料は黄土とされ、日本では稲科の刈安などが黄色の染料として古くから用いられました。日本の伝統色名では刈安色、黄檗色などが代表的です。,https://irocore.com/ki-iro/
黄枯茶（きがらちゃ）,"['118', '092', '071']","['00', '22', '40', '54']",#765C47,"黄枯茶（きがらちゃ）とは、褐色味の濃い黄褐色のことです。「黄唐茶」「木枯茶」とも書き「こがれちゃ」とも読まれました。
『手鑑模様節用』には「黄枯茶、古名黄櫨染、又木欄色に同じ、櫨紅葉の色か」と記されています。
染色法としては、楊梅 で下染めをして上に梅をかけており、表面に赤みを少し覗かせている色です。江戸前期から中期に流行し、遊里、町方を問わず好まれました。",https://irocore.com/kigaracha-2/
黄唐茶（きがらちゃ）,"['185', '140', '070']","['00', '24', '62', '27']",#B98C46,黄唐茶（きがらちゃ）とは、薄い藍色を帯びた薄茶色のことです。別名、黄雀茶ともいい、古代の「櫨染」や「木欄」の系統色に当たります。江戸時代前期に流行した染め色で、『色道大鏡』や『好色一代女』、『日本永代蔵』などにも記述がみられます。,https://irocore.com/kigaracha/
桔梗色（ききょういろ）,"['98', '68', '152']","['72', '80', '00', '00']",#624498,"桔梗色（ききょういろ）とは、桔梗の花のような青みを帯びた紫色のことです。平安時代から愛されていた色名で、青紫の代表的な伝統色。『宇津保物語 』や『栄花物語 』などの王朝文学にも名前が見られる秋を代表する色です。
桔梗はキキョウ科の多年性草本植物。秋の七草の一つで、夏から秋にかけて青紫で星型の優美な花を咲かせます。古くは「きちかう」と呼ばれ、万葉の頃より愛されてきました。なお、桔梗のことを『万葉集』では「あさがお」と呼ばれていますが、現在の朝顔とは別種になります。
桔梗色は平安時代は織色や重 ねの色目のみであり、染め色として使われるようになったのは江戸時代から。また実際の花の色より冴えた青紫で、『菫色 』よりも青味を帯びた伝統色として受け継がれてきました。派生色には『紺桔梗 』『紅桔梗 』『桔梗納戸』『桔梗紫 』などの色名が残されています。
重 ねの色目としては、「表・二藍 、裏・濃青」などがあり、秋に用いられていました。

桔梗
桔梗",https://irocore.com/kikyo-iro/
麹塵（きくじん）,"['110', '121', '085']","['65', '49', '74', '04']",#6E7955,"麹塵（きくじん）とは、麹黴 のようなくすんだ黄緑色のことです。宮中の年中行事の作法書『西宮記 』に「青白橡 」と同じ色と記されています。
麹塵は天皇の通常の袍 の色で、「麹塵の袍」または青色と呼ばれ臨時祭、舞楽、庭座、弓馬初などのときに着用されました。
『延喜式』に拠れば刈安と紫根で染められ、その染料配色比を１６：１と詳しい指示がなされています。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/kikujin/
黄支子（きくちなし）,"['255', '219', '079']","['00', '14', '69', '00']",#FFDB4F,黄支子（きくちなし）とは、クチナシで染めた赤みがかった濃い黄色のことです。梔子色（くちなしいろ）と同一視されていますが、厳密には違っており、クチナシのみで染めた色を黄支子、クチナシで染めた黄色にベニバナの赤をわずかに重ね染めした色に梔子色が用いられています。,https://irocore.com/kikuchinashi/
黄朽葉（きくちば）,"['211', '162', '67']","['00', '23', '68', '17']",#d3a243,"黄朽葉（きくちば）とは、晩秋の黄ばんだ枯れ葉の色を表したような黄褐色のことです。『赤朽葉 』、『青朽葉 』と共に『朽葉色 』の変相色のひとつ。『淡朽葉 』は同色。
黄朽葉は古い色名で、平安文学の『宇津保物語 』に「きくちばのからぎぬひとかさね」、『枕草子 』には「黄朽葉の織物、薄物などの小袿 着て」とその名がみられます。
明治時代の風俗史書『歴世服飾考 』によれば、「支子 に茜  若 しくは紅 を交て欵冬  或 いは黄朽葉を染めたるなり」とあり、赤と黄の交染であることがわかります。
また、織物の黄朽葉は、縦糸に黄を、横糸に淡紅を配して織ったものでした。
ちなみに、重 ねの色としては、「表・朽葉、裏・朽葉」を配し、秋末・初冬の服色となっています。
紅を混ぜた濃い支子 の色は、『禁色 』の『黄丹 』と紛らわしくなるため、平安時代に紅を混ぜた染色は禁制となりました。
それでも支子染の鮮やかな色合は人気があったため、『黄朽葉』のような別名をつけられ着用されていたようです。",https://irocore.com/kikuchiba/
紀州茶（きしゅうちゃ）,"['130', '102', '058']","['55', '61', '86', '11']",#82663A,"紀州茶（きしゅうちゃ）とは、黄みの暗い茶色のことです。『銀煤竹 』の別名。
江戸中期の亨保年間に小袖 の色として流行した色です。
元は『銀煤竹』と呼ばれていた色ですが、徳川御三家の“紀州侯”が愛好したことから、『紀州茶』の別名がつきました。
ちなみに『銀煤竹』は、茶道の千家三代目“千宗旦 ”も好んだ色と伝わっており、宗旦の息子が紀州徳川家に茶頭 として仕えたことから、歴代の藩主にも影響を与えたのではないでしょうか。
なお、色名の由来になった“紀州侯”についてですが、年代的に将軍になる前の紀州藩主・“徳川吉宗”を指すものと思われます。
実際、吉宗には「延喜式」にみられる古代の染色法を研究するような趣味もありました。
そう考えると、『紀州茶』の色合いは、質素倹約を旨とする吉宗がいかにも好みそうではありませんか？
",https://irocore.com/kishucha/
狐色（きつねいろ）,"['217', '151', '047']","['20', '50', '90', '00']",#D9972F,"狐色（きつねいろ）とは、キツネの背の毛色に似た色合いのやや赤みを帯びた黄褐色のことです。ヨーロッパに比べて動物の色名が少ない日本で江戸時代に使われているほど、狐は親しまれていた動物でした。
揚げ物や焼き物などの食べ物が美味しそうに焼けてきた時の色のたとえとして、「表面がこんがりきつね色になってきた」などと用いられます。

北海道の狐
北海道の狐",https://irocore.com/kitsune-iro/
黄橡（きつるばみ）,"['162', '112', '051']","['20', '40', '70', '20']",#A27033,黄橡（きつるばみ）とは、赤みのふかい黄褐色で黄金色に近い色のことです。「橡」とはブナ科クヌギの古名で、その実のドングリを煎じた汁を古来から染色に用いてきました。媒染によって色が異なり、灰汁を用いて染めた色が黄橡とされます。赤白橡、青白橡も「橡」という言葉を用いますが、こちらは橡を使って染めた色ではありません。,https://irocore.com/kitsurubami/
生成色（きなりいろ）,"['247', '239', '227']","['00', '05', '10', '05']",#F7EFE3,"生成色（きなりいろ）とは、晒 す前の木綿のようなわずかに赤みがかった黄みの白色のことです。「ナチュラルカラー」が流行した昭和になって生まれた色で、染めたり晒したりしていない生地を指していた「生成 り」が色名として一般化しました。
※晒 す＝漂白
高度経済成長末期の日本では、それまでの急速な工業化のツケともいうべき公害問題などが深刻化してきました。そのため生活者はしだいに反工業の意識が高まり、自然志向が強くなっていきます。こうした流れから、色彩志向も自然の色である「ナチュラルカラー」や「アースカラー」が流行しました。
『生成色』は、そんな70年代当時の日本の色彩を象徴する色の一つです。
ちなみに、生成色を本来の伝統色でいえば、鶏の卵殻の色である『鳥の子色』や、卯 の花 の色のような『卯の花色』が近い色と言えそうです。",https://irocore.com/kinari-iro/
黄蘗（きはだ）,"['254', '242', '99']","['03', '00', '70', '00']",#FEF263,黄蘗（きはだ）とは、ミカン科のキハダの黄色い樹皮の煎汁で染めた明るい黄色のことで、奈良時代にもその名が見られる古い色名です。刈安（かりやす）に近い色合ですが、より緑みを含んだものをいいます。「蘗」とは肌、皮の意味。黄蘗の樹皮は「おうばく」ともいい、古くから染料として知られたほか、健胃剤や傷薬などの漢方薬としても用いられました。また黄蘗で染めた紙を黄蘗紙とよび、経文や公文書用にも多く使われ現在も保存されています。ただし、布に単独で染められることは珍しく、緑系や赤系の染物の下染めにされることが多かったようです。,https://irocore.com/kihada/
黄海松茶（きみるちゃ）,"['145', '135', '084']","['00', '07', '42', '43']",#918754,"黄海松茶（きみるちゃ）とは、江戸時代に好まれた海松茶よりも黄みの強い黄灰色のことです。現代でいえばオリーブ色に近い色合いになります。『手鑑模様節用 』の色譜にもみられ、その染法は『萬染物張物相伝 』や江戸後期の染色書にも紹介されています。

ちなみに、オリーブ系の茶色を「海松茶」、本来の海松色に近い色を「素海松茶」といいました。",https://irocore.com/kimirucha/
伽羅色（きゃらいろ）,"['216', '163', '115']","['00', '25', '47', '15']",#D8A373,伽羅色（きゃらいろ）とは、茶色がかった暗い黄褐色のことです。伽羅茶とも呼ばれます。伽羅は沈香木（じんこうぼく）の一種で、ベトナムやタイなど東南アジアが原産地です。昔から伽羅は沈香木の中でも特別で、香道では最高の名香として珍重されてきました。ちなみに伽羅とは梵語で黒を意味するキヤラから漢訳された言葉です。その伽羅にちなんだ黄褐色がこの色です。,https://irocore.com/kyara-iro/
京藤（きょうふじ）,"['192', '143', '179']","['17', '45', '00', '15']",#C08FB3,"京藤（きょうふじ）とは、紅がかった濃い藤色で、明るく渋い紅紫色のことです。古来より女性に人気の『藤色』の派生色ですが、染色法は紅みを強くするため下色の蘇芳を濃いめに染めています。同じ藤色の派生色である『紅藤 』よりも少し色みが濃く、江戸時代の後期に人気があった色です。『染物屋覚書』には「京藤は濃蘇芳一度引。水へかねをくわへ引べし。・・・」との記述が見られます。
藤色は『源氏物語』などにもその名が見られるように平安時代から女性に人気があった色で、染色技術が発達した江戸時代には『青藤』『白藤』『薄藤』などの数多くの派生色が生まれました。
少し紅みのつよい京藤は女性らしい優雅さを表しています。",https://irocore.com/kyoufuji/
京紫（きょうむらさき）,"['119', '047', '109']","['40', '80', '00', '40']",#772F6D,"京紫（きょうむらさき）とは、京都で染めた紫の意で、赤みがかった紫色のことです。古 から伝わる正統的な紫根染 めの紫色であり、『江戸紫 』に対して付けられた色名。
また、京紫が伝統的な紫を受け継ぐ色ということで『古代紫 』と呼ばれ、江戸紫が江戸時代、当時の今風の色なので『今紫 』とも呼ばれました。
ちなみに、同じ色とされている京紫と古代紫ですが、実際は京紫のほうが古代紫よりも鮮やかで明るい色になります。
古くからの都である京では「雅 」なものが好まれ、新興都市の江戸では「活気」があるものが好まれました。そういった両都市の性質が紫色の色みにも現れており、江戸紫は青みの紫色で「力強い活気」をあらわすのに対し、京紫は紅みの強い紫色で「優雅さ」をあらわしています。
ただ、江戸時代の有職故実 研究家の“伊勢貞丈 ”によれば、「今世京紫といふ色は紫の正色なり。今江戸紫といふは杜若 の花の色の如し。是葡萄染 なり。」と自身の随筆『安斎随筆』に書き記しており、それをもって『京紫』を青みの紫とするという説もあります。
※有職故実は、朝廷や公家、武家の行事や法令・制度・風俗・習慣・官職・儀式・装束などの先例、典故。また、それらを研究する学問。",https://irocore.com/kyoumurasaki/
金茶（きんちゃ）,"['206', '122', '025']","['25', '65', '95', '00']",#CE7A19,金茶（きんちゃ）とは、金色がかった明るい茶色のことで、山吹色に近い色です。元禄9年に書かれた『当世染物鑑』に登場し、元禄期には既によく染められていたことがわかります。和服、和装小物、風呂敷、作務衣さむえなどに用いられるほか、洋服にも合う色で、明治30～40年代にかけて令嬢の帯揚げなどの色として流行しました。,https://irocore.com/kincha/
銀色（ぎんいろ）,"['192', '192', '192']","['25', '25', '25', '00']",#C0C0C0,銀色（ぎんいろ）とは、白金とも呼ばれる、美しい金属光沢のある灰色のことです。銀は古来から愛されてきた金についで貴重な金属であり、それぞれ太陽と月に例えられ、古来より並び称されてきました。また色としても古くから用いられており、『万葉集』でも山上憶良が「銀も金も玉も何せむに勝れる宝子に及かめやも」と詠んでいます。ちなみに、銀は白金（しろかね）とも呼ばれ、純粋無垢の意味をもっています。,https://irocore.com/gin-iro/
銀朱（ぎんしゅ）,"['226', '066', '021']","['06', '86', '95', '05']",#E24215,"銀朱（ぎんしゅ）とは、黄みの強い赤色のことです。天然の赤色顔料である『真朱 』に比べ、やや黄みがかった鮮やかな赤色をしています。
真朱が「朱丹 」という天然の鉱物から作られるのに対し、『銀朱』は朱丹に水銀と硫黄を混ぜあわせた物を焼いて造った人造の赤色顔料です。ちなみに、朱丹の最上の物は『辰砂 』と呼ばれますが、非常に貴重で大変高価なものでした。
銀朱の色名は「続日本紀」に記載があり、弥生から古墳時代にかけては、死者の葬祭には墳墓の内壁に朱を塗る施朱や、死者の鎮魂と再生を願って遺骨に朱を塗ることが行われていました。血の色を表すことから生命の再生を祈ったものですが、水銀が含まれており防腐作用があるためでもあります。
現在では『朱色』といえば、『銀朱』、洋名の『バーミリオン』を指し、『紅 』や『緋 』より更に黄みがかった赤のことをいいます。朱肉の色も多くはこの『銀朱』の色です。",https://irocore.com/ginshu/
銀煤竹（ぎんすすたけ）,"['130', '102', '058']","['54', '58', '76', '10']",#82663A,銀煤竹（ぎんすすたけ）とは、竹のすすけたような赤黒い色に銀色を加味したような色のことです。色名の銀は白みがかる意味に、金は黄みがかる意味に使われます。煤竹色は江戸前期からみられますが、銀煤竹は紀州候愛好の色だったことから、紀州茶ともいわれました。,https://irocore.com/ginsusutake/
銀鼠（ぎんねずみ）,"['187', '188', '191']","['03', '02', '00', '35']",#BBBCBF,"銀鼠（ぎんねず）とは、銀色のようなほんのり青みを含んだ明るい灰色のことです。古くは『錫色 』とも。江戸中期は度々「奢侈禁止令 」が発布され、派手な色の着物が禁止されていました。そのため元々は地味な色と考えられていた茶系・鼠系の着物ですが、僅かな色の違いを粋に着こなすことが大流行し、様々な種類の茶色や鼠色が生まれました。いわゆる『四十八茶百鼠 』のことです。銀鼠もそんな流行色の一つでした。
銀鼠は水墨画でいうところの「墨の五彩 」の「淡」にあたります。ちなみに、五彩とは単純に五色の色合いのみ表す言葉ではなく、墨の濃淡により無限の色を表現できるという意味です。
銀は古くから「しろがね」と呼ばれるように、銀鼠も白系統の色に入ります。",https://irocore.com/ginnezumi/
草色（くさいろ）,"['123', '141', '66']","['61', '39', '89', '00']",#7B8D42,"草色（くさいろ）とは、若草が色濃くなったようなくすみのある濃い黄緑色のことです。みずみずしい『若草色』が濃くなると草色になりました。古くからある色名であり、緑色を代表する色。『そうしょく』とも読まれます。別名に『草場色 』とも。
ちなみに、『色草 』と書くと、庭、路傍、山野などにしげる雑草や草花、紅葉などを指す「秋の季語」となります。",https://irocore.com/kusa-iro/
孔雀青（くじゃくあお）,"['069', '070', '155']","['100', '00', '25', '25']",#0086A2,"孔雀青（くじゃくあお）とは、孔雀の青い羽の色のような冴えた青色のことです。孔雀の羽や首の部分に見られる美しい青に由来しており、ほんのり緑みを帯びています。比較的新しい色名で、明治の頃に西洋から伝わった『ピーコックブルー』を和訳したもの。
また孔雀の緑の羽根に由来した『孔雀緑 』という色もありますが、こちらも同時期に伝わった『ピーコックグリーン』を和訳してできた色名です。
孔雀は中国から東南アジア、南アジアに分布するキジ科の鳥類で、オスは大きく鮮やかな飾り羽を持ち、それを扇状に開いてメスを誘う姿が有名ですが、美しいのオスだけです。
羽毛が装飾品として珍重された他、害虫・毒蛇類を好んで食べることから益鳥として尊ばれました。また仏教においては孔雀明王として信仰の対象となっています。
ちなみに孔雀の我が国への伝来はとても古く、『日本書紀』に新羅 が“推古天皇 ”に孔雀を送ったという記述が見られます。
江戸の頃になると庶民への認知度も高くなり、大阪では孔雀を見ながら茶が飲める茶店『孔雀茶屋 』が大人気でした。また日本画の題材としても数多くみられます。
日本画の題材として好まれながら、明治期のピーコックブルーの登場まで孔雀の名を冠する色名が発生しなかったのは少し不思議な感じがします。",https://irocore.com/kujakuao/
孔雀緑（くじゃくみどり）,"['000', '142', '116']","['100', '00', '63', '15']",#008E74,"孔雀緑（くじゃくみどり）とは、孔雀の美しい青緑の羽のような鮮やかな青緑色のことです。孔雀の羽に見られる青みがかった鮮やかな緑に由来しています。『くじゃくりょく』とも読まれ、さらに『孔雀色 』の別名もあります。
近代にできた色名で明治の頃に西洋から伝わった『ピーコックグリーン』を和訳したものです。
孔雀の青い羽根に由来した『孔雀青 』という色もありますが、こちらも同時期に伝わった『ピーコックブルー』を和訳してできた色名です。
孔雀は中国から東南アジア、南アジアに分布するキジ科の鳥類で、オスは大きく鮮やかな飾り羽を持ち、それを扇状に開いてメスを誘う姿が有名ですが、美しいのオスだけです。
羽毛が装飾品として珍重された他、害虫・毒蛇類を好んで食べることから益鳥として尊ばれました。また仏教においては孔雀明王として信仰の対象となっています。
ちなみに、孔雀の我が国への伝来はとても古く、新羅 から“推古天皇 ”に孔雀を送ったという記述が『日本書紀』に見られます。
江戸の頃になると庶民への認知度も高くなり、大阪では孔雀を見ながら茶が飲める茶店『孔雀茶屋 』が大人気でした。また日本画の題材としても数多くみられます。
日本画の題材として好まれながら、明治期のピーコックグリーンの伝来まで孔雀の名を冠する色名がなぜ作られなかったのか不思議です。",https://irocore.com/kujakumidori/
支子色（くちなしいろ）,"['253', '216', '118']","['00', '18', '60', '00']",#FDD876,"支子色（くちなしいろ）とは、クチナシの実で染めた、少し赤みのある黄色のことです。別に『梔子色』とも表記し、色合いの赤みの濃淡にはやや幅があります。
クチナシは奈良時代より『黄丹 』の下染めに使われていましたが、「支子」の色名はありませんでした。
色名がみられるようになるのは平安時代から。当時は『黄支子 』と呼ばれており、『延喜式 』に記述がある他、『古今和歌集』などにもその名が詠まれています。ただし、厳密にはクチナシで染めた黄色に紅花の赤をわずかに重ね染めした色を支子色、クチナシのみで染めた色を黄支子と呼んで区別されました。
『延喜式』には他に『深支子 』『浅支子 』がありますが、この二色はともに禁色の『黄丹』と同じクチナシと紅花による染色法で、また色合いも似ていて紛らわしいことから、一時『禁色』とされた時期があります。
支子は、アカネ科クチナシ属の常緑低木。樹高１-３メートルほどで森林の低木として自生するほか、園芸用として栽培されてきました。花期は6-7月、一個ずつ花を咲かせ、10-11月ごろには赤黄色の果実をつけます。
支子の実は「山梔子 」ともいい、古くから染料や薬料として用いられてきました。現在でも、キントンを作るときにさつま芋の色づけに使われたりします。
クチナシの名前の由来ですが、実が熟しても割れないことから「口無し」となった説や、「クチナワ＝ヘビ」の「ナシ＝果実のなる木」、クチナワナシからクチナシに変化したという説もあるようです。
支子色は江戸時代を通して人気の色で、江戸の本草学者 “貝原益軒 ” も支子染の法を説いています。
また、この実が熟しても口を開かないことから「口無し」と呼ばれ、支子色のことを『言わぬ色＝不言色 』とも呼ばれました。
※本草学：薬用に重点をおき、植物や自然物を研究した中国古来の学問。",https://irocore.com/kuchinashi-iro/
梔子色（くちなしいろ）,"['253', '216', '118']","['00', '18', '60', '00']",#FDD876,"梔子色（くちなしいろ）とは、クチナシの実で染めた、少し赤みのある黄色のことです。『支子色 』の別表記。『不言色 』は同色。
※ 詳しい色の説明は、『支子色』のページをご確認ください。",https://irocore.com/kuchinashi-iro-2/
朽葉色（くちばいろ）,"['145', '115', '071']","['00', '21', '51', '43']",#917347,朽葉色（くちばいろ）とは、くすんだ赤みがかった黄色のことです。織り色・染め色・重ね色の三種があり、秋の落ち葉の色を表す王朝風の優雅な伝統色名です。襲の色目としては、「表・濃紅、裏・濃黄」で、着用時期は秋になります。江戸時代には茶系統としてひきつがれ、「四十八茶百鼠（しじゅうはっちゃひゃくねず）」といわれるようになり、赤みが強い色を「赤朽葉」、黄色みが強い色を「黄朽葉」と呼ぶなど、微妙な色の違いを見分けています。,https://irocore.com/kuchiba-iro/
栗色（くりいろ）,"['118', '047', '007']","['00', '60', '94', '54']",#762F07,栗色（くりいろ）とは、栗の皮のような赤みの焦茶色のことで、落栗色ともいいます。栗は実も樹皮も染材となりますが、染色のことではなく栗の実の表皮の色を指しています。ちなみに濃い茶色の馬を栗毛と呼んだり、髪の色を栗色と呼ぶなど毛色を形容する色としても知られています。,https://irocore.com/kuri-iro/
涅色（くりいろ）,"['067', '054', '052']","['80', '85', '81', '19']",#433634,"涅色（くりいろ）とは、川底の泥のような茶みがかった黒色のことです。涅 は水の底によどんだ黒い土のことで、平安時代の辞書『和名類聚抄 』にも「涅【久理／くり】水中の黒土なり。」と記されています。
古代にはこの黒土で布地を染色しており、服色としては最下級の色でした。
涅色は平安時代より黒染めの色名としてが見られますが、この頃には雑木の煎汁で染められるようになっています。",https://irocore.com/kuri-iro-2/
栗梅（くりうめ）,"['108', '025', '018']","['05', '78', '75', '55']",#6C1912,栗梅（くりうめ）とは、栗色を帯びた濃い赤茶色です。色名は｢栗色の梅染｣が略されたもので、江戸時代前期から使われました。梅がつく色は『紅梅色 』に代表される赤みを表現しており、『梅鼠 』も赤みを帯びた鼠色です。栗梅は現代でも和服、和装小物などのほか、洋服、インテリア、化粧品などに幅広く使われています。,https://irocore.com/kiriume/
栗皮色（くりかわいろ）,"['106', '064', '040']","['58', '74', '72', '30']",#6A4028,"栗皮色（くりかわいろ）とは、黒みがかった赤褐色のことです。別名、栗皮茶と呼ばれ、その名のとおり栗の皮の色に似ていることからこの色名がつきました。なお栗色と比較するとこちらの方が少し濃い色合いになります。
江戸時代の風俗誌によれば女帯によく使われていた色でした。",https://irocore.com/kurikawa-iro/
栗皮茶（くりかわちゃ）,"['130', '069', '034']","['65', '85', '95', '00']",#824522,栗皮茶（くりかわちゃ）とは、栗の実の皮のような黒みがかった赤褐色です。別名、栗皮色と呼ばれます。その名のとおり栗の皮の色に似ていることからこの色名がつきました。なお栗色と比較するとこちらの方が少し濃い色合いになります。染色法はいくつかの諸説がありますが、栗の樹皮と灰汁で茶に染める「栗皮染」という方法があります。,https://irocore.com/kurikawacha/
胡桃色（くるみいろ）,"['168', '111', '076']","['00', '34', '55', '34']",#A86F4C,"胡桃色（くるみいろ）とは、胡桃の木の皮や実の外皮、あるいは根の皮などを使って染めた黄褐色のことです。胡桃の染色は奈良時代にはすでに行われており、『正倉院文書』に「胡桃紙」という紙を染めていたという記載があります。平安時代では、『枕草子』に「胡桃色といふ色紙の厚肥えたるを…」、『源氏物語』には「高麗の胡桃色の紙に…」などと載っています。
襲の色としては、「表・香色、裏・青」を配して胡桃染の色にちなんだ色目です。
ちなみに英語でウォルナットとよばれる色名は、胡桃色ではなく「胡桃の実の色」とよばれます。",https://irocore.com/kurumi-iro/
胡桃染（くるみぞめ）,"['165', '143', '134']","['00', '13', '19', '35']",#A58F86,胡桃染（くるみぞめ）とは、灰がかった黄褐色のことです。山野に自生する胡桃の樹皮や果皮の煎汁と灰汁で染めました。奈良時代では写経用の染紙に使われ、『源氏物語』『明石』にも「高麗の胡桃色の紙に」とあり、正倉院文書にもその名がみられます。胡桃色は鬼胡桃、姫胡桃などの樹皮を用いて染めていましたが、現在では緑葉か緑の果皮を使用して染めています。,https://irocore.com/kurumizome/
紅の八塩（くれないのやしお）,"['173', '000', '045']","['00', '100', '63', '35']",#AD002D,"紅の八塩（くれないのやしお）とは、紅花の濃染 の深みのある真っ赤な紅色のことです。『紅の八塩』は奈良時代の濃い紅花染めの名で、色名の「八」は『多い』という意味を、「塩」は「入 」とも書かれて『染め汁に浸す』ことを意味しました。つまり「紅の八入 」とは、紅花の染め汁に何度何度も浸すという意味であり、濃く鮮やかに染められた紅花染めということを表現した色名です。
平安期に入っても紅花の濃染はとても高価で贅沢でした。そのため『禁色 』として禁制の対象となりますが、それでも美しい『紅の八塩』の色合いは貴族たちを魅了し、まさに「平安貴族の憧れの色」だったのです。
紅の八塩の鮮やかな紅色が後に、茜 や蘇芳 などの混ざり物がない正真正銘の紅花染めであることが強調されて、『深紅 』や『真紅 』と呼ばれるようになり、また平安期以降は『韓紅 』と呼ばれるようになりました。",https://irocore.com/kurenainoyashio/
黒緋（くろあけ）,"['134', '71', '63']","['54', '75', '65', '14']",#86473F,"黒緋（くろあけ）とは、茜に紫紺を加えて黒紫みをもたせた濃い緋色のことです。名称にある緋の色感はなく黒みの強い色で、一般的には「深緋 」ともよばれる古くからある色名です。
推古天皇11年（603）にはじめて十二階の冠位の色が制定されて以来、衣服令は常に上位の色が濃く、次位の色が薄くなっていました。平安時代の頃までは、皇太子の「黄丹 」についで、親王、諸王、諸臣の一位は「深紫 」、二位、三位は「浅紫 」、四位が「深緋」、五位が「浅緋」というように濃い色のほうが常に上位にきています。",https://irocore.com/kuroake/
黒柿（くろがき）,"['097', '046', '004']","['00', '60', '80', '70']",#612E04,"黒柿（くろがき）とは、深く渋い茶色のことです。江戸前期からの色で、その名のとおり黒みの『柿色』が色名の由来です。
染色法は寛政九年（一七九七）の手写「染物秘傳 」に「下地梅皮三返程引、石灰少入、其上薄く渋を引、後盥 に水を入すがね柄杓 に三倍程入くるなり」と記されており、梅染の上から柿渋 を掛けて染められていました。
江戸時代の染色技法の指南書「手鑑模様節用 」では『黒柿』は『紅消鼠 』の古名であると記されていますが、「大澤善七染見本帳」でも別々に紹介されていますし、そもそも色相が異なるため別の色です。
推測ですが、銘木の「黒柿」の色が『紅消鼠』に似ていることから混同したものではないでしょうか。
黒柿とは、古来より珍重された黒い縞杢 を有する最高級木材のこと。
150年以上の樹齢を重ねた柿の古木からまれに見つかるもので、その確率は数万本に1本の割合といわれている。
黒い部分と他の部分では密度の違いから乾燥・加工が難しく、非常に高度な職人の技を必要としており、素材の貴重さと相まって黒柿の価値の高さにつながっている。
ちなみに、昔の人々がどれほど黒柿を珍重していたかは、正倉院宝物に黒柿の琵琶や琴、鞍や厨子など20点以上含まれていることからも伺いしることができる。
おかや木芸：黒柿の茶碗
柿色の系統は江戸時代前期にはその名が見られるようになり、代表的な色としては、濃い順に『黒柿』『柿色』『大和柿』『洒落柿』『洗柿』『薄柿』などがあります。",https://irocore.com/kurogaki/
鉄色（くろがねいろ）,"['016', '046', '036']","['90', '50', '75', '40']",#102E24,"鉄色（くろがねいろ）とは、鉄の焼肌の色のような青みが暗くにぶい青緑色のことです。釉薬の呉須のくすんだ青色を指すこともあります。金を「こがね」、銀を「しろがね」、銅を「あかがね」というのに対して、鉄は「くろがね」と呼ばれました。
藍染で出される色の中でも緑みの濃い青に対して適当な色がないことから広く用いられた色名で、明治中期頃から大正にかけて大流行し、番頭や手代の前掛けの色に用いられました。ちなみに鉄を関する色名は、ほかに「鉄御納戸」、「鉄紺」、「鉄鼠」、「鉄深川」などがあります。
",https://irocore.com/kurogane-iro/
黒橡（くろつるばみ）,"['050', '044', '040']","['20', '25', '25', '75']",#322C28,黒橡（くろつるばみ）とは、橡の実を砕いて煎じたものを鉄媒染で発色させた青みがかった黒色のことです。ちなみに橡は櫟（くぬぎ）の古名で、灰汁焙煎では黄褐色の黄橡になります。泥で染めたような黒は身分の低い者が着用する衣服の色でしたが、ドングリによって染めた黒橡は黒染めと同じく貴人の喪服に用いられ、伝統色名として受け継がれてきました。『万葉集』にある「橡の衣」とは、この黒橡色の衣のことです。,https://irocore.com/kurotsurubami/
黒鳶（くろとび）,"['067', '047', '047']","['00', '30', '30', '74']",#432F2F,黒鳶（くろとび）とは、やや黒みの赤褐色で暗い赤褐色である鳶色をさらに暗くした色のことです。江戸時代前期から行われた染め色で、『反古染』によると、享保の頃は小袖の色として流行し、安永の頃には黒の紗綾形（さやがた）模様の帯としても流行しました。,https://irocore.com/kurotobi/
黒紅（くろべに）,"['048', '040', '051']","['06', '22', '00', '80']",#302833,"黒紅（くろべに）とは、赤みがかった黒、または黒みがかった赤色のことです。江戸前期の寛文（1661〜72）年間には高価な小袖の地色として使われており、井原西鶴の『萬の文反故 』に「御内儀の昔小袖……黒紅に御所車の縫箔の小袖」と見られます。
染料は紅染を下地にしてその上に檳榔子 で黒をかけたもので、『黒紅梅 』とも単に「黒」とも呼ばれます。ただ、檳榔子のみでは濃い黒色は得られず、光沢のある潤み色が出たことから、紫檀 や紅木 のような赤みの紫黒であったと思われます。",https://irocore.com/kurobeni/
黒紅梅（くろべにうめ）,"['048', '040', '051']","['06', '22', '00', '80']",#302833,"黒紅梅（くろべにうめ）とは、赤みがかった黒、または黒みがかった赤色のことです。
江戸前期から高価な小袖の地色として愛用されました。
染料は紅染を下地にしてその上に檳榔子 で黒みをかけたもので、別に『黒紅 』の色名もあります。",https://irocore.com/kurobeniume/
桑色（くわいろ）,"['218', '188', '145']","['20', '30', '50', '00']",#DABC91,桑色（くわいろ）は、桑の根皮や木皮の煎汁に灰を媒染にして染めた黄色がかった薄茶色のことです。桑色は桑の木を材料にした草木染めの総称で、かなり幅広い色味を含みます。ちなみに桑の実の色は全然違う黒紫色のことです。,https://irocore.com/kuwairo/
桑染（くわぞめ）,"['218', '188', '145']","['20', '30', '50', '00']",#DABC91,桑染（くわぞめ）は、褐色を帯びたくすんだ黄色のことです。「衣服令」では黄より一つ上位の色として出てきますが、高貴な色ではありません。江戸時代は桑染の色を桑茶（くわちゃ）と呼んでいました。古くから用いられた染料であるため時代の変化によって色合いは結構幅広いのが特徴です。そのため、桑染と桑茶を別の色として分ける考えかたもあります。,https://irocore.com/kuwazome/
桑の実色（くわのみいろ）,"['085', '000', '048']","['45', '90', '00', '00']",#550030,"桑の実色（くわのみいろ）とは、その名のとおり熟した桑の実のような暗い赤紫色のことです。桑の実を使って染められた色で、英名では『マルベリー』。
平安の頃は『桑染 』『桑色 』と呼ばれていましたが、桑の樹皮を使って染めた黄褐色も『桑染』『桑色』と呼ばれていたため、混乱を防ぐために江戸の頃より「桑の実色」と呼ばれるようになりました。
クワは、クワ科クワ属の総称。落葉性の高木。樹皮は灰色を帯びています。絹をとるための蚕 の餌として、古来より重要な作物で、果樹としても利用されました。
クワは春に開花し、キイチゴのような果実が初夏に熟し、実は熟すと赤黒くなります。
ちなみに、クワは蚕が食べる葉の「食葉（くは）」が語源で、『日本書紀』にも登場するほど古くから親しまれた植物です。
",https://irocore.com/kuwanomi-iro/
群青色（ぐんじょういろ）,"['000', '091', '170']","['100', '58', '00', '00']",#005baa,"群青色（ぐんじょういろ）とは、日本画材の岩絵具 の『群青 』に由来する色名で、紫みがかった深い青色のことです。日本画には欠かせない色であり、桃山時代の障壁画、江戸時代の琳派 の屏風絵 などに使われています。
岩絵具の「群青」は、もとは鉱物の瑠璃 （ラピスラズリ）から作られたものでしたが、瑠璃は宝石としても非常に高価なため、藍銅鉱 （アズライト）を原料とするようになっていきます。ただ、どちらにしても高価な鉱物を砕いて作られているため、群青の色は人工の岩絵具が登場するまで、宝石に匹敵するほど貴重な『青』でした。
天然の岩絵具は、同じ原料でも鉱物の粒子が細かくなるほど色は淡 くなり、粒が荒いほうから『紺青 』、『群青』、そして最も粒が細かい色を『白群 』と呼びます。
ちなみに、砕いた鉱物、青の粒の集まりということから「青が群れ集まる」という意味の『群青』という色名になったようです。
藍銅鉱は鉱物（炭酸塩鉱物）の一種。英名では、「アズライト（azurite）」。
結晶系は単斜晶系。「ブルー・マラカイト」と呼ばれる宝石でもあります。
藍銅鉱は銅の代表的な二次鉱物の1つで、世界各地の銅鉱床の風化帯にて産します。ちなみに、同じ銅の二次鉱物である孔雀石 （マラカイト）も共生することが多いです。
『群青』がいつ頃から使われるようになったか定かではありませんが、江戸中期の画法書「画筌 」に「紺青…これを摺 って群青を出す」との説明が見られることから、江戸期には一般化していたようです。ただ、染色名には用いられていません。
また、この記述から『群青』が『紺青』の淡色 であったことが分かります。
また、古代では『紺青』より淡い青は、すべて『白青 』と呼ばれていました。
岩絵の具の「群青」は、原料である藍銅鉱が孔雀石と混じって採れることが多いため、精製が難しく、孔雀石からとれる岩絵具の「緑青 」の10倍の値段で取引され、群青60gで米一俵買えるほどでした。
こんにちでも人工岩絵具の群青の色相は、「紫み」「深青」「緑み」の三系統があり、色味に幅があります。これは、藍銅鉱を砕いて作られた「岩群青」、瑠璃を砕いて作られた古い「群青」、そして緑系の孔雀石が混じった藍銅鉱から作られた「岩群青」に由来しているためでしょう。なお、今回は天然群青の標準的な色調を使用しています。
高価で貴重な青『群青』が使われるのは、日本画の中でも如来像や菩薩像の頭髪、曼荼羅の一部など、尊いものが主でした。
当時の絵師はきっと『群青』の青に強烈に憧れたことでしょう。だからこそ、『群青色』は現代にも消えずに残っているのかもしれません。",https://irocore.com/gunjou-iro/
鶏冠石（けいかんせき）,"['233', '128', '053']","['00', '60', '80', '05']",#E98035,"鶏冠石（けいかんせき）とは、明るい橙色のことです。日本画の顔料の色で、赤色の鉱物の「鶏冠石 」を粉末にすることで色見本のような明るい橙色 になります。
同じ硫化砒素の鉱物に黄みが強い「雄黄 」がありますが、こちらも顔料の色として「雄黄 」という色名になっています。硫化砒素が非常に毒性が強いことと、合成顔料が発達したことにより、天然顔料の「鶏冠石」と「雄黄」は現在ほとんど使われていません。

鶏冠石｜VEC STONE CLUB
鶏冠石｜VEC STONE CLUB",https://irocore.com/keikanseki/
消炭色（けしずみいろ）,"['089', '080', '069']","['00', '10', '20', '80']",#595045,"消炭色（けしずみいろ）とは、消し炭のような橙 みの暗い灰色のことです。火を消した木炭の、うすい灰を飛ばすと現れる炭の色を表現しています。黒に近い灰色ですが『墨色 』ほど深い黒色ではなく、どちらかといえば『薄墨色 』に近い色です。
消炭とは燃え盛る薪 の火を途中で消した、やわらかい炭のことです。一度燃えて火つきがよいことから現代でもキャンプなどで火種として用いれます。浮炭 とも。
また、消し炭が「火がおこりやすい」ことにかけて「怒りやすい、怒りっぽい人」、つまり「短気な人」を呼ぶ隠語としても使われます。
消炭色は古い文献にその名が見られないことから、明治期以降の色名だと思われます。",https://irocore.com/keshizumi-iro/
憲法染（けんぽうぞめ）,"['087', '071', '056']","['68', '68', '77', '31']",#574738,"憲法染（けんぽうぞめ）とは、赤みがかった黄みの暗い黒茶色のことです。江戸初期の兵法家 ・剣客 の “吉岡憲法 ” が考案したとされる黒茶染の色をいいます。別に『吉岡染 』『憲房染 』『憲法黒 』とも。
江戸時代には日常の黒の衣服として広く愛用され、“井原西鶴”の『日本永代蔵 』（貞享五年／一六八八）にも「油屋絹の諸織を憲法の紋付、袖口薄綿にして三つ重ね」とみられます。
『憲法染』は個人の名を冠した染めや色の名前の最も古い例で、ことによると日本最初のデザイナーズブランドだったかもしれません。
",https://irocore.com/kenpozome/
月白（げっぱく）,"['246', '247', '248']","['02', '01', '00', '04']",#F6F7F8,"月白（げっぱく）とは、月の光を思わせる薄い青みを含んだ白色のことです。色名の月白を「つきしろ」と読むと、月が東の空に昇るの際に空がだんだん明るく白んでいく様子を指し、特に月見客が十五夜を待ち焦がれる思いを表現しました。また「月代 」とも書かれ「三秋 」の季語にもなっています。
和色の中には『純白』『胡粉』『乳白色』『銀白色』『卯の花色』など白を表す様々な色名がありますが、そんな中でも月白は文学的で風流さを感じさせる色名です。",https://irocore.com/geppaku/
玄（げん）,"['087', '071', '056']","['68', '68', '77', '31']",#3E1E00,"玄（げん）とは、赤や黄みを含んだ深みのある黒色のことです。また『黒』は同義語。
「玄」の色は「黒」を意味し、日本の美術家の“篠田桃紅 ”は、自書の中で「玄というのはまた、一筆の濃墨で書くのではなく、淡い墨を重ねて刻していき、真っ黒の一歩手前で控えた色。」と紹介しています。
五行説では黒は「北」と「水」の色とされ、そのため北を司る黒い聖獣は水に関係して「亀蛇」の姿をしており、その名は「玄」を冠した「玄武 」という名で呼ばれます。
また同じく五行説では、黒を「冬」に配することから「玄冬 」の異称で呼びます。なお、他の季節には「青春 」「朱夏 」「白秋 」の異称があります。
「玄」の字の成り立ちは諸説ありますが、黒く染められた糸の束が吊るされた様子を表しているようです。複雑に絡み合った黒い糸の束に奥深さを感じた人々は「玄」に対して様々な意味を見出します。その結果、「玄」の文字は「黒」の他に「天」「天空の色」「幽遠」「暗闇」「深遠」「静寂」や「老荘思想の哲理」「神羅万象 の根源」など複数の意味を含むようになりました。
このように「玄」は伝統色というよりも、色を超えた理念的・思想的な概念と考えたほうが適切かもしれません。
聖獣『玄武』",https://irocore.com/gen/
濃藍（こいあい）,"['0', '46', '78']","['60', '45', '00', '85']",#002E4E,"濃藍（こいあい）とは、藍染の中でも最も濃い色の一つで、極めて暗い藍色のことです。
「こあい」とも読まれる古くからある色名で、藍色と紺色の中間にあたります。
平安時代の格式『延喜式 』縫殿寮 の項によれば、藍染による『藍色』は濃い色から順に『濃藍』『中藍』『浅藍』『白藍』の四段階に区分されていました。
藍色は茶色、鼠色と並んで江戸時代に流行した色であり、多くの派生色が存在します。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/koiai/
香色（こういろ）,"['239', '205', '154']","['00', '14', '36', '06']",#EFCD9A,香色（こういろ）とは、灰みの明るい黄赤色のことで、色名は貴族趣味的な呼び名です。丁子や香料の煮汁で染めた色で、色相が広いです。平安時代は色の濃淡で、淡香（うすきこう）、中香（なかのこう）、濃香（こきこう）と呼び分けていました。また非常に高価なものとされ、源氏物語にも夕霧が香色をあらたまった訪問に装う場面がでてきます。大貴族は本物の丁子を使っていましたが、一般的にはベニバナとクチナシを掛け合わせて染めた色を香色と呼んでいました。,https://irocore.com/kou-iro/
光悦茶（こうえつちゃ）,"['154', '114', '092']","['00', '36', '40', '50']",#9A725C,"光悦茶（こうえつちゃ）とは、穏やかで落ち着いた雰囲気の茶色のことです。光悦とは、江戸初期の文化人・総合芸術家の“本阿弥光悦 ”のこと。
本阿弥光悦は、京都鷹ヶ峰に芸術家村をつくり、陶芸、工芸、作庭、茶の湯など幅広い分野で活躍。彼の交際範囲は広く当代の知名人士と関係があり、また琳派の“俵屋宗達 ”の才能を引き出すなど、後世の日本文化に多大な影響を与えた大人物です。
この上品な茶色が当代一の文化人であった「光悦」を連想させることから、色名として付けられものと思われます。
本阿弥 光悦（ほんあみ こうえつ 1558-1637）は、江戸時代初期の書家、陶芸家、芸術家。号は太虚庵、自得斎、徳有斎など。書においては、近衛信尹 、松花堂昭乗 とともに「寛永の三筆」と呼ばれて名高く、その書流は「光悦流」として後世に伝わりました。
また、俵屋宗達、尾形光琳とともに、琳派の創始者としても知られています。",https://irocore.com/kouetsucha/
麹色（こうじいろ）,"['238', '222', '185']","['00', '11', '30', '08']",#F1DDB4,"麹色（こうじいろ）とは、米麹 のような薄い赤みの灰黄色のことです。その名のとおり、酒作りなどに使われる麹が名前の由来。もとは「麹のような色」のように色合いの例えにしていたものが、そのまま色名となりました。
麹は古くから味噌や醤油、酢、酒などの醸造に用いられてきたこともあり、日本人には身近なものでしたが色名となったのは近年になってからです。
麹は、穀物（米・麦・大豆など）を蒸したものにコウジカビを繁殖させたもの（米麹など）。または、発酵調味料を指す場合もあります（塩麹など）。
「コウジ」の名は麹を発酵させるという意味の「醸す 」の名詞形「かもし」が、ウ音便化により転訛したものです（カモシ > カウジ > コージ）。
「麹」と同じ意味で「糀 」という字もありますが、こちらは日本独自の漢字で「米麹」を意味します。米に花が咲くように見えるコウジカビの様子から生まれました。
2010年以降、塩麹がブームとなっていることもあり『麹色』もまた新たに認知度を高めた色と言えるかもしれません。
ちなみに、『麹色』と同じ読みの色には、他に『柑子色 』がありますが、こちらは蜜柑の一種である「柑子」の皮の色に由来する色名です。


米麹
米麹",https://irocore.com/koujiiro/
柑子色（こうじいろ）,"['234', '169', '056']","['00', '43', '95', '00']",#EAA938,"柑子色（こうじいろ）とは、蜜柑色をやや薄くしたような明るい黄赤色のことです。柑子は古くから日本で栽培されたミカンの一種でコウジミカンの略。別に「カンジ」とも読まれました。『萱草色 』の別名とも言われますが、現代では『萱草色』はもう少し鮮やかな色を指します。
柑橘系の実の色としては『蜜柑色 』や『橙色 』などより古く、室町時代にはその名が見られました。（出典：桃華蘂葉 -一四八○）
染色はアカネ科クチナシとキク科ベニバナを合わせて染めていましたが、ベニバナの代わりに蘇芳 の明礬媒染も行われていたようです。
重 ねの色でもあり「表・濃朽葉、裏・濃朽葉」の色目で、着用するのは秋でした。
また、裏を黄色にすると『橘 』の重ねになり、こちらは夏の色となっています。（出典：薄様色目）
ちなみに、『柑子色』と同じ読みの色名に『麹色 』がありますが、こちらは米麹に由来する赤みの淡い灰黄色のことです。

柑子蜜柑の実
柑子蜜柑の実",https://irocore.com/kouji-iro/
香染（こうぞめ）,"['173', '125', '076']","['00', '28', '56', '32']",#AD7D4C,"香染（こうぞめ）とは、香料である丁子の蕾の煮汁で染めた染め色で黄みの暗い褐色のことです。別名「丁子染」とも呼ばれ、染めてしばらくは色に丁子の香りが伴います。
媒染剤を用いずに染めると、白茶に近い色になり「淡き香」「香色」と呼ばれました。
『香染』は『濃き香』、あるいは『こがれ香』と呼ばれ、創案は平安時代の西宮左大臣“源高明 ”といわれています。",https://irocore.com/kouzome/
紅梅色（こうばいいろ）,"['232', '107', '121']","['00', '70', '35', '03']",#E86B79,"紅梅色（こうばいいろ）とは、早春に咲く紅梅の花の色のようなやや紫みのある淡い紅色のことです。平安時代からの色で、色名の由来は文字どおり紅梅の花の色から。
『紅梅色』はキク科ベニバナを用いた紅花染 めの一種で、色の濃さにより『濃紅梅 』『中紅梅 』『淡紅梅 』などのバリエーションがあります。ただし、平安文学においての「紅梅」といえば主に『中紅梅』を指しました。
また重 ねの色でもあり、「表・紅色、裏・蘇芳 」を配しかなり強い赤を表現しています。
梅はバラ科サクラ属の落葉高木。中国が原産で奈良時代までは輸入されていましたが、遣唐使によって白梅が伝わり、さらに平安時代に紅梅も伝わることで一般化しました。清少納言も『枕草子』で「いとめでたきもの」として「木の花は、こきもうすきも紅梅」とあげています。
また、新元号の『令和』も、出典は『万葉集』の梅花の歌集であるように、梅は古くから親しまれてきました。
令和：『万葉集』巻五　梅花の歌三十二首并せて序より-「初春の令月にして、気淑く風和らぎ、梅は鏡前の粉を披き、蘭は珮後の香を薫す」-
ちなみに、江戸時代後期の『貞丈雑記』には、紅梅色はかつて『桃色』に近い色であったが、近年は黒っぽい『紫紅色』のこととなっていると記されており、江戸期には濃い紫紅色を紅梅色と呼んでいたことが分かります。
初春に春の訪れを告げるように花を咲かせる紅梅。その花の色である『紅梅色』もまた淡い紅色が春をイメージし、今も昔も女性に人気の色名です。
紅梅",https://irocore.com/kobai-iro/
高麗納戸（こうらいなんど）,"['016', '069', '057']","['95', '78', '85', '10']",#104539,"高麗納戸（こうらいなんど）とは、暗い青緑色のことです。『高麗納戸』は江戸中期の寛政年間に歌舞伎の大立者“四世・松本幸四郎”が「鈴々森」で演じた人気の侠客、“幡随院長兵衛 ”の合羽に用いた暗い『納戸色 』に由来しており、色名の｢高麗｣とは、幸四郎の屋号｢高麗屋｣を指しています。
ただし、この色が流行色となったのは“五世・松本幸四郎”になってから。
四世・幸四郎から受け継いた合羽の色が、五世・幸四郎により評判を呼び、はやりものとして流行色となりました。
五世・幸四郎は文化文政から天保にわたって活躍し、鼻が高い容貌から後に「鼻高幸四郎」と呼ばれて江戸っ子に愛された人気役者。彼に由来する「高麗屋」の屋号をつけたはやりものには、他にも「高麗屋縞 」があり、もちろん、これも元は長兵衛の合羽に由来した「縞模様」です。
余談ですが、四世・幸四郎との確執で有名な“初代・尾上菊五郎”にも『梅幸茶 』という彼の俳号に因んだ色名が残っています。",https://irocore.com/kourainando/
黄櫨染（こうろぜん）,"['173', '077', '000']","['00', '63', '100', '30']",#AD4D00,"黄櫨染（こうろぜん）とは、赤みの暗い黄褐色のことです。天皇陛下が儀式に着る袍 の色で『絶対禁色 』。その染料は「延喜式 」の縫殿寮 の雑染用度によると「黄櫨綾一疋、櫨 十四斤、蘇芳 十一斤」とあり、天位の象徴色として、盛夏の太陽の輝きを表したものといわれています。
※綾 は無地染めの綾織りの絹。一疋 は二反 分の長さで22ｍ前後。
※一斤は約600g。両は1/16斤で約37.3g。
※斗は18リットル、升は1/10斗で1.8リットル。囲 は草の束を数える単位。
弘仁11年（八二◯年）に天皇が晴の儀式に着用する「袍の色」と定められ、天皇以外は用いることができない『絶対禁色 』とされました。禁色の規制が緩和された現代でも天皇以外着ることが許されない色です。
ちなみに、皇太子が身につける袍の『黄丹 』の色も「絶対禁色」となっています。
袍の色は歴代の天皇によっても微妙に違いがあるため、『黄櫨染』の色調にはさまざまな説があります。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。
黄櫨とは櫨（はぜ）の木の古名ですが、全く別の色に『黄櫨色 』という色もあるので混同しないよう注意が必要です。
古い時代の袍の色は黄みが強いことから、『黄櫨染』の色調は黄みが強い色だとの説もあります。ただし、色彩学の大家 長崎盛輝氏によれば、それは染色の際に上掛けする蘇芳あるいは紫根の赤みが、時とともに消えて下染めの黄みが現れてくるからだろうと推測されています。",https://irocore.com/korozen/
深緋（こきあけ）,"['194', '0', '36']","['30', '100', '95', '0']",#C20024,深緋（こきあけ）とは、紫みの暗い赤色で、茜と紫とで染めたもので、名称にある緋の色感はなく黒みの強い色です。「こきひ」とも「ふかひ」とも読まれる古くからある色名です。明治時代の装束に関する文献『歴世服飾考』でも、｢たとへば桑の実の、初は赤きが、後黒となりたるが如しといへり｣と評しています。,https://irocore.com/kokiake/
濃色（こきいろ）,"['065', '046', '073']","['88', '100', '70', '00']",#412E49,"濃色（こきいろ）とは、紫根染めを何度も繰り返し染められた黒みがかった深い紫色のことです。色名の由来は最も濃い紫色ということから。別に「こいろ」とも読まれます。
『濃色』は『深紫 』の別名で、対色は『薄色 』、こちらは『浅紫 』の別名です。
また、この２色のちょうど中間に『半色 』という色もあり、濃い薄いといった修飾語だけで色名となっているのは、それだけ『紫』が我が国では特別な色だからでしょう。
例えば、和歌で「むらさきの」は「匂う(美しく輝くの意)」にかかる枕詞でした。
“清少納言”も『枕草子』の中で「すべてなにもなにも、紫なるものは、めでたくこそあれ。花も糸も紙も。」と紫を絶賛してています。
余談ですが、平安時代の女房装束の打袴 の色は、本式が『紅』の紅袴（緋袴）で、若年は『濃色』でした。",https://irocore.com/kokiiro/
深支子（こきくちなし）,"['239', '187', '044']","['10', '32', '90', '00']",#EFBB2C,深支子（こきくちなし）とは、赤みの淡い黄橙色のことです。支子（くちなし）の実で染めた黄色の上に紅染めを施し赤みを重ねた色で、支子の濃い感じを出すため紅花が加えられました。「支子」の色名は平安時代から見られ、そのひとつが深支子です。,https://irocore.com/kokikuchinashi/
深縹（こきはなだ）,"['042', '064', '115']","['63', '44', '00', '55']",#2A4073,"深縹（こきはなだ）とは、藍染 めの中で最も濃く深い色で、わずかに紫みを含んだ青色のことです。非常に古い色名で、「ふかきはなだ」とも読まれます。
『縹色 』の系統であり、平安時代の格式『延喜式 』によれば、『深縹』『中縹 』『次縹 』『浅縹 』の4種類にわけらています。
『深縹』は、平安時代から鎌倉時代にかけてその濃く勇ましい色合いから、男物の衣装として流行しました。また平安中期より『紺 』とも呼ばれるようになります。
「養老律令 （七五七）」の朝服条によれば、『深縹』は朝廷への出仕に着用する朝服の八位の色とされており、対語の『浅縹』は初位の色と規定されています。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/kokihanada/
深紫（こきむらさき）,"['073', '055', '089']","['18', '38', '00', '65']",#493759,"深紫（こきむらさき）とは、黒みがかった深い紫色のことです。紫草の根を何度も繰り返し染めることでこの色は染められました。
別に『濃紫 』『濃色 』『黒紫 』と呼ばれ、また「官位を極める」の意で『至極色』とも呼ばれました。ただし、『黒紫』と『至極色』に関してはより黒い色を指すとの説もあります。
推古天皇11年（603）、聖徳太子が制定した冠位十二階の制において、最上位を象徴する色には、常に紫が選ばれ、親王、内親王をはじめとした臣下の一位の公式の服名は『黒紫』または『深紫』でした。
このように『紫』を尊ぶ心や風潮は、時代を超えて伝えられており、平安時代に清少納言が「すべて、なにもなにも、紫なるものは、めでたくこそあれ。花も、糸も、神も」と詠んでいます。",https://irocore.com/kokimurasaki/
苔色（こけいろ）,"['120', '136', '045']","['30', '00', '80', '50']",#78882d,"苔色（こけいろ）とは、苔のような深く渋い黄緑色のことです。色名の由来はもちろん苔の色から。平安時代からの由緒ある色名ですが、現代では『モスグリーン（
Moss green）』のほうが一般的かもしれません。
元々は重 ねの色目で、「表・濃萌黄、裏・濃萌黄」などを配し、夏に用いられていました。ちなみに、平安文学に『苔衣 』の言葉が見られますが、これは苔を衣に見立てた僧侶や隠者の粗末な衣服を差しており、『苔色』の衣を表しているわけではありません。
苔はコケ植物の苔類、蘇類など花の咲かない背の低い植物の総称。日本には約二◯◯◯種類もあり、日本庭園や盆栽で利用されるほか、我が国の国歌「君が代」で歌われるなど古くから日本人に親しまれてきた植物です。
苔生 した老木や苔に覆われた庭石の味わい深さは、侘び寂びに代表される日本人の美意識の象徴であり、そこから生まれた『苔色』には日本文化の片鱗をみることができるといえるでしょう。
通称「苔寺」とよばれる西芳寺
通称「苔寺」とよばれる西芳寺",https://irocore.com/koke-iro/
焦茶（こげちゃ）,"['074', '036', '000']","['00', '50', '100', '85']",#4a2400,"焦茶（こげちゃ）とは、物が焼け焦げたような黒みがかった茶色のことです。江戸時代の流行色「四十八茶百鼠 」の中では最も濃い茶色にあたります。染めの色として小袖 の地色などに用いられました。
日本の伝統色では濃い色や暗い色を表す修飾語として一般的に「濃、暗、深」の字をあてるため、「焦」というのは茶系統だけの珍しい表現になります。
ちなみに他に「焦」がつく色には『焦色 』『黒焦茶 』などがありますが、種類はあまり多くありません。
染法は「諸色手染草 」（明和九年／一七七二）、『染物重宝記 』（文化八年／一八一一）によれば楊梅皮 で染められていたようです。
『焦茶』はJIS規格にも「暗い灰みの黄赤」とあり、現代でも使われる馴染みのある色といえるでしょう。
焦げた板壁
",https://irocore.com/kogecha/
古代紫（こだいむらさき）,"['140', '101', '137']","['25', '50', '00', '40']",#8C6589,"古代紫（こだいむらさき）とは、わずかに赤みを帯びた、くすんだ紫色のことです。紫草という多年草の根による紫根染めで染められており、江戸時代に流行した青みを帯びた派手な紫が『今紫』と呼ばれたのに対して付けられた色名です。
『京紫』と同一とする説もありますが、一般的に京紫はもう少し鮮やかな色になります。",https://irocore.com/kodaimurasaki/
琥珀色（こはくいろ）,"['234', '147', '010']","['10', '55', '95', '00']",#EA930A,琥珀色（こはくいろ）とは、琥珀の石のような色、すなわち透明感のある黄褐色のことです。または英語にならってアンバーとも呼びます。琥珀は太古の樹脂類が土中で石化した鉱物で、古くは｢くはく｣、｢あかだま｣ともいわれ、瑪瑙などとともに貴石とされました。大部分は不透明な黄橙色をしており、これが琥珀色とされます。ウイスキーの色あいをやや詩情を込めて述べるとき、よくこの色名が使われています。,https://irocore.com/kohaku-iro/
媚茶（こびちゃ）,"['113', '098', '070']","['00', '13', '38', '56']",#716246,媚茶（こびちゃ）は、やや黒ずんだ黄褐色のことです。濃い黄みの褐色、緑がかった茶色に用いられます。元の名を昆布茶（こぶちゃ）といい、海藻の昆布の色を表していましたが、「媚びるような艶っぽい色」という意味から「媚茶」の字を当てられました。媚茶は『御ひいなかた』以来、雛形本の小袖の地色にしばしばみられ、人の気をそそる色としてこの色名が続いています。ちなみに、江戸時代に『四十ハ茶百鼠』と呼ばれた流行色の一つです。,https://irocore.com/kobicha/
昆布茶（こぶちゃ）,"['111', '096', '069']","['56', '62', '73', '00']",#6F6045,昆布茶（こぶちゃ）は、やや暗い黄褐色のことです。濃い黄みの茶色に用いられます。江戸時代の流行色「海松茶」の染色法から派生した色名です。海松（みる）が海藻の一種だったので、同様に昆布とつけましたが、後に「媚びるような艶っぽい色」という意味からの「媚茶」と呼ばれこちらの方が一般的な色名となりました。,https://irocore.com/kobucha/
小町鼠（こまちねず）,"['229', '226', '228']","['00', '03', '00', '15']",#E5E2E4,"小町鼠（こまちねず）とは、ほんのりと赤みを帯びた淡い鼠色のことです。『銀鼠 』よりも淡く、上品で華やかさのある色。江戸時代に、いわゆる『四十八茶百鼠 』として流行した『鼠色 』の一つです。
もともとはあまりパッとしていなかった薄鼠色ですが、美人の代名詞である“小野小町 ”の名を冠することで気品のある美しい色という印象をあたえて、若者のあいだで一躍、流行色となりました。
ちなみに、美人に対して「◯◯小町」という名で呼ぶようになったのも、同じく江戸時代からです。",https://irocore.com/komachinezu/
小麦色（こむぎいろ）,"['228', '163', '067']","['00', '38', '75', '12']",#E4A343,"小麦色（こむぎいろ）とは、小麦の殻粒のようなやわらかい赤みのある黄色のことです。「小麦色の肌」のように、綺麗に日焼けした健康的な肌色を形容する場合に使われます。
小麦色はもともと日本の伝統色ではなく、英語の『ホイート（wheat）』の訳語で、近代文学で使われるようになったものが定着しました。平安時代の色でいえば『深黄 』が近い色といえるでしょう。
ちなみに、小麦色が日焼けした肌を形容するのは日本だけで、英語の『ホイート色』は日焼けの色としては使われていません。海外でいえば、フランスの日焼けした肌色の形容として「焦げたパンの色」を表す『パン・ブリュレ（pain brule）』が使われていて、こちらは『茶色』に近い色です。
小麦（コムギ）は、イネ科コムギ属に属する一年草の植物。一般的にはパンコムギを指します。世界三大穀物の一つ。古くから栽培され、世界で最も生産量の多い穀物のひとつです。
我が国でも小麦との関わりは深く、約2000年前の遺跡から小麦が出土しています。また、奈良・平安期には「五穀」の1つとして重視されていましたが、製粉技術が発達する江戸時代までは、食料としてよりも飼料として使われることが多かったようです。
小麦が食料として使われなかったからでしょうか、近代になるまで『小麦色』や『麦藁色 』など麦に関する色名はあらわれませんでした。
",https://irocore.com/komugi-iro/
小紫（こむらさき）,"['075', '013', '067']","['40', '80', '00', '70']",#4B0D43,"小紫（こむらさき）とは、コムラサキの実のような渋めの濃い紫色のことです。
小紫といえば、一般的には植物や蝶の名前、または歌舞伎の演目「其小唄夢廓 」から吉原の遊女、三浦屋「小紫」のほうが知られているかもしれません。
小紫はもともと『濃紫』と書きますが、その色合いがコムラサキの実の色に似てるいることから、いつからか小紫が色名として定着したものだと思われます。
通常、色名に「小」を冠せば「淡い色」を指しますが、あえて濃い紫色に「小」のついた「小紫」の字を当てているあたり、かなり粋な色名ともいえるでしょう。
小紫（コムラサキ）とは、シソ目クマツヅラ科ムラサキシキブ属の落葉低木です。別名は「小式部 」。
和名の由来は、植物の「紫式部 」を小さくしたような姿から、この名前がつきました。初夏に薄紫の花を咲かせます。
なお、色名の『紫式部 』も植物の紫式部の実に由来する色です。
紫式部と小紫は混同されていることも多い植物ですが、厳密には別種で、実のつきかたが美しいことから小紫のほうがより人気があります。
ちなみに、蝶 の「小紫 」は色名や植物の小紫とは関連がなく、蝶の「大紫 」に対してつけられたものです。

小紫を『しょうし』と読むと、648年に施行された「七色十三階冠 」の冠位の色を指します。『小紫 』は上から数えて6番目の色で『大紫 』の下にあたります。
※七色十三階冠：大織・小織・大繍・小繍・大紫・小紫・大錦・小錦・大青・小青・大黒・小黒・建武
小紫の実",https://irocore.com/komurasaki/
紺（こん）,"['000', '026', '067']","['100', '50', '00', '80']",#001A43,"紺（こん）とは、藍染 の中で最も濃い色で、わずかに赤みを含んだ濃い青色のことです。英名では『ネイビーブルー』。古くは『深縹 』と呼ばれ、平安時代の式目『延喜式 』にもその名が見られます。ちなみに『縹 』とは昔の青色のこと。
もともと中国古来の染色名だった紺色は、平安の頃に色調とともに我が国に伝来しました。その後、日本古来の色で同色だった『深縹』に「紺」の字があてられて、中世以降に定着していきます。
紺色は日本人にとって広く親しまれ、紺絣 、紺足袋 、紺暖簾 など「紺」が付く単語は数多くみられます。室町時代には紺染 職人を紺掻 と呼び、江戸時代には紺屋 が染物屋の代名詞になるほどでした。現在でも学校や企業の制服の色として広く使われています。
紺色は藍染を繰り返して出される色ですが、大変に手間がかかる事から江戸期には手軽に染めるため「呉汁に染めを加え、予め布地に下染してから藍染に移す」ことも行われるようになりました。このため手間を掛けた「上等の紺」は特別視され、『上紺 』や『正紺 』と呼ばれ区別されています。また、これ以上は濃く染まらないという事から『留紺 』の名でも呼ばれました。
鎌倉の頃より『紺』は『褐色 ＝勝色』として武士には縁起の良い色でした。
戦国時代の名将“藤堂高虎 ”も遺訓の中で「戦の道具は柿色はダメだ、紺色がいい。」といっています。
江戸初期に『柿色』が流行しましたが、高虎としては武士が紺色を身に着けずに流行色を着ることが面白くなったのかもしれません。
原文「陣道具柿あし、紺可然色々ありといへ共書付におよはす」高山公実録
※高山は藤堂高虎の法号
原文「陣道具柿あし、紺可然色々ありといへ共書付におよはす」高山公実録
※高山は藤堂高虎の法号",https://irocore.com/kon/
紺桔梗（こんききょう）,"['033', '030', '085']","['100', '90', '42', '12']",#211E55,"紺桔梗（こんききょう）とは、桔梗色に紺を含ませた様な色味の濃い青紫のことです。
染色法は下染を紺色にし、その上に蘇芳 または紅花を用いて紫みがからせていました。
桔梗は平安時代から使われている色名で後代の人達になじみのある「紺桔梗」「紅桔梗」や「桔梗納戸」「桔梗紫」のような修飾語としても使われています。",https://irocore.com/konkikyou/
金青（こんじょう）,"['000', '055', '117']","['100', '63', '00', '45']",#003775,"金青（こんじょう）とは、古代の顔料の色で紫色を帯びた暗い上品な青色のことです。『紺青 』の古名。別に「きんせい」とも呼ばれます。
『金青』の名前は非常に古く、勅撰 史書「続日本紀 」の文武天皇二年（六九八）の条に「○乙酉。令近江国献金青。伊勢国朱砂雄黄。常陸国備前伊勢日向四国朱砂。安芸長門二国金青緑青。豊後国真朱。」との表記があり、赤系の『朱沙 』『真朱 』、黄系の『雄黄 』、緑系の『緑青 』とともに献上品として記録が残るほど貴重な顔料で、仏像や仏画の彩色になくてはならないものでした。
「藍銅鉱」という貴重な鉱物から作られるため「金」の字を冠していましたが、平安の頃に中国から同系色の『紺 』が伝わったのを期に『紺青』の表記になったと思われます。
藍銅鉱（アズライト）",https://irocore.com/konjou/
紺青色（こんじょういろ）,"['000', '055', '117']","['100', '63', '00', '45']",#003775,"紺青色（こんじょういろ）とは、顔料の「紺青」に由来する色で紫色を帯びた暗い上品な青色のことです。飛鳥時代（五九三〜七一○）に『金青 』として中国から製法とともに伝来し、奈良時代（七一○〜七九四）には仏像や仏画の彩色に使用されました。
『紺青』の表記は、平安の頃に中国から色の系統が同じ『紺 』が伝わったのを期に変更されたものと思われます。
『紺青色』の岩絵具は「藍銅鉱 」を原料としていますが、その『紺青』を擦って粒子を細かくしたものが『群青 』になり、それをさらに細かくしたものが『白群 』になります。
中国の画譜『芥子園畫傳 』には「石青＝藍銅鉱」を水飛 して、『頭青』『二青」「三青』に分けると記されており、色が濃い『三青』が『紺青 』のことを指しています。
※水飛…水とともに砥 る
また「紺青」の岩絵具は、藍銅鉱による天然のものを「石紺青 （ウルトラマリンブルー）」、人造のものを「花紺青 （プルシアンブルー）」とし色合いも異なります。
藍銅鉱は鉱物（炭酸塩鉱物）の一種。英名では、「アズライト（azurite）」。
結晶系は単斜晶系。「ブルー・マラカイト」と呼ばれる宝石でもあります。
藍銅鉱は銅の代表的な二次鉱物の1つで、世界各地の銅鉱床の風化帯にて産します。ちなみに、同じ銅の二次鉱物である孔雀石 （マラカイト）も共生することが多いです。
もとは顔料の色である『紺青』ですが、江戸時代には染色名としても使われるようになり、江戸中期の「吉井藤吉染見本帳」などの染見本帳にもその名前が見られるようになりました。染法は『瑠璃紺 』と大略同じですが、より冴えて華やかでです。
藍銅鉱（アズライト）",https://irocore.com/konjou-iro/
紺鼠（こんねず）,"['063', '069', '081']","['30', '15', '00', '80']",#3F4551,"紺鼠（こんねず）とは、わずかに青色がかった暗い鼠色のことです。色名は文字どおり『紺色 』がかった『鼠色 』から。江戸時代に誕生した色で、くすんだ紺色である『紺滅 』よりさらに青みが少なく、渋みが増した色となっています。
江戸の頃は「奢侈禁止令 』がたびたび施行され、派手な色が禁止されたこともあり、鼠色や茶色が「四十八茶百鼠 」として大流行しました。人々はわずかな色の違いに名前を付けて、地味な色を「粋 」に楽しんだのです。
この頃に生まれた鼠色には、色相の違いから派生した『臙脂鼠 』『紅鼠 』『藍鼠 』『銀鼠 』などの他に、地名から派生した『嵯峨鼠 』『深川鼠 』、人名から派生した『小町鼠 』など色も名前もじつにさまざまです。",https://irocore.com/konnezu/
金春色（こんぱるいろ）,"['090', '194', '217']","['65', '00', '15', '00']",#5AC2D9,"金春色（こんぱるいろ）とは、明るい緑みの鮮やかな青色のことです。この色は東京・新橋の“金春新道 ”に置屋のあった芸者が好んで使ったので『金春色』とよばれました。別名は『新橋色』でこちらのほうが一般的です。洋色名は『ターコイズ・ブルー』。
『金春色』は化学染料が輸入されるようになった明治から大正にかけて大流行した色で、藍染にはない明るい青緑色が新鮮で喜ばれ、版画や絵画など広く使われました。
そんなハイカラな色をまっさきに和服に取り入れたのが花柳界の新興勢力であった新橋の芸者達です。きっと、これまでにない『金春色』の艷やかな色合いが受けたのでしょう。
『金春色』が新橋芸者のハイカラをあらわしたものに対し、深川芸者の渋好みを表現した色は『深川鼠 』と呼ばれました。
ちなみに、『金春色』の由来となった金春新道は現在でも銀座の裏通りに“金春通り”として残っており、通りの銘板にはこの色が使われています。
当時は流行の最先端だったこの通りも、現在では江戸情趣 を残す「銀座の最後の砦」と言われており、歴史の面白さを感じますね。",https://irocore.com/konparu-iro/
紺藤（こんふじ）,"['101', '146', '198']","['60', '30', '00', '10']",#6592C6,"紺藤（こんふじ）とは、青みの強い渋い青紫色のことです。古くからの伝統色である『藤色 』を紺がからせた変相色。平安の頃から女性に人気の藤色ですが、その色合いは江戸の女性達も魅了し、『紅藤 』や『藤紫 』『藤鼠 』など様々な変相色が生まれました。さらに、その変相色から『淡紅藤 』のような派生色が生まれるなど、江戸後期には数多くの『藤』を冠する色名が生まれています。
紺藤に似た藤色に『青藤 』がありますが、こちらのほうがより明るく薄い青紫色です。
",https://irocore.com/konfuji/
紺碧（こんぺき）,"['000', '091', '152']","['90', '45', '00', '30']",#005B98,"紺碧（こんぺき）とは、真夏の日差しの強い青空の色のような深く濃い青色のことです。
濃い青色の『紺色 』と強い青緑色の『碧色 』と青を表す文字が繰り返されていることから、「紺碧の空」「紺碧の海」のように濃く美しい青の表現によく使われます。
紺碧は海外では『アジュール（AZURE）』と呼ばれ明るく鮮やか青のことですが、同じように空や海の色にも使われています。またアジュールはもともと宝石の「ラピスラズリ」に由来する色であり、この色が日本に伝わった際に『ラピスラズリ＝紺色の碧＝紺碧』と和訳してできた色名だと思われます。
ちなみに、ラピスラズリの色を意味する伝統色には『瑠璃色 』や、ラピスラズリを粉末にした顔料の『群青色 』などラピスラズリに関する色は他にもみられます。
",https://irocore.com/konpeki/
御所染（ごしょぞめ）,"['231', '184', '194']","['00', '32', '08', '10']",#E7B8C2,"御所染（ごしょぞめ）とは、淡く渋い紅色のことです。寛永年間に東福門院 の女院御所に仕える女官から広まったため、この雅 な名前がつきました。
東福門院とは、“後水尾天皇”の妻“徳川和子 ”のことで、“徳川家康”の孫にあたります。京を中心とした「寛永文化」の中心人物のひとりで、茶道・香道など文芸芸術にすぐれ、後の「寛文小袖」は和子 好みの小袖 が元になったとも言われる才媛です。
宮中にて小袖を着用するようになったのも彼女からで、寛永の宮廷文化形成に欠かせない存在でもあります。手先が器用で、彼女が作った押絵は京都の町衆に大変人気があり、和子の押絵を持つことは１つのステータスでした。
また、着道楽なところもあったようで、御用達の呉服商「雁金屋 」には月間45着もの注文があったとの資料が残されています。
女官たちに自分の衣服を下賜することも多く、そんな女官たちから和子好みが町方に広がり、『御所染』の色もまた広まっていったのでしょう。
余談ですが、この呉服商の「雁金屋」は、琳派の“尾形光琳”・“尾形乾山”兄弟の実家でもあります。
「雁金屋」には東福門院からの800点以上の注文記録が残されていることから、若き光琳も彼女の斬新なデザインの小袖に数多く触れる機会もあったでしょう。
もしかしたら、和子好みの小袖が光琳の感性に少なからず影響を与えたかもしれないと考えると、ある意味、琳派にも影響を与えた人物とも言えそうですね。
貞享3年（一六八一）に刊行の「諸国御ひいなかた」という、当時のファッション誌のような書籍にも「御所方呉服染様 の事」という御所（和子）に関する項目が記載されてることからも分かるように、その感性は当時から注目されていました。
そんな和子好みの『御所染』の色は、彼女のセンスを表すような美しいものとなっています。",https://irocore.com/goshozome/
呉須色（ごすいろ）,"['000', '073', '109']","['80', '20', '00', '60']",#00496D,"呉須色（ごすいろ）とは、深く渋い青色のことです。色名の『呉須』とは陶磁器の染付 に使われる顔料の名前、または焼き物の「呉須焼き」に由来します。
呉須による染付は中国の景徳鎮から日本の伊万里に伝わり、瀬戸や京都など各地で焼かれるようになりました。また、ヨーロッパ方面にも伝わり、ドイツのマイセンで美しい青が開発されることになります。
呉須とは酸化コバルトを主成分とした鉄・マンガンを含む鉱石のこと。陶磁器の染付に使われる呉須はこの鉱石を粉末にしたもの。中国の呉須鉱石の産地名から、日本では“呉須”と呼ばれるようになった。
一般に、呉須で磁器に絵付したものは「染付 」、粗雑な磁器に描かれると「呉須絵 」という。
呉須は高温で焼成することであざやかな青色になりますが、原料の混合率や焼成条件により、その色調が変わるため、『呉須色』もまた色合いに幅があります。
ちなみに、呉須と同じくコバルトを主成分とした顔料に『花紺青 』があります。ただし、こちらは油彩用の顔料です。
古伊万里の鉢
ちなみに、呉須と同じくコバルトを主成分とした顔料に『花紺青 』があります。ただし、こちらは油彩用の顔料です。
古伊万里の鉢",https://irocore.com/gosu-iro/
胡粉色（ごふんいろ）,"['255', '255', '252']","['00', '00', '01', '00']",#FFFFFC,"胡粉色（ごふんいろ）とは、日本画にも使われる白色顔料の「胡粉」の色をさし、ごくわずかに黄みがかった白色のことです。胡粉はイタボガキなどの貝殻を焼いて粉末状にしたもので、下塗りとして発色を良くしたり、他の絵具と混ぜあわせて色調を出すのにも用いられました。
奈良時代は錫を焼いて作る鉛白 や白土 も胡粉として用いられましたが、時間とともに黒ずみ、人体に有害であることから、鎌倉時代には現在のものが用いられるようになったようです。ちなみに、「胡」はかつて中国の西方を意味する呼び名からつきました。",https://irocore.com/gofun-iro/
,,,,,'NoneType' object has no attribute 'text',https://irocore.com/saitaduma-iro/
嵯峨鼠（さがねず）,"['176', '141', '132']","['00', '30', '23', '40']",#B08D84,"嵯峨鼠（さがねず）とは、茶色がかった鼠色のことです。江戸後期に流行した色であり、「四十八茶百鼠」のひとつ。
「嵯峨 」は京都北西に位置する王朝文化ゆかりの地で、桜花の嵐山、紅葉の天龍寺、大覚寺、渡月橋と美しい名刹が多いことでも知られています。この色の上品で穏やかな趣 が「嵯峨」の名を連想させて色名に付けられたのでしょう。

嵯峨鼠は色名に雅な「嵯峨」をつけることで上品なイメージを強調しています。この色の流行は色名をつけた染屋か呉服屋のネーミングセンスの勝利といえるかもしれません。",https://irocore.com/saganezu/
桜色（さくらいろ）,"['254', '238', '237']","['0', '5', '2', '0']",#FEEEED,"桜色（さくらいろ）とは、桜の花弁にイメージされる赤みを含んだ淡い紅色のことです。紅染 めの中で、もっとも淡い色。ほんのり酔った女性の顔や皮膚が赤みをおびた様子にも使われることで知られています。
『桜色』の色名は平安時代より一般化し使われていますが、初出 は『古今和歌集 』の「桜色に衣は深く染めて着む 花の散りなむ後の形見に」です。ただし、もともとは色名のことではなく「桜の色に」と言うべきところを省略して表記したものでしょう。
なお、当時の桜といえば「山桜 」のことで、『桜色』も山桜の花の色に由来しています。
重 ねの色目としては、実物の花色に近く「表・白、裏・赤花」で、赤みをおびた若葉に淡い紅の桜花を表しています。
ちなみに、英語の桜色を意味する『チェリー』は、さくらんぼの果皮の色に由来する濃い赤色であり、日本の伝統色の『桜色』とは全くの別の色です。",https://irocore.com/sakura-iro/
桜鼠（さくらねずみ）,"['216', '98', '188']","['20', '25', '20', '0']",#D8C6BC,桜鼠（さくらねずみ）とは、淡い紅色が灰色あるいは薄墨がかって、わずかにくすんだ薄い桜色のことです。いわゆる墨染（すみぞめ）の桜。色名に鼠が付く色は江戸時代初期頃から見られますが、桜鼠は元禄以降に用いられるようになったのではないかと思われます。ちなみに、名前に｢鼠｣をつけた色は他に｢梅鼠｣があります。,https://irocore.com/sakuranezumi/
錆浅葱（さびあさぎ）,"['092', '146', '145']","['37', '00', '01', '43']",#5C9291,"錆浅葱（さびあさぎ）とは、ややくすんだ浅い緑青色のことです。色名の浅葱 は藍染の浅い染色のことで、「錆」がつくことで基調色である浅葱よりも彩度の低いくすみや沈みのある色を現しています。
江戸時代の文献には「錆浅葱」の染色法や流行は見られませんが、浅葱色が流行した江戸中期に共に流行したのではないかと思われます。",https://irocore.com/sabiasagi/
錆御納戸（さびおなんど）,"['064', '111', '121']","['50', '00', '13', '60']",#406F79,"錆御納戸（さびおなんど）とは、くすんだ深い緑がかった青色のことです。江戸時代の流行色の一つで、単に『錆納戸 』とも。
錆御納戸は『御納戸色 』から派生した色で、「錆」がつくことにより元の色である御納戸色より彩度の低い灰色がかった色であることを表しています。錆御納戸のように「錆」の付く色は、元の色より渋みを増したこともあり「粋」な色として当時の人に大変好まれました。他にも『錆利休 』『錆浅葱 』『錆青磁』『錆桔梗』など「錆」の付く色名がいくつも生まれています。
伝統色では、元の色より灰みでくすんだ色には「錆」、緑がかった色には「鉄」が付きます。ですから、御納戸色が緑がかって少しくすんだ『錆鉄御納戸 』という色もあります。
ちなみに、御納戸色や錆御納戸など色名に「御」がつくのは、御納戸色が江戸城の納戸から始まったとする説に由来しています。そのため謙譲語の「御」がついています。ただし、別の説もあるので、「御」がついていなくても間違いではありません。",https://irocore.com/sabionando/
錆鉄御納戸（さびてつおなんど）,"['072', '088', '089']","['19', '01', '00', '65']",#485859,"錆鉄御納戸（さびてつおなんど）とは、緑みの暗く鈍い青色のことです。錆鉄は錆びた鉄のことでなく、「侘び寂び」に通じ、暗くくすんだという意味がこめられました。納戸色は江戸時代に流行した藍染めの一つで その色が納戸のうす暗い感じに似ているため、また納戸の入り口の垂れ幕に使われていた色からついた色名といわれています。
この染色法は江戸時代の『染物早指南 』（1853）に「錆鉄御納戸。下ぞめ濃花色、かやの中へ、やしやぽっちり、鉄醤、水等分、酸」と記されています。",https://irocore.com/sabitetsuonando/
錆納戸（さびなんど）,"['064', '111', '121']","['50', '00', '13', '60']",#406F79,"錆納戸（さびなんど）とは、くすんだ深い緑がかった青色のことです。別に謙譲語をつけて『錆御納戸 』とも。
錆納戸は江戸時代の流行色の一つで、『納戸色 』から派生した色です。
※より詳しい色の説明は『錆御納戸 』のページをご確認ください。",https://irocore.com/sabinando/
錆利休（さびりきゅう）,"['135', '114', '84']","['00', '20', '40', '60']",#877254,"錆利休（さびりきゅう）とは、くすみのある渋い茶色のことです。『錆利茶 』の別名も。安土桃山時代の茶人“千利休 ”にちなんだ『利休茶』に、暗い赤系顔料の代赭 を加えた色です。色名は侘 び寂 びに通じる「錆 」の字に、さらに「利休」を重ねることでこの色の深みを表現しました。
錆利休は江戸後期に生まれた色名ですが、江戸時代には他にも『利休色』『利休白茶 』『利休鼠 』『利休生壁 』など、「利休」がつく色名が数多く生まれました。",https://irocore.com/sabirikyu/
珊瑚色（さんごいろ）,"['239', '132', '104']","['00', '60', '53', '00']",#EF8468,"珊瑚色（さんごいろ）とは、赤い珊瑚を粉末にした顔料の色で黄みがかった明るい赤色のことです。英名では『コーラル』『コーラル・ピンク』と呼ばれる色。古代中国から伝来した顔料に由来し、赤珊瑚の色を表した色ではありません。
我が国では珊瑚といえば「赤」というのが一般的ですが、顔料の『珊瑚色』は赤珊瑚を細かく砕いて作るため、珊瑚本来の色よりも色みが薄くなります。ただし、『珊瑚色』の中でも宝石の赤い珊瑚に近い鮮やかな紅色の場合は、別に『珊瑚珠 』と呼ばれました。
珊瑚は、クラゲやイソギンチャクの仲間の刺胞動物門花虫綱に属する動物。そのうち固い骨格を発達させて宝石になるものや、サンゴ礁を形成するものなどがいます。珊瑚の宝石は仏教における七宝の一つ。
古くから珊瑚の赤が日本人の黒髪によく映えることから、髪飾りや簪 などの装飾品として珍重されました。もちろん現在でも珊瑚は深く愛好されており、宝石協会では珊瑚を３月の誕生石としています。
日本は世界に認められた珊瑚の主要な産地であり、とくに高知県沖は珊瑚の一大産地として有名です。ちなみに、江戸時代の土佐藩（高知県）内の海底で見つかった宝石珊瑚群は、幕府や他国に漏れないよう厳しく取り締まったという逸話が伝わっています。
珊瑚の中でも最も好まれたのは深く艶やかな紅色で『血赤 』と呼ばれました。ちなみに、欧州では古来淡いピンク色の珊瑚のほうが好まれており、最上級のものは天使の肌に例えられて「エンジェルスキン」と呼ばれています。


珊瑚
珊瑚",https://irocore.com/sango-iro/
珊瑚珠色（さんごしゅいろ）,"['239', '069', '074']","['05', '85', '64', '00']",#EF454A,"珊瑚珠色（さんごしゅいろ）は、宝石の珊瑚の珠玉のような明るく華やかな赤橙色のことです。文字通り珊瑚の珠玉に因 んだ色で、別に『珊瑚朱 』とも表記します。珊瑚の珠玉には、白、桃色、赤の三種があり、中でも深い赤色は『血色 』と呼ばれ珍重されました。

古くから珊瑚の珠玉は、髪飾りや簪 などの装身具や装飾品に加工されましたが、中国の彩色版画絵手本『芥子園画伝 』によると、宋代では印肉に用いたとの記述あり、また唐代の絵画で変色しない紅色は、珊瑚珠を粉末にした顔料が使われていると記されています。その顔料が『珊瑚色 』と呼ばれる色で、後に日本に伝来しました。珊瑚色の中でもとくに色が濃く赤珊瑚に近いような色が『珊瑚珠色』と呼ばれるようになったようです。

また別に、珊瑚珠色は『珊瑚色』の別名であり、同じ色とする説もあります。


珊瑚は、クラゲやイソギンチャクの仲間の刺胞動物門花虫綱に属する動物。そのうち固い骨格を発達させて宝石になるものや、サンゴ礁を形成するものなどがいます。珊瑚の宝石は仏教における七宝の一つ。
古くから珊瑚の赤が日本人の黒髪によく映えることから、髪飾りや簪 などの装飾品として珍重されました。もちろん現在でも珊瑚は深く愛好されており、宝石協会では珊瑚を３月の誕生石としています。
ちなみに、珊瑚珠の初出は江戸後期の風俗・習慣について書かれた随筆『嬉遊笑覧 』。衣装競べの際に珊瑚珠で「南天の実をあらわした」と記されています。",https://irocore.com/sangoshu-iro/
柘榴色（ざくろいろ）,"['201', '046', '054']","['00', '90', '68', '20']",#C92E36,"柘榴色（ざくろいろ）とは、柘榴の果実ような紅みを帯びた深い赤色のことです。または柘榴の花のような鮮やかな橙色を指すこともあります。表記は『石榴色』とも。
現在では、柘榴色といえば柘榴石色（ガーネット）に近い紅赤のイメージが強いと思われますが、日本では古くから果実よりも花にひかれる傾向にあるため、鮮やかな橙色の花の色のほうが本来の柘榴色であったと思われます。
柘榴はザクロ科ザクロ属の落葉小高木。日本には平安時代に渡来しており、『日用本草』などに記述が見られます。また、お釈迦様が子を食らう鬼子母神に与えた果物として有名で、果実に種子が多いことから子孫繁栄の『吉祥果 』とも呼ばれました。縁起の良い果物であり、特に女性の幸運の象徴ということで着物や帯の柄としても人気です。
ちなみに、ことわざ『紅一点』は、中国の詩人「王安石 」が初夏に鮮やかな橙色の花を咲かせ緑の樹木の中で目立つ柘榴の花のさまを『万緑叢中紅一点 』（咏石榴詩）と詩に詠んだことに由来しています。",https://irocore.com/zakuro-iro/
紫苑色（しおんいろ）,"['150', '138', '189']","['45', '45', '00', '05']",#968ABD,"紫苑色（しおんいろ）とは、紫苑の花の色のような少し青みのある薄い紫色のことです。紫苑はキク科シオン属の多年草で、古名を「のし」といい、平安時代には「しおに」とも呼ばれていました。秋には薄紫色の美しい花を咲かせることから、古くからとても愛されており、紫苑色の色名はその可憐な花の色からきています。
紫苑色は、紫根で染めて椿の灰汁で媒染した物。特に紫を賛美した平安期に愛好され、秋に着用されていました。『源氏物語』などの王朝文学にも「紫苑の織物」「紫苑の袿 」「紫苑の指貫」などとたびたび登場します。重 ねの色目 としても秋を表わし、「表・薄色、裏・青」、「表・紫、裏・蘇芳」などの組み合わせがありました。
紫苑の花
紫苑の花",https://irocore.com/shion-iro/
芝翫茶（しかんちゃ）,"['191', '121', '093']","['00', '50', '50', '30']",#BF795D,"芝翫茶（しかんちゃ）とは、ややくすんだ渋い赤茶色のことです。江戸後期の大阪の花形役者、三代目 “中村歌右衛門 ” が好んだ色として当時大流行しました。色名は、歌右衛門の俳名「芝翫 」からで、「芝翫好みの茶」の意味です。なお、「芝翫」の名は、後に「中村芝翫」として、歌舞伎の名跡のひとつとなっています。
芝翫は幅広い芸風から希代の名役者として知られていましたが、小柄で平凡な容姿であったために「歌舞伎通好み」とも評されていました。彼の俳名を冠した芝翫茶もまた女性の小袖などにはあまり用いられず、通好みの色とされていたようです。
江戸時代の染色技法の指南書『手鑑模様節用 』に、「芝翫茶」は『栗梅 』と『遠州茶 』の中間の色として紹介されており、刈安 と棗 の実を使い、灰汁媒染 で染められました。
江戸時代当時の歌舞伎役者の人気は凄まじく、彼らが舞台で使った衣裳や持ち物、色などを、人々はすぐに真似をしたので流行となっていました。
近世風俗志『守貞漫稿 』によれば、文化・文政・天保（一八◯四~四三）にかけて歌舞伎役者に因 んだ「役者色」が流行したと記されており、江戸では『路考茶 』『梅幸茶 』が、京阪では『芝翫茶』『璃寛茶 』がそれぞれ流行しています。
芝翫から出た流行は、「芝翫茶」のほか「芝翫香」など、化粧品、薬品、食べ物にまで及んでおり、四筋に鐶つなぎを配した柄で「四鐶縞 」というのがありますが、芝翫がこの柄を好んだことから、四鐶が芝翫に通じるとして「芝翫縞 」とも呼ばれました。
このように芝翫は一人の歌舞伎役者でありながらが、当時の文化に多大な影響を与えています。",https://irocore.com/shikancha/
市紅茶（しこうちゃ）,"['136', '123', '062']","['00', '09', '60', '60']",#887B3E,"市紅茶（しこうちゃ）とは、媚茶色 より明るい、深く渋い萌黄色 のことです。
色名は江戸後期の歌舞伎役者“市川團蔵 （五代目）”に由来しています。市川團蔵は上方（大阪）時代に“市紅 ”の俳名を名乗っており、その市紅が愛好した色から『市紅茶』と呼ばれるようになりました。
市紅茶は四十八茶百鼠 にも数えられる当時の人気色の一つで、江戸後期の近世風俗志『守貞漫稿 』でも「京阪の芝翫茶 、璃寛茶 、市紅茶。江戸の路考茶 、梅幸茶 」の五色の役者色を文化・文政・天保頃の流行色として紹介しています。
市紅茶は、通好みの渋い演技から「渋團 」と評された“市紅”のイメージに違わぬ渋い色合いだからこそ、市井 の人の心をとらえて色名として残ったのでしょう。",https://irocore.com/shikocha/
紫紺（しこん）,"['064', '011', '054']","['50', '90', '20', '50']",#400B36,"紫紺（しこん）とは、紺色がかった暗めの紫色のことです。紫草の根 で染めていたことから「紫根」と書かれていました。「紫紺」は明治以降に使われた色名です。
天皇即位の礼の幡 で用いられましたが、現代でも「紫紺の優勝旗」と言われるように、この色は尊ばれています。
ちなみに、紫紺と同類の色に、濃い茄子 の実の色にたとえられた「茄子紺」があり、大正時代に流行しました。",https://irocore.com/shikon/
至極色（しごくいろ）,"['045', '004', '037']","['30', '60', '00', '90']",#2D0425,"至極色（しごくいろ）とは、極めて黒に近い深い赤紫色のことです。『深紫 』の別名。
飛鳥時代の持統朝の頃には『黒紫』とも表記され、より黒に近いとの説もあります。
冠位十二階が定められた頃より『紫』は最上の色でした。そんな紫色の中でも『深紫』は別格で、天皇、皇太子を別にすれば、臣下の最も官位を極めた「極官 」のみが着用を許された色であり、そこから『至極色』と呼ばれるようになったようです。
紫みを濃くするために高価な『紫根 』をふんだんに使った贅沢な色といえるでしょう。",https://irocore.com/shigoku-iro/
宍色（ししいろ）,"['239', '171', '147']","['00', '28', '38', '06']",#EFAB93,宍色（ししいろ）とは、人間の肌色のような浅い黄みがかった赤色のことです。日本人の肌色はうすい黄赤系と黄み橙系に大別されますが、宍色は前者にあたります。ちなみに色名の宍は肉の古語で、宍色とは獣の肉の色という意味です。『和名類聚抄』にも「肉、和名之々、肌膚之肉也」とあります。,https://irocore.com/shishi-iro/
紫檀色（したんいろ）,"['107', '21', '53']","['00', '80', '20', '70']",#6A1435,"紫檀色（したんいろ）とは、紫檀の材のような深く暗い赤みの紫色のことです。
紫檀とはインド、スリランカ原産のマメ科の常緑高木で、日本では『鉄刀木 』、『黒檀 』とともに唐木三大銘木の一つ。
材にかすかなバラの芳香が漂うことから、西洋では『ローズウッド』とよばれます。
紫檀は堅く緻密 で耐久性に優れていることから、高級家具材として愛好され貴族や王室の家具として使用されました。
正倉院御物の『螺鈿紫檀五絃琵琶 』などが有名。
年月をかけて磨いた紫檀の銘木の、美しい紫みを帯びた色からできた色名。ただし、古い時代には色名としては見られないので、明治以降にローズウッドの名が伝わり和訳した際にできた色名だと思われます。",https://irocore.com/shitan-iro/
漆黒（しっこく）,"['008', '000', '000']","['45', '45', '45', '100']",#080000,漆黒（しっこく）とは、黒漆 を塗った漆器のような深く艶のある黒色のことです。純粋な黒。『純白』の対義語。黒の中でも最も暗い色の意として使われることが多く、暗く濃密な闇を「漆黒の闇」、真っ黒で艶のある髪を「漆黒の髪」というように黒の情緒的な表現方法としても用いられています。おもに現代になってから黒の雰囲気を描写する際に使われるようになった色名です。,https://irocore.com/sikkoku/
東雲色（しののめいろ）,"['241', '144', '114']","['00', '40', '53', '05']",#F19072,東雲色（しののめいろ）とは、夜が明け始めるころ太陽で白み始める東の空を思わせる明るい黄赤色のことです。曙色とも呼ばれます。東雲は現在でいう、網戸の網目にあたるものを、篠笹（しのざさ）で作っていたので、「篠の目（しののめ）」といったそうです。東の雲が薄いピンクに染まり、真っ暗な室内に「篠の目」から明かりが差し込んだことから、“東雲色”を「しののめいろ」と呼ぶようになったようです。,https://irocore.com/shinonome-iro/
赤銅色（しゃくどういろ）,"['126', '015', '009']","['0', '90', '79', '60']",#7E0F09,"赤銅色（しゃくどういろ）とは、金属の赤銅のような艶のある暗い赤色のことです。混同されがちですが『銅色 』とは異なる色であり、一般的に真っ黒に日焼けした肌の色を表現する際に使われます。
『赤胴』は銅に少量の金を加えた合金で、我が国では奈良の大仏鋳造の資材帳に記載が見られるなど古くから使われている金属であり、烏金 、紫金 とも呼ばれました。",https://irocore.com/shakudo-iro/
洒落柿（しゃれがき）,"['247', '189', '143']","['00', '23', '42', '03']",#F7BD8F,洒落柿（しゃれがき）とは、柿色を洗い晒したような淡い柿色のことです。元禄期頃に「晒柿（されがき）」をもじって「洒落柿」となりました。この語呂のよさも江戸っ子の好みに合ったと思われます。洗柿よりも淡い柿色で、薄柿よりもやや濃い色を指します。,https://irocore.com/sharegaki/
朱殷（しゅあん）,"['116', '010', '000']","['0', '90', '90', '65']",#740A00,"朱殷（しゅあん）とは、時間がたった血のような暗い朱色のことです。血の色や血染めの色など、凄惨 な様子を表現する色として使われてきました。
例えば、“源頼朝”の墓所である法華堂跡の碑文にはこう記されています。
と。
この碑文では、北条軍に破れた“三浦泰村 ”が、一族郎党 五百人とともにこの地で自刃し、庭一面が血染めに染まった惨憺 たる様子を『朱殷』に染まったと表現されています。
暗く染まった朱色『朱殷』は、明るく美しい元の色との差異により、見事に「悲惨さ」「凄惨さ」を表現した色と言えるでしょう。",https://irocore.com/shuan/
朱色（しゅいろ）,"['235', '097', '001']","['00', '59', '100', '08']",#EF454A,朱色（しゅいろ）は、黄を帯びた鮮やか赤色のことです。一般に、朱肉のような少し黄色がかった赤のことを指します。朱色は、縄文時代からあったもっとも古い色のひとつで、貝塚などからこの色をあしらった土器や土偶なども見つかっています。天然産のものは辰砂から精製されますが、硫化水銀を主成分とする無機朱色顔料から作り出されたものは、区別して「銀朱」と呼びます。,https://irocore.com/shu-iro/
猩々緋（しょうじょうひ）,"['231', '000', '029']","['05', '100', '90', '00']",#E7001D,猩猩緋（しょうじょうひ）とは、緋の中でも特に強い黄みがかった朱色のことです。室町時代後期からの南蛮貿易により舶載された毛織物のうち、とくに羅紗（らしゃ）に多く見られました。猩々とは、龍や麒麟などと同じく中国の伝説上の生き物で、人に似た顔、子供のような声、鮮やかな赤い体毛を持ち、体つきは犬や猿に似ています。その血はとても赤いとされ、そこから猩々緋という色名が誕生しました。古くから珍重れた色で、特に戦国時代、武士達は羅紗や天鵞絨（びろうど）を陣羽織に仕立てさせ、戦場での意匠を競っていました。,https://irocore.com/shojohi/
白藍（しらあい）,"['212', '236', '238']","['20', '00', '08', '00']",#D4ECEE,"白藍（しらあい）とは、藍染 の中で最も薄い色で、黄みを含んだ淡い水色のことです。「しろきあい」とも読まれる古くからある色名で、平安時代の『延喜式 』にもその名がみられます。
縫殿寮 の項によれば、藍染による藍色は濃い色から順に『濃藍』『中藍』『浅藍』『白藍』の四段階に区分されており、白藍は一番薄い色で「藍 小半圍に黄檗  七両」で染められていました。
『藍白 』と名前は似ていますが別色であり、藍白よりも濃い色になります。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/shiraai/
白茶（しらちゃ）,"['218', '196', '165']","['20', '25', '40', '00']",#DAC4A5,白茶（しらちゃ）とは、薄くて明るい感じの茶色のことです。色あせて白っぽくなることを白茶けるといいます。江戸時代の元禄中期は比較的濃い茶色系が流行しましたが、「煤竹廃れて白茶起こり」とあるように、文化・文政期に入ると薄い茶系が茶人や数寄者が好む粋な色として流行しました。明治に入ると女性の着物にも多く用いられる色となっています。,https://irocore.com/shiracha/
白百合色（しらゆりいろ）,"['253', '252', '245']","['00', '00', '05', '02']",#FDFCF5,"白百合色（しらゆりいろ）とは、白百合の花のようなわずかに黄色みの白色のことです。
古くからの伝統色ではなく、明治期以降に西洋から伝わった色名『リリー・ホワイト』の訳語です。
リリー・ホワイトの色は14世紀初めからの色名で、聖母マリアのシンボルである白百合を象徴とした「純潔」や「処女性」のイメージを引き継ぎ、透き通るような白い肌の意味などによく使われる色です。
ちなみに、白百合色の色合いを古くからの日本の伝統色で言えば『卯の花色 』が最も近いといえるでしょう。",https://irocore.com/shirayuri-iro/
白（しろ）,"['255', '255', '253']","['00', '00', '01', '00']",#FFFFFD,"白（しろ）とは、日本の色名の中でも最古のものの一つで、光のすべてを反射する物の人間が知覚する表面に見える色のことです。
『白』は無彩色で、黒の対語であり、色を区別するための最初の言葉として使われました。最古の歴史書『古事記』でも、『黒』『赤』『青』とならんで『白』が登場しています。
古代の日本人にとって、白は純真無垢 で潔白を表し、神事に関係ある神聖な色として特別な存在でした。この伝統は現在に至るも変わっていません。
また近代においても武士の切腹時の白装束や、喪服の色が『白』であるように、『白』はそれだけ神聖で清らかな禁忌の色だったのです。
そのため、特別な場合をのぞき、あまり『白』の衣服を身につけませんでした。
白い衣服が一般的になったのは西洋文化を取り入れた明治以降です。喪の色も徐々に黒に変わっていきました。",https://irocore.com/shiro/
白菫色（しろすみれいろ）,"['233', '234', '245']","['10', '08', '00', '00']",#E9EAF5,"白菫色（しろすみれいろ）とは、白菫の花のようなほとんど白に近い紫色のことです。　菫の花は万葉の頃より愛された草花ですが、『菫色 』が一般色名になるのは明治以降。そんな『菫色』を薄くしたような『白菫色』は、さらに近代になってできた色名です。
白菫色のような明るい『紫色』は昔から人気で、現在でも女性の着物の色などとして大変好まれています。
ちなみに同じような色の薄い紫色としては『霞色 』があります",https://irocore.com/shirosumire-iro/
白橡（しろつるばみ）,"['203', '185', '148']","['00', '09', '27', '20']",#CBB994,白橡（しろつるばみ）とは、橡で染めた白茶色に近い色のことで、鈍色(にびいろ)の薄いものです。青白橡と赤白橡の2種があります。橡とはドングリの古名で、柏、楢、樫などブナ科の木の実を指しており、この橡を煎じて染めた黒茶の衣類は、古来から身分の低いものの衣服や喪服としてのみ使われてきました。『正倉院古文書』にも多く出てくる色名です。,https://irocore.com/shirotsurubami/
白鼠（しろねずみ）,"['220', '221', '221']","['00', '00', '00', '13']",#E6E6E6,"白鼠（しろねずみ）とは、銀の色のように上品な明るい鼠色 のことです。『銀色 』とは同色。江戸中期からの色名で、語尾を省略して「しろねず」とも呼ばれました。墨の濃淡を示す『墨の五彩 』の中では、焦、濃、重、淡、清の中の一番淡い「清」にあたる色です。なお、五彩の他の色としては『銀鼠 』『素鼠 』『丼鼠 』『黒鼠 』があります。
白鼠の染法について、特に記されたものはありません。ただし、染色名としては江戸中期の『紺屋伊三郎染見本帳』に見られ、鼠染 を最も淡くなるように加減して染めた色のようです。ちなみに、鼠色の染法は『諸色手染草』に、「茄子の木をやき炭となし、よくすりて木にてのべ、ごまめの汁少し入染てよし、但し酢にてとき染れば艶ありて色もよし」と記されています。",https://irocore.com/shironezumi/
白練（しろねり）,"['252', '250', '242']","['00', '03', '11', '00']",#FCFAF2,白練（しろねり）とは、真っ白い練絹のような白色のことです。生絹 の黄みを消し去る技法を「白練」と呼び、その白練した光沢のある絹の純白を色名にしたものです。古代から神聖さを象徴する色として用いられ、近年では清潔で高貴な色として愛用されました。,https://irocore.com/shironeri/
白縹（しろはなだ）,"['223', '242', '252']","['15', '00', '00', '00']",#DFF2FC,"白縹（しろはなだ）とは、縹色系統の中でもっとも淡い、青みを含んだ白色のことです。古くから見られる色名で、別に「しろきはなだ」とも。『蟹鳥染 』『白青 』は同色。
『縹色 』は古くから知られた藍染の一種で、『浅葱色 』と『藍色 』の中間にあたります。
平安時代の格式『延喜式 』によれば縹色は四段階に区別されており、濃い順に『深縹 』『中縹 』『次縹 』『浅縹 』とあり、さらに別の項に浅縹より薄い色として『白縹』が紹介されています。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/shirohanada/
真紅（しんく）,"['173', '0', '45']","['00', '100', '63', '35']",#AD002D,"真紅（しんく）とは、深みのある真っ赤な紅色のことです。『韓紅 』とは同色で、別に『深紅 』とも表記します。現在では「真紅の花びら」などのように「真っ赤」と同じ意味でも使われます。
古来より紅色は多くの人々を魅了した色ですが、紅花がとても高価であったため、真紅のような濃い紅色は『禁色 』とされていました。真紅という名前は、茜や蘇芳などの混ざり物がない、正真正銘の紅花による染め色であることが強調された色名となっています。",https://irocore.com/shinku-2/
深紅（しんく）,"['173', '0', '45']","['00', '100', '63', '35']",#AD002D,"深紅（しんく）とは、深みのある真っ赤な紅色のことです。古くは「ふかきくれない」「こきくれない」「こきべに」とも読まれ、別に『真紅 』とも表記します。『韓紅 』は同色。現在では「深紅の花びら」などのように「真っ赤」と同じ意味でも使われます。
古来より紅色は多くの人々を魅了した色ですが、紅花がとても高価であったため、深紅のような濃い紅色は『禁色 』とされていました。深紅という名前は、茜や蘇芳などの混ざり物がない、正真正銘の紅花による染め色であることが強調された色名となっています。",https://irocore.com/shinku/
真朱（しんしゅ）,"['215', '052', '029']","['00', '90', '90', '10']",#D9341D,"真朱（しんしゅ）とは、少し黒みのある鈍い赤色のことです。『朱 』は硫化水銀鉱物から作られる「朱丹 」を元にした天然の赤色顔料で、我が国では縄文時代から発掘されており『万葉集』にもその名がみられます。朱丹の良質な物を「朱砂 」、中国湖南省辰州でとれる最上の物は『辰砂 』という別名でも呼ばれました。
奈良時代には赤土の赭 に対し、『真朱 』とも呼ばれ、純度が高いことを表現しています。
色名に「真」の字が付いているのは「混じりもののない自然のままの朱である」という意味からです。逆に、硫黄などを合成した人工的な『朱色』は色合いがより鮮やかなこともあり、『銀朱 』として区別されました。",https://irocore.com/shinshu/
新橋色（しんばしいろ）,"['090', '194', '217']","['65', '00', '15', '00']",#5AC2D9,新橋色（しんばしいろ）とは、明るい緑がかった浅鮮やかな青色のことです。明治中期に輸入され、ハイカラな色として大正時代にかけて大流行しました。この色名の「新橋」は、東京の新橋のことで、当時は実業界や政治家が訪れる振興の花柳界であり、その新橋の芸者衆に愛好された色ということでこう呼ばれるようになりました。また、芸者の置屋が金春新道にあったことから「金春色」とも呼ばれ、鏑木清方や上村松園などの美人画に用いられた色としても知られています。ちなみに、洋色名はターコイズ・ブルー。,https://irocore.com/shinbashi-iro/
深碧（しんぺき）,"['000', '094', '021']","['75', '00', '100', '60']",#005E15,"深碧（しんぺき）とは、宝石の緑碧玉 の色のような力強く深い緑色のことです。色名の「碧 」とは「碧玉 」を意味し、碧玉に由来する『碧色 』よりも濃い緑色をしています。
ちなみに、「緑碧玉」とは宝石の「グリーンジャスパー」の和名です。
碧玉は不純物が多く混じった石英の結晶。混ざっている不純物の違いにより青・赤・緑・紫・黄褐色と様々な色があることから、古代より曲玉・首飾りなどの装飾品として用いられてきました。
我が国では出雲の「玉造石 」、佐渡の「赤玉」、津軽の「錦石 」の一部が碧玉に当たります。また、三月の誕生石であるブラッド・ストーンも碧玉の一つ。
「碧」が付く伝統色には他に『青碧 』『紺碧 』『紅碧 』などがありますが、どれも碧色の石の色に由来する色名です。",https://irocore.com/shinpeki/
純白（じゅんぱく）,"['255', '255', '255']","['00', '00', '00', '00']",#FFFFFF,"純白（じゅんぱく）とは、全く混じりけのない完全な白色のことです。『真白 』と同色。
純白とは、もともと色名ではなく「汚 れがなく清らかな心。そのさま」のことであり、その言葉の出典は古代中国の『荘子 』まで遡ります。
色名として使われるようになったのは近年。「純白」という言葉の清廉潔白 なイメージから真っ白の呼称となり、近代文学などでよく見かけるようになりました。
和色の中には『月白 』『胡粉 』『乳白色』『銀白色』『卯の花色 』など白を表す様々な色名がありますが、中でも『純白』は白さを表す他に「純白のウェディングドレス」のように「清らかさ」の意味も込めて使われています。",https://irocore.com/junpaku/
甚三紅（じんざもみ）,"['210', '63', '64']","['00', '85', '64', '15']",#D23F40,"甚三紅（じんざもみ）とは、蘇芳による紅染めの代用染で黄みがかった紅色のことです。江戸初期の承応年間（1652-1655）、紅花を使わずに『紅梅色 』の絹布を染めだした京の「桔梗屋甚三郎 」が色名の由来です。『甚三紅絹 』との表記も。
江戸時代も華やかな紅赤系の色は人気でしたが、紅花をつかった紅染はとても高価であったため、幕府によって度々 禁制になっていました。それに対し、蘇芳を使った甚三紅は安価に染められることから、禁制にされることがなく、庶民達の愛好色として広まっていきました。",https://irocore.com/jinzamomi/
翠色（すいしょく）,"['000', '126', '102']","['100', '00', '63', '30']",#007E66,"翠色（すいしょく）とは、翡翠 の羽色のような鮮やかな緑色のことです。「みどりいろ」「みどり」とも読まれます。別名は『翠緑 』。
カワセミの羽色に由来するため、緑、緑青、紫がかった青と幅広い色相を差します。
『翠色』は「翠色冷光 」の四字熟語からもわかるように、中国では古くから『緑』を表す色でした。ただ、日本では古来より『緑』を形容する色が豊富にあったためか近代になるまで一般的には広まっていません。
※翠色冷光：月の光り。または、冷たい青い光のこと。（出典：竜鳳録）
『翠色』が日本で一般的になったのは明治以降で、知識人たちが『緑色』を形容する言葉として好んで用いたことから広まったようです。
カワセミ（翡翠）はブッポウソウ目カワセミ科の水辺に生息する小鳥。羽色が鮮やかで長いくちばしが特徴。その美しさから「飛ぶ宝石」とも呼ばれる。
古名はソニドリ（翠鳥）。オスを「翡」、メスを「翠」という。
カワセミに「翡翠」の字があてられたのは室町時代以降で中国からの伝来。
ちなみに、宝石のヒスイ（翡翠）もカワセミの色に似ていることから「翡翠」の字が当てられるようになりました。『翠色』も同じくカワセミに由来する色であり、そういった意味では「ヒスイの色」とも言えそうです。


翡翠（カワセミ）
翡翠（カワセミ）",https://irocore.com/suishoku/
蘇芳（すおう）,"['126', '38', '57']","['52', '86', '63', '0']",#7E2639,蘇芳（すおう）とは、黒みを帯びた赤色のことで、『蘇方色』『蘇枋色』とも書きます。蘇芳とは染料となる植物の名前で、蘇芳の芯にある色素を明礬（みょうばん）や灰汁を使って発色させたものです。明礬焙煎では赤に、灰汁で赤紫に、鉄では暗紫になります。今昔物語では凝固しかけた血液の表現にも使われています。江戸時代には紅花や紫に代わって染色に用いられたため、『偽紅 』や『似紫 』とも呼ばれました。,https://irocore.com/suo/
蘇芳香（すおうこう）,"['178', '062', '082']","['40', '90', '65', '00']",#B23E52,蘇芳香（すおうこう）とは、蘇芳の赤に黄を加えた紅みのある褐色のことです。蘇芳香の染色は本来は蘇芳と丁子（ちょうじ）を用いたものですが、香染の材料の丁子が高価なため、一般には丁子の代わりに黄の染料を用いています。蘇芳香の襲の色目としてはその代用染の色によったもので、「表・蘇芳、裏・黄」と本来の染色より華やかなものになっています。,https://irocore.com/suoko/
煤竹色（すすたけいろ）,"['112', '086', '074']","['00', '30', '30', '72']",#70564A,煤竹色（すすたけいろ）とは、囲炉裏（いろり）や竈（かまど）の煙に燻されてすすけて古色を帯びた竹の色のような暗い茶褐色のことです。江戸時代中期以降に登場した若竹色、青竹色に先んじて室町時代頃に登場し、江戸時代に通好みの色として愛用されました。｢銀煤竹｣、｢藤煤竹｣、｢伽羅煤竹｣、｢南京煤竹｣と、変相色も現れるなど小袖や羽織り、帯色に使われるなど広く流行した色です。,https://irocore.com/susutake-iro/
錫色（すずいろ）,"['158', '161', '163']","['03', '01', '00', '36']",#9EA1A3,"錫色（すずいろ）とは、無彩色の銀色に近い明るい鼠色のことです。錫は銀白色の金属。『手鑑模様節用』の色譜に、「錫色。又当世ぎん鼠といふ」とあるように『銀鼠 』は別名。また、『薄雲鼠』『絹鼠』『銀灰色』といった色名も同色です。
天皇が二親等以内の親族の服喪の際に着用する袍を錫紵 といわれるように、錫色は鈍色の高級な表現となっています。",https://irocore.com/suzu-iro/
雀色（すずめいろ）,"['134', '67', '55']","['0', '50', '59', '47']",#864337,雀色（すずめいろ）とは、雀の頭のような赤黒い茶色のことです。雀頭（じゃくとう）色ともいいます。雀が人の住む地域を好む身近な鳥であるためか、植物の名が多い色名のなか、江戸時代に登場したとされています。茶色系統は当時の流行色で、空が雀色に染まる夕暮れのころを「雀色時」と呼んでいました。また、江戸中期ごろの褐色系の流行色を総称して「雀の羽色」とも呼んでいました。,https://irocore.com/suzumeiro/
雀茶（すずめちゃ）,"['149', '064', '057']","['00', '70', '53', '50']",#954039,"雀茶（すずめちゃ）とは、雀の頭の色のような赤黒い茶色のことです。その名のとおり、雀 の頭部の羽の色に由来する『茶色 』で、同じく雀の羽の色に由来する『雀色 』とは同色です。ただし、『雀色』のほうが淡く赤みがかっているという説もあり、染め色としてその境界は曖昧となっています。
江戸時代には「四十八茶百鼠 」として茶色系と鼠色系の色が大流行したため、『樺色 』と『樺茶 』のように古来からの色名に『茶 』をつけて呼びなおしたり、色相的には茶色でも鼠色でもない『梅鼠 』のような色にまで『鼠』『茶』をつけるほどでした。『雀茶』もこの頃に誕生した色だと思われます。
ただ、『雀茶』の染色に関する記述が江戸時代の文献に見当たらないため、色名が一般的に使われるようになったのは明治以降からでしょう。",https://irocore.com/suzumecha/
素鼠（すねずみ）,"['115', '115', '115']","['00', '00', '00', '55']",#737373,素鼠（すねずみ）とは、他の色味を含まない鼠色のことです。「墨の五彩」、濃、焦、重、淡、清の「重」に当たる中明度の無彩色です。「鼠」は江戸時代後期には「四十八茶百鼠」と呼ばるように、さまざまな変相色を持ち人気がありました。素鼠はその鼠系統の代表色。ちなみに「素」とは混じりけのないという意味で素顔や素肌と同じ使い方です。灰色と同色視されがちですが、厳密にいえば素鼠は青みを、灰色は黄みを含みます。,https://irocore.com/sunezumi/
墨色（すみいろ）,"['000', '010', '002']","['90', '80', '85', '80']",#000A02,墨色（すみいろ）とは、「墨の五彩」、濃、焦、重、淡、清の焦にあたる黒に近い灰黒色のことです。書画に用いられる墨は、菜種油や松を燃やしてできた良質の煤（すす）を膠（にかわ）で練り香料を加えて固めたものです。染色は、墨を使うだけでなく、橡の樹木や檳榔子など、時代によってさまざまな素材が使われました。墨色は古来から僧侶の常服の色や凶事を表す色でしたが、近代に入ると装飾として普及していきました。,https://irocore.com/sumi-iro/
菫色（すみれいろ）,"['112', '101', '163']","['70', '70', '00', '00']",#7065A3,菫色（すみれいろ）とは、菫の花の色からきた色名でやや青みの濃い紫色のことです。菫の花は万葉の時代から愛されており、その色名も平安時代から使われていましたが、明治期に改めて流行しました。欧文における菫色の訳語の「バイオレット」のハイカラな響きが若い女性の心を捉えたようです。当時の浪漫主義文学の与謝野晶子らは星や菫によせて恋などを詠うので「星菫 派詩人」と呼ばれたりしました。,https://irocore.com/sumire-iro/
青漆（せいしつ）,"['024', '066', '018']","['60', '00', '80', '80']",#184212,"青漆（せいしつ）とは、深く渋い緑色のことです。青漆は本来 漆 の色塗りの一種で、藍草から取り出した藍蝋 などを加えた漆、または黒漆 に黄漆 を混ぜて作られる緑色を呈する漆のこと。青が付きますが味わい深い、濃い緑色の漆器になります。その漆器の色がいつしか伝統色として定着しました。江戸時代の近世風俗志『守貞漫稿 』には、合羽 の色に青漆が使われていることが紹介されています。
漆の色塗りは、一般的に黒、朱、洗朱 、緑、黄などありますが、黒以外は飴色 がかった透き漆をベースに顔料を混ぜてつくるので、どれも濃い目の色合いになります。",https://irocore.com/seishitsu/
青磁色（せいじいろ）,"['126', '190', '165']","['55', '10', '42', '00']",#7EBEA5,"青磁色（せいじいろ）とは、青磁の肌の色のような浅い青緑色のことです。青磁は青緑色の釉薬 を掛けた磁器 の一種で、釉薬に含まれる鉄分により独特の灰みを帯びた青緑色になります。中国では古くから焼かれていて、宋代には優れたものがいくつも作られました。
『源氏物語』では「あおじ」と呼ばれており、じつは「せいじ」と呼ばれるようになったのは明治以降からです。また青磁の色は神秘的な美しさであることから『秘色 』とも呼ばれました。",https://irocore.com/seiji-iro/
青白磁（せいはくじ）,"['235', '244', '244']","['08', '00', '04', '03']",#EBF4F4,"青白磁（せいはくじ）とは、雲がかすむ春の空のような、うすく淡い青緑色のことです。その名のとおり焼き物の「青白磁 」の青みを帯びた美しい肌色に由来しています。
もともとは色合いの例えとして「青白磁のような色」として使われていたものが、そのまま色名となりました。ちなみに、色名として定着したのは近代から。
青白磁とは焼き物の白磁 の一種で、とくに釉薬 が文様の溝にたまってかすかに青緑色に見えるものを呼びます。別称『影青 』。十一世紀の北宋年間に中国の景徳鎮 で作られた名品は、日本では大名家 などで大変に珍重されました。
焼き物に由来する色は『青白磁』の他にも、『白磁色』『青磁色 』『秘色 』『織部 』などありますが、いずれも透明感と深みのある美しい色合いとなっています。",https://irocore.com/seihakuji/
青碧（せいへき）,"['071', '131', '132']","['46', '01', '00', '48']",#478384,"青碧（せいへき）とは、鈍い青緑色のことです。色名は古代中国の玉石「青碧」に由来する服飾の「青碧」からきています。僧尼の衣色として用いらていました。
",https://irocore.com/seiheki/
青藍（せいらん）,"['000', '085', '143']","['100', '38', '0', '40']",#00558F,"青藍（せいらん）とは、紫みを含んだ暗い青色のことです。藍染による『藍色 』の中でも彩度が高い色で、明治以降の新しい色名になります。
近世まで「藍」が付く色は『深藍色 』のような「緑系」の色を指しており、現在のような色を指すようになったのは江戸中期以降です。この頃より青系の顔料が安価で使えるようになったこともあり、“安藤広重 ”など当時の浮世絵師が好んで使うようになりました。そのため青系の「藍色」が急速に広まっていったのです。
ちなみに、青藍の色名は江戸時代まではなく、明治時代の近代文学で見られるようになった色名です。当時の知識人たちが「青みの鮮やかな藍色」を形容した「青藍」が、そのまま色名に定着したものでしょう。
色としては『紺青 』に近いですが、青藍のほうが少し暗く、なんともいえない物悲しさを感じさせます。そういったところを文豪たちは表現したかったのかもしれません。
そういった意味で『青藍』は文豪が発明した色とも言えそうです。",https://irocore.com/seiran/
赤褐色（せっかっしょく）,"['104', '063', '054']","['00', '39', '48', '59']",#683F36,赤褐色（せっかっしょく）とは、赤みを帯びた褐色のことです。 茶色とは少し色合いが違います。蘇芳の染料を用いて、香色をまねて染めた色です。,https://irocore.com/sekkashoku/
仙斎茶（せんさいちゃ）,"['071', '075', '066']","['05', '00', '12', '71']",#474B42,"仙斎茶（せんさいちゃ）とは、松の葉の色の『千歳緑 』を茶色がからせたような緑みの渋い茶色のことです。「千歳茶」「千才茶」とも書きます。
「手鑑模様節用 」には「せんさい茶」として「むくの実染めにいろおなじ、当世さわらび色ト号 」と紹介されおり、『蕨色 』と同色と紹介されています。
『仙斎茶』は江戸の流行色として、文政（一八一八〜一八三○）の頃には京阪の女性の羽織によく染められた色でした。",https://irocore.com/sensaicha/
千歳茶（せんざいちゃ）,"['072', '073', '063']","['58', '43', '52', '34']",#48493F,千歳茶（せんざいちゃ）とは、千歳緑を茶色がからせた暗い緑褐色のことで、「千哉」「千才」「仙斎」とも書かれます。江戸時代には「四十八茶百鼠」といわれたように、様々な中間色が出揃いましたが、媚茶などと同じく千歳茶のような黄緑系の渋い中間色も茶と呼ばれていました。文政の頃には、婦人の紬の紋付に用いられたほか、男子の木綿にも使われていたようです。,https://irocore.com/senzaicha/
煎茶色（せんちゃいろ）,"['140', '100', '080']","['00', '29', '43', '45']",#8C6450,煎茶色（せんちゃいろ）とは、煎茶のような濃い茶褐色のことです。煎茶というと緑色を想像すると思いますが、本来は煎ったものなので、茶色のものになります。この色は煎じたお茶で染めたので煎じ茶染ともいいます。『手鑑模様節用』には「せん茶いろ　愚案に、苦茶と書きてしぶ茶とよみきたれば、官服にもちゆるにがいろは、此いろなるべきか」と記されています。,https://irocore.com/sencha-iro/
鮮緑（せんりょく）,"['108', '187', '090']","['60', '00', '80', '08']",#6CBB5A,"鮮緑（せんりょく）とは、その名のとおり鮮やかな緑色のことです。黒みがなく、純色 に近い色。ちなみに、「純色」とは赤・青・黄・緑などの各色相において、もっとも彩度の高い色のことをいいます。
鮮緑のあざやかな緑の色合いは、新鮮で力強く若さを感じさせる色です。",https://irocore.com/senryoku/
蒼色（そうしょく）,"['0', '118', '85']","['90', '00', '68', '40']",#007655,"蒼色（そうしょく）とは、干した青草のような少し暗い青緑色のことです。色の由来は「蒼」という漢字の成り立ちどおり、「倉 」の屋根に青草を使っていたことから。別に「あおいろ」とも読まれますが、系統的には『緑色』の系統です。
蒼色は「蒼顔 」や「顔面蒼白」という言葉があるように、顔に対して使う場合、色味よりも青白い顔や顔色が悪い様子を表す言葉として使われます。また、蒼には草木が覆い茂るという意味もあり、生い茂る木々や緑深い山を形容する場合にも使われました。
ちなみに、「蒼天」「蒼空」「蒼海」のような青に関連する言葉も多いためか、現代では『青色』の変わりに使われることも多いようです。",https://irocore.com/soushoku/
宗伝唐茶（そうでんからちゃ）,"['161', '109', '093']","['00', '32', '42', '37']",#A16D5D,宗伝唐茶（そうでんからちゃ）とは、唐茶より少し黒みを帯びた茶褐色のことです。江戸初期の京の染師、鶴屋宗伝が染め始めたことから名付けられた色名です。江戸後期の『手鑑模様節用』新古染色考説では宗伝唐茶と樺茶を同色と見て天和のころ流行したと記されています。,https://irocore.com/sodenkaracha/
承和色（そがいろ）,"['243', '244', '127']","['0', '0', '47', '7']",#F3F47F,"承和色（そがいろ）は、菊の花の色のような少しくすんだ黄色のことです。
平安時代の承和 年間（八三四〜八四八）、時の帝“仁明天皇 ”が黄色い菊を大変好まれたことにちなんだ色になります。なお「そが」は「じょうわ」から転じた読み方であり、そのまま「じょうわいろ」と読むこともあります。
仁明天皇は京都に都を移した桓武天皇の孫に当たり、漢学・書・文学を収めた当代屈指の知識人でした。また前述のとおり、ことのほか黄色い菊を愛でられ、宮中の随所にこの花を植え、衣装も黄色にしたと伝わっています。
『承和色』は仁明天皇の愛した菊の色あいを表現した美しい色といえるでしょう。
黄色の菊",https://irocore.com/soga-iro/
蘇比（そひ）,"['251', '160', '039']","['00', '50', '90', '00']",#FBA027,蘇比（そひ）とは、黄みのにぶい明るい橙色のことです。緋色と同じく茜染めの一種ですが、緋色よりも淡く、色の淡さから、『衣服令』では緋の三級下においています。もともと、中国の染「蘇比」を和名に読み替え、濃度を淡くした茜染めのことです。中国では染める回数によって茜染の名を変え、漢代では三染した濃い赤色を蘇比と呼びますが、それに対して日本の蘇比は、一染か二染程度の濃さです。,https://irocore.com/refreshedred-brown/
纁（そひ）,"['224', '129', '094']","['00', '42', '58', '12']",#E0815E,纁（そひ）とは、茜と灰汁媒染によってよって染められた明るい赤橙色のことです。おなじ茜染の緋色よりも少し薄く、奈良時代の服色の序列では緋色より下の位階の色になります。中国から伝わった色名で、「蘇比」という漢字が当てられることもあります。また鳥の「そび（カワセミの古名）」の腹毛の色に似ていたため名付けられという記録もあります。現代では馴染みの薄い色名ですが、和菓子などに用いられます。,https://irocore.com/sohi/
赭（そほ）,"['202', '072', '041']","['00', '80', '80', '20']",#CA4829,"赭（そほ）とは、赤土のような黄みを帯びた少し暗い赤色のことです。赤土を焼いて得られた赤色の顔料で、縄文時代から見られるもっとも古い色のひとつ。別に『赭土 』や『朱 』とも呼ばれていました。ちなみに、「赭」はそのものズバリ、赤土（赭土 とも）のことです。
赭に名前が似ている『真赭 』という色もありますが、真赭は『真朱 』の別名であり「純度が高い」「混じりけがない」という意味で「真」の字が当てられていました。
また、 『代赭 』という赤褐色の顔料もありますが、こちらは中国山西省の代県から産する赤土が有名であったことから、この名が付きました。",https://irocore.com/soho/
空色（そらいろ）,"['115', '184', '226']","['60', '15', '00', '00']",#73B8E2,"空色（そらいろ）とは、昼間の晴れた空を思わせる紫みの薄い明るい青色のことです。「天」とかいて「そら」と読んだり、『真空色 』『空天色 』『碧天 』とも書かれました。中国明代の科学技術書「天工開物」には『天青色』とあり、その染色は藍の淡染の上に蘇芳水をかけることが記されています。ちなみに『天色』と書いた場合、「そらいろ」と読むと空色と同じ色を指しますが、「あまいろ」と読むともう少し青みが濃い鮮やかな色を指します。
空色は古くから用いられてきた色名ですが、明治・大正になってから文学作品に好んで使われるようになり、より幅広く使われるようになりました。",https://irocore.com/sora-iro/
空色鼠（そらいろねず）,"['184', '200', '209']","['15', '00', '00', '25']",#B8C8D1,"空色鼠（そらいろねず）とは、薄曇りの空のような青みを含んだ明るい灰色のことです。『そらいろねずみ』とも。江戸後期に流行した『鼠色 』の一種で、うすく曇った天気のわずかに明るい空模様を見事に表現した“粋 ”な色になります。
ちなみに、江戸後期に流行した『鼠色』は、江戸中期に流行した茶色系統の色と合わせて『四十八茶百鼠 』と呼ばれました。特に鼠系の色は現代でいうところの“クール”な色として若者に人気があったようです。
空色鼠と同じ青系統の鼠色としては、『湊鼠 』『水色鼠 』『京鼠 』などがあります。",https://irocore.com/soraironezu/
代赭色（たいしゃいろ）,"['179', '108', '060']","['40', '70', '85', '00']",#B36C3C,代赭色（たいしゃいろ）とは、代赭石に似た、褐色を帯びた黄色または赤色のことです。赤土は別名「赭（そほ）」ともいい、中国代州で産出する赤土が有名だったことからこの名がつきました。近代になって布地の染色にも使われるようになりました。,https://irocore.com/taisha-iro/
玉子色（たまごいろ）,"['255', '223', '133']","['00', '16', '60', '00']",#FFDF85,玉子色（たまごいろ）は、卵黄を模した明るい黄色のことです。江戸時代前期から見られる染め色で、寛政年間の流行歌「はたおり唄」や西鶴の「好色一代女」などにも記述がみられ、当時の流行色だったことがわかります。ちなみに、卵にちなんだ色には、平安時代から存在する「鳥の子色」がありましたが、こちらは卵殻のような薄黄色でした。,https://irocore.com/tamago-iro/
淡黄（たんこう）,"['248', '229', '140']","['00', '08', '44', '03']",#F8E58C,"淡黄（たんこう）とは、その名のとおり淡い 色合いの黄色のことです。古くからある伝統色名で、平安時代の重 の表地の色としても用いられていました。
淡黄は「夏目漱石」が『草枕』の中で、木蓮の花を「あたたかみのある淡黄」と例えているように、純粋な黄色よりもわずかに赤みを含んだ優しいイメージの色です。",https://irocore.com/tankou/
淡紅色（たんこうしょく）,"['250', '220', '233']","['0', '20', '00', '00']",#FADCE9,"淡紅色（たんこうしょく）とは、紅色に白を混ぜたような淡い紅色のことです。もともとは紅花による薄い紅染めを指していましたが、後に染料に関係なく薄い紅色全般を指すようになりました。ちなみに『退紅 』『桜色』などはすべて淡紅色に含まれます。
古代において紅花染めは色が濃くなるほど高額であり、濃い紅色は『禁色 』として身分の高いものしか着用できませんでした。そのため、身分の低い者は『淡紅色』のような薄い紅染めのみしか着用が許されず、そういった色を『聴色 』や『一斤染 』と呼び色名をつけて区別しています。
同じ読みの色に『淡黄 』という色がありますが、こちらは淡い黄色のことです。",https://irocore.com/tankoushoku/
胆礬色（たんばいろ）,"['000', '125', '122']","['80', '00', '40', '40']",#007D7A,"胆礬色（たんばいろ）とは、深く渋い青緑色のことです。ちなみに、胆礬 とは銅の硫酸塩鉱物でる青い半透明の結晶体のこと。石炭を掘った坑道の壁から発見されました。
歌舞伎では恐怖で青くなった顔色の形容にも使われています。",https://irocore.com/tanba-iro/
蒲公英色（たんぽぽいろ）,"['255', '226', '000']","['00', '10', '95', '00']",#FFE200,"蒲公英色（たんぽぽいろ）とは、蒲公英 の花に由来する鮮やかな黄色のことです。蒲公英はキク科タンポポ属の総称で、日本の春を代表する草花の一つ。古名を「ふじな」または「たな」と呼ばれ、平安初期の『本草和名 』にもその名が見られます。　江戸時代には『鼓草 』と呼ばれており観賞用の他、食用にもされていました。ちなみに「たんぽぽ」の名は室町末期の『言継卿記 』が初出典。
色名としては比較的新しく近代から。蒲公英には白い花を咲かせる品種もありますが、『蒲公英色』といえば春らしい暖かさを感じさせる黄色を指しています。
",https://irocore.com/tanpopo-iro/
橙色（だいだいいろ）,"['238', '120', '000']","['00', '50', '100', '07']",#EE7800,"橙色（だいだいいろ）とは、熟れた橙 の果皮のような鮮やかな黄赤色のことです。色名が生まれたのは比較的に新しく明治以降から。『蜜柑色 』は同色で、ほとんど区別されていません。
『赤』と『黄色』の中間色にあたり、英語の『オレンジ』に対応する色になります。
ちなみに、橙がつく色には『赤橙 』という色もあります。

橙の実
橙の実",https://irocore.com/daidai-iro/
団十郎茶（だんじゅうろうちゃ）,"['159', '086', '058']","['00', '46', '64', '38']",#9F563A,"団十郎茶（だんじゅうろうちゃ）とは、江戸時代の歌舞伎役者「市川團十郎」が代々用いた成田屋の茶色のことで、赤みのうすい茶色です。ベンガラと柿渋で染めたことから柿渋色、または柿色ともいいます。荒事の芸を確立した五代目市川團十郎が『暫』でこの柿色の素襖をまとってからは「團十郎茶」とも呼ばれるようになったと言われており、現代でも襲名披露の口上などで団十郎がこの色の裃かみしもをつけることでも知られています。
歌舞伎役者の名を冠した色名には「芝翫茶（しかんちゃ）」もあります。こちらは三代目中村歌右衛門が好んで用いた茶色のことで、歌右衛門の俳名が「芝翫」であることから、この名がつきました。",https://irocore.com/danjurocha/
千草色（ちぐさいろ）,"['058', '143', '183']","['83', '31', '17', '00']",#3A8FB7,千草色（ちぐさいろ）とは、わずかに緑みを帯びた明るい青色のことです。色名の千草とは鴨頭草 から転訛した名で露草のこと。藍染による浅葱色と花色の間の色調で、多くは重ね染の下地色として用いられました。 江戸時代の染色指南書『手鑑模様節用』には「京師にてそらいろを ちくさいろといふ」とあり、主に近畿地方で使われていと思われます。ただし、厳密には空色は千草色より少し明るく、かすかに紫みを含んだ色です。,https://irocore.com/chigusa-iro/
千歳緑（ちとせみどり）,"['051', '087', '025']","['81', '55', '100', '15']",#335719,"千歳緑（ちとせみどり）とは、松の葉の緑のような濃く暗い緑色のことです。
別に「せんざいみどり」「せんざいりょく」とも読まれます。
不老不死や縁起の良さを表す常盤（ときわ）の松という表現があるように、四季の移ろいの中でいつも変わらぬ緑の葉をつける松は、長寿と不変の象徴でした。
千歳緑は、それにあやかり千年の後も変わらない緑の意を示す縁起の良い色名です。
藍と刈安のかけあわせで染められたものと思われます。
ちなみに、千歳緑の派生色として『千歳茶 』『仙斎茶 』があります。",https://irocore.com/chitosemidori/
茶色（ちゃいろ）,"['150', '080', '066']","['00', '47', '56', '41']",#965042,茶色（ちゃいろ）とは、茶の葉で染めた色という意味ですが、黄と赤と黒の中間色で栗の実のような色のことです。暗い灰黄赤色全般をさし、濃度、色相の幅が広いです。語尾に付けてそれぞれの呈色をあらわし、赤茶、金茶、白茶、青茶をはじめ、鶸茶、鶯茶、煤竹茶、丁子茶、海松茶、媚茶、桑茶、葡萄茶、小豆茶、利休茶など、実に７０種ほどの色相の変化があります。江戸時代には『四十八茶百鼠』として茶色系統が大流行しました。,https://irocore.com/cha-iro/
茶褐色（ちゃかっしょく）,"['102', '064', '050']","['00', '37', '51', '60']",#664032,茶褐色（ちゃかっしょく）とは、やや黒みを帯びた濃い茶色のことで、茶系を表す一般的な色名です。『褐色 』といえば濃い紺色をさす場合もありますが、「褐」とは葛の茎で作った茶色い繊維のことなので、本来の褐色とは茶色であったと考えられます。戦国時代、青系統色の「褐色」が『勝色 』として流行したことから、茶色の「褐色」は、茶道の流行に伴い「茶褐色」と呼ばれるようになりました。,https://irocore.com/chakasshoku/
長春色（ちょうしゅんいろ）,"['216', '139', '131']","['17', '61', '46', '0']",#D88B83,"長春色（ちょうしゅんいろ）とは、灰色がかった鈍い紅色のことです。長春とは本来は常春 の意味ですが、古く中国から渡来した「庚申薔薇」の漢名「長春花」からきており、この薔薇の花が色名の由来です。
この色が流行したのは大正時代のことで、落ち着いた色合いから女性たちの人気を集めました。英名では「オールドローズ」とも。
ちなみに、薔薇は中国などから渡来し平安時代には「そうび」と呼ばれ、観賞用として貴族たちに愛好されました。「長春花」は鎌倉時代の歌人“藤原定家”の日記『明月記』の健保二年（一二一四）の１２月の項にその名前が見られますが、色名としては近代の色になります。",https://irocore.com/choshun-iro/
丁子色（ちょうじいろ）,"['239', '205', '154']","['00', '14', '36', '06']",#EFCD9A,"丁子色（ちょうじいろ）とは、鈍い黄赤のことです。

香辛料の丁子の蕾の煮汁で染めた丁子色は、古代から用いられていた色の一つです。
丁子はフトモモ科の常緑高木で、蕾を乾燥させたものを「丁子」「丁香」といい、昔から香料や染料に使われていました。
丁子色の少し茶がかったものを『丁子茶 』といいますが、その色にほとんど差はありません。香色の一つです。

",https://irocore.com/choji-iro/
丁子染（ちょうじぞめ）,"['221', '184', '126']","['05', '20', '40', '08']",#DDB87E,丁子染（ちょうじぞめ）とは、丁子の蕾の煮汁で染めた染め物の色で黄みの暗い褐色のことです。「香染」「濃き香」「こがれ香」とも呼ばれます。媒染剤を用いずに染めると、白茶に近い色になり、「淡き香」「香色」と呼ばれます。いずれも落ち着いた色調で、染めてしばらくは色に丁子の香りが伴います。ただし丁子は香木として高価だったため、一般には紅花と支子による代用染が行われました。,https://irocore.com/chojizome/
,,,,,'NoneType' object has no attribute 'text',https://irocore.com/chojicha/
鴨頭草（つきくさ）,"['104', '165', '218']","['63', '23', '00', '00']",#68a5da,"鴨頭草（つきくさ）とは、友禅染の下絵に用いられていた青花紙の濃い青色のことです。鴨頭草とは露草（つゆくさ）の古名であり、この草の花弁の色素を得ることからこの名がつきました。花の絞り汁の色素を布に移すので「移し色」ともいわれ、また褪色しやすいことをかけて人の移心を表し、和歌にもよく詠われました。
襲の色としては、「表・縹、裏・淡縹」を配し、野原に生える可憐な青い花を模している色目です。",https://irocore.com/tsukikusa/
次縹（つぎはなだ）,"['000', '141', '189']","['80', '00', '00', '30']",#008DBD,"次縹（つぎはなだ）とは、古代の藍染 めの色名で渋い青色のことです。万葉の頃からの色で、別に「つぎのはなだ」「つぐはなだ」とも読まれます。
平安時代は蓼藍 だけで染めた色は『縹 』と呼ばれており、『次縹』は『中縹 』より明るく、『浅縹 』よりは濃い色でした。ちなみに、当時の『藍色 』は、蓼藍に刈安 で染められるため、現在でいう『緑』に近い色です。
『次縹』の染料は「帛一疋 につき、藍四囲」で染めるとされました。なお、『中縹』の染料が藍五囲、『浅縹』の染料が藍半囲なので、二色の中間といっても色合い的にかなり『中縹』に近い色になります。
※帛 は白色の厚手の絹。一疋 は二反 分の長さで22ｍ前後。
※囲 は草の束を数える単位。
平安時代の格式「延喜式 」では、藍染めの色（＝縹色）を濃い順に『深縹 』『中縹』『次縹』『浅縹』の4つに分けていましたが、近世以降、藍染めの色は同じく濃い順で『紺 』『藍 』『縹 』『浅葱 』と呼ぶようになりました。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/tsugihanada/
躑躅色（つつじいろ）,"['224', '044', '135']","['00', '90', '00', '05']",#E02C87,"躑躅色（つつじいろ）とは、赤い躑躅の花のような、鮮やかな赤紫色のことです。躑躅色は、平安時代からその名前がみられる古くからの伝統色。躑躅の花には、白、赤、黄、紫など様々な色がありますが、一般的に躑躅の花の色といえばこの赤紫色を指します。
重 ねの色目でもあり、「表・蘇芳 、裏・萌黄 」、または「表・紅梅 、裏・青」を配し、春から初夏にかけてのもとのされました。ちなみに、“清少納言” は『枕草子』の中で、躑躅色は冬の下襲 に良いと記しています。
「下襲は、冬は躑躅、桜。掻練襲 。蘇芳襲 。夏は二藍 、白襲 。」（枕草子）

躑躅（つつじ）

躑躅（つつじ）とはツツジ科の植物、またはツツジ属の植物の総称です。常緑低木で、4月から5月頃に漏斗型の特徴的な形の花を開花させます。春の季語。

我が国では、躑躅は山野や丘陵に自生しており、古くから観賞用として庭園などで栽培されるなど、親しまれてきました。現在でも庭の彩りによく植えられています。



躑躅色は日本の伝統色の中でも、『牡丹色 』とともに赤紫系の代表といえるでしょう。


サツキツツジの花

",https://irocore.com/tutuji-iro/
壺菫（つぼすみれ）,"['132', '055', '121']","['40', '80', '00', '30']",#843779,"壺菫（つぼすみれ）とは、ツボスミレの花の花芯部のような渋く濃い紅紫色のことです。
もとは万葉時代の重 ねの色目に由来した色で、色目は「表・紫、裏・淡青 」で春の野に咲くツボスミレの様子を表した配色でした。（出典：薄色模様）
ちなみに、着用時期は早春の二月。
「牧野 新日本植物図鑑」によれば「ツボスミレ」は本来は庭に植えるスミレの総称で、花の形が墨壺 に似ているからつけられたのではないかとあります。
花色は白で上弁は反り返り、花弁には紫の筋が入るが、筋の濃さには個体差がある。壺菫の花は春から夏まで咲きつづけ、その花形は菫 に比して小さい。
ちなみに、名前のツボ（坪）とは庭のことで、庭に生えるスミレとの意。重ねの色目になったように古くからの名である。
『壺菫』の名前は『枕草子』を始めとした平安文学や和歌にも多く詠まれていますが、基本的には花そのものを指すばかりで色としては登場していません。
『壺菫』は赤紫の系統ですが、菫の色を表す『菫色』は青紫の系統になっています。

ツボスミレの花
ツボスミレの花",https://irocore.com/tubosumire/
露草色（つゆくさいろ）,"['113', '164', '217']","['60', '23', '00', '00']",#71A4D9,"露草色（つゆくさいろ）とは、早朝に咲く露草 の花にちなんだ明るい薄青色のことです。露草はツユクサ科の一年草で、日本各地の路傍や小川のほとりに群生しています。花や葉の汁を布に摺りつけて染めたことから、古名を『着き草』と呼ばれ、『月草』『鴨頭草』とも書かれました。万葉の時代には摺染 に。また簡単に脱色できる特性から、現在でも友禅や紋染の下絵作業に用いられています。ちなみに、色が落ちやすい特性から、露草は「うつろう」「消える」などに掛かる枕詞 となりました。
平安時代の襲の色目としては、「表・縹、裏・薄縹」で秋に着用された色目です。
露草
露草",https://irocore.com/tsuyukusa-iro/
鉄御納戸（てつおなんど）,"['069', '087', '101']","['68', '42', '34', '19']",#455765,"鉄御納戸（てつおなんど）とは、その名の通り鉄色を帯びた御納戸色で、暗い緑みの青色のことです。
染色法は『染物早指南 』（嘉永6年・1853）に「下ぞめ空色、やしや、水、等分、丸かね、色つけ、酢」とあり、江戸時代はもちろん、明治初期の染見本帳にもその色名がよく見られます。
江戸時代の常用色として広く用いられたようですが、流行の記事は見当たりません。",https://irocore.com/tetsuonando/
鉄紺（てつこん）,"['000', '049', '073']","['85', '00', '00', '85']",#003149,"鉄紺（てつこん）とは、『鉄色 』がかった『紺色 』で、わずかに緑みを帯びた暗い青色のことです。
紺色は藍染 めを繰り返して染められる色であり、江戸時代には最も日常的で需要の高い色でした。それは染物屋 の総称が『紺屋 』と呼ばれることからもうかがい知ることができます。
藍染めは染めるほどにやや紫みを帯びてくることもあり、紫みの強い紺色は別に『紫紺 』や『茄子紺 』と呼ばれました。逆に紫みの少ない緑みの紺色に「鉄」という装飾をつけて区別されたのが『紺鉄』です。鉄紺は平安の頃の『濃藍 』に近い色の濃さになります。
鉄色と紺色の中間に『紺鉄 』という色もありますが、紺鉄のほうが少し明るい色です。
ちなみに、お正月の箱根駅伝で有名な東洋大学陸上部の用いる襷 の色が『鉄紺』です。
（参考：東洋大学陸上競技部公式ホームページ）",https://irocore.com/tetsukon/
照柿（てりがき）,"['248', '146', '100']","['00', '58', '65', '00']",#F89264,照柿（てりがき）とは、赤みがかった濃い橙色で、熟した柿の皮の色に似ています。柿のつく色名には、照柿のように柿の実の色からきているものと、柿渋の色からきているものがあり、それぞれ色調が異なります。ちなみに、この照柿の色が薄いものを洗柿（あらいがき）といいます。,https://irocore.com/terigaki/
藤黄（とうおう）,"['247', '193', '020']","['00', '22', '92', '02']",#F7C114,藤黄（とうおう）とは、ほのかに冴えた黄色のことです。草雌黄(くさしおう)という植物から採取できる顔料「藤黄」の色にちなんでいます。この色の歴史は古く、奈良時代の文献に「同黄(とうおう)」・「銅黄(どうおう)」として呼び名が記載されています。江戸時代には友禅染で欠かせない顔料として、明治時代では日本画や洋画の絵の具としもて広く使われました。,https://irocore.com/too/
玉蜀黍色（とうもろこしいろ）,"['238', '195', '098']","['00', '18', '59', '07']",#EEC362,"玉蜀黍色（とうもろこしいろ）とは、とうもろこしの実の色のような温かみのある浅い黄色のことです。別名「もろこしいろ」とも呼ばれ、江戸中期の風俗誌によれば安永・天明(一七七二-八九)の頃に流行したようです。
染色法について詳しくは判りませんが、揚梅皮 と明礬 によって染めることができます。
とうもろこしはイネ科の一年草で南アメリカ原産。コロンブスによってヨーロッパに伝えられ世界中に広がりました。日本には天正七年（一五七九）にポルトガル人によって長崎にもたらされています。",https://irocore.com/toumorokoshi-iro/
鴇浅葱（ときあさぎ）,"['184', '136', '132']","['00', '26', '28', '28']",#B88884,鴇浅葱（ときあさぎ）とは、やや灰色がかった紅色で、長春色よりさらに薄い色のことです。鴇色がかった浅黄色という意味からついた名称と思われます。江戸時代の染色指南書『手鑑模様節用』には「みずがき、俗にとき浅葱」と注記があるように、色相は水柿（みずがき）と同じ紅みの赤色のことです。両色名は染色上では同じ色ですが、異なる色名となっています。,https://irocore.com/tokiasagi/
鴇色（ときいろ）,"['243', '166', '150']","['00', '45', '34', '0']",#F3A696,"鴇色（ときいろ）とは、鴇 の風切羽のような黄みがかった淡く優しい桃色のことです。『朱鷺色 』とも記され、あるいは『鴇羽色 』とも呼ばれました。江戸時代の染色見本帳によっては『時色』の表記もありますが、これは借字。染色は紅花や蘇芳 により染められていたようです。
似た色に『洗朱 』『浅緋 』『珊瑚色 』等があり、黄みをふくむ緋色の系統といえます。
鴇はペリカン目トキ科の鳥で、学名は「ニッポニア・ニッポン」。『朱鷺 』の字を当てる場合もあります。全身は白っぽいのですが、翼の下面や風切羽が朱色がかった濃いピンク色をしており、この色が『鴇色』とよばれました。日本では古くから知られており、『日本書紀』『万葉集』にもその名が記されています。
鴇色は江戸時代からの色名ですが、当時は鴇 がいたるところで見られたので、鴇色はだれにでも通じる一般的な色でした。また女性の和服の色としても人気があったようです。
ちなみに、『鴇色』や『鶯色 』『雀色 』のような鳥や動物からの色名が広く使われるようになったのが江戸時代からで、それまではあまり存在しませんでした。

トキ（鴇）
トキ（鴇）",https://irocore.com/tokiiro/
朱鷺色（ときいろ）,"['243', '166', '150']","['04', '45', '34', '0']",#F3A696,"朱鷺色（ときいろ）とは、少し黄みがかった淡くやさしい桃色のことです。『鴇色 』とも記され、紅花や蘇芳 で染められました。
色名は江戸時代に生まれましたが、この当時は朱鷺 がいたるところにみられたので、『朱鷺色』といえばだれでもすぐに分かるようなとても一般的な色であり、着物の染め色として若い女性に好まれたようです。
朱鷺はペリカン目トキ科の鳥で、学名は「ニッポニア・ニッポン」。日本では古くから知られており、『日本書紀』『万葉集』にもその名が見られます。全身は白っぽいのですが、翼の下面や風切羽が朱色がかった濃いピンク色をしており、この羽の色が『朱鷺色」とよばれました。
似た色に『洗朱 』『浅緋 』『珊瑚色 』等があり、黄みをふくむ緋色の系統といえます。

トキ（朱鷺）
トキ（朱鷺）",https://irocore.com/toki-iro/
ときがら茶（ときがらちゃ）,"['224', '158', '135']","['00', '29', '40', '12']",#E09E87,ときがら茶とは、少しだけ茶色がかった桃色。つまり鴇色（ときいろ）がかった浅い茶色のことです。江戸時代後期頃に現れた色名で、お洒落心に富んだ愛らしい色です。,https://irocore.com/tokigaracha/
鴇羽色（ときはいろ）,"['245', '166', '163']","['0', '50', '30', '0']",#F49E95,"鴇羽色（ときはいろ）とは、トキの風切羽の色のことです。黄色がかった薄い桃色の淡紅色で朱鷺色とも表記します。
江戸時代の染色指南書である『手鑑模様節用』には、「とき羽色一名志ののめいろ」とあり、東雲色と同色とされているようです。特に若い女性の小袖の地色として、現代も好んで使われています。",https://irocore.com/tokiha-iro/
常磐色（ときわいろ）,"['000', '100', '040']","['100', '00', '100', '50']",#006428,"常磐色（ときわいろ）とは、松や杉などの常緑樹の葉の色のように茶みを含んだ濃い緑色のことです。『常盤色』とも書きます。
「常磐」とは常に変わらないことを指す言葉で、「千歳緑 」と同様に緑を讃え、長寿と繁栄の願いが込められた色名です。
『常磐色』は江戸時代には縁起の良い吉祥の色として好まれました。",https://irocore.com/tokiwa-iro/
木賊色（とくさいろ）,"['34', '130', '93']","['70', '00', '61', '40']",#22825D,"木賊色（とくさいろ）とは、木賊 の茎のような青みがかった濃い緑色のことです。別名を『陰萌黄 』とも。鎌倉以前からある伝統色名で、『宇治拾遺物語 』『義経記 』などにもその名が登場します。落ち着いた渋い緑が中世の武家や年配者の衣装として好まれ、江戸中期には流行色となりました。平安時代の重 ねの色目 としては、「表・黒青、裏・白」、「表・萌黄 、裏・白」などがあります。
木賊はシダ類の常緑多年草で、茎は固くざらついているため、乾燥させて木工細工や刃などを砥いだり磨いたりするのに用いられました。そのことから「砥草」とも。また秋に刈り取って使ったことから『木賊刈る』は秋の季語となっています。
木賊
木賊",https://irocore.com/tokusa-iro/
砥粉色（とのこいろ）,"['244', '221', '165']","['00', '09', '32', '04']",#F4DDA5,"砥粉色（とのこいろ）とは、赤みの鈍い黄色です。その名のとおり砥石 で刃物を研いだ時に出る砥石の粉「砥粉 」に由来する色名です。
砥粉は刀剣類を磨く際はもちろん、白木の化粧や漆器の下塗りに使われるなど、日常生活の中でも身近なものでした。また、現代でも役者が顔のシワを隠すための厚化粧の下地にも使われいます。そんな身近な砥粉に因 んだ砥粉色は、その色合いのように親しみやすい色といえるでしょう。
砥石は、金属などを切削、研磨するための道具です。砥石の歴史は古く、我が国では縄文時代の遺跡から石器とともに砥石が出土しており、石を研ぐために使われていたことが分かっています。律令時代においては、兵士が準備すべき道具の一つでした。
日本で採掘される砥石は極めて良質で、今でも世界各地に輸出されています。この良質な砥石とともに高度な研ぎの技術が発達し、これにより日本刀のような硬度の高い刃物を製作する事が可能になりました。また、江戸時代には“本阿弥家 ”のように、代々受け継がれる刀剣研磨専門職が生まれています。",https://irocore.com/tonoko-iro/
礪茶（とのちゃ）,"['159', '111', '085']","['00', '30', '47', '38']",#9F6F55,礪茶（とのちゃ）とは、赤黒い茶色のことです。江戸時代の染め色の名で、刃物の研磨に用いる粗い目の砥石の色にちなんでいます。この染め色は江戸前期から広く普及しており、井原西鶴の『好色一代男』にもその名がみられます。,https://irocore.com/tonocha/
殿茶（とのちゃ）,"['132', '161', '168']","['30', '00', '08', '40']",#84a1a8,"殿茶（とのちゃ）とは、灰みがかった青緑色のことです。『沈香茶 』の別表記。
「当世御めしなんどの、うすいろなるを殿茶といひ出したる事、殿の響きより御召のうらぎぬと、案をつけたるまでにて、べつにしさいなし。一とう通用の名にはあらず」手鑑模様節用",https://irocore.com/tonocha3/
沈香茶（とのちゃ）,"['132', '161', '168']","['30', '00', '08', '40']",#84a1a8,"沈香茶（とのちゃ）とは、灰みがかった青緑色のことで、別に『殿茶 』とも表記します。殿茶の名は『御染物聞書日記』（元禄元／一六八八）に「殿茶小紋 」と見えているように、古くから行われた染色です。
「当世御めしなんどの、うすいろなるを殿茶といひ出したる事、殿の響きより御召のうらぎぬと、案をつけたるまでにて、べつにしさいなし。一とう通用の名にはあらず」手鑑模様節用
なお、沈香茶は香木で染めた色ではありませんが、実際に香木で染めた『伽羅色』という伝統色もありますが、香木を使って染めるため非常に高価で贅沢な色です。
江戸時代に「とのちゃ」と呼ばれる色名には、他に「礪茶 」がありますが、こちらは茶系統で全く違う色合いです。

香りの伯林堂：マレ－シア 沈香木
香りの伯林堂：マレ－シア 沈香木",https://irocore.com/tonocha2/
鳶色（とびいろ）,"['122', '056', '015']","['69', '90', '100', '00']",#7A380F,鳶色（とびいろ）とは、猛禽・トビの羽毛の色のような赤暗い茶褐色のことです。江戸初期より「茶色」を代表する色として、男性を中心に愛用されてきましたが、実際のトビの羽色より少し赤みが強いです。,https://irocore.com/tobi-iro/
鳥の子色（とりのこいろ）,"['248', '238', '209']","['00', '05', '20', '05']",#F8EED1,"鳥の子色（とりのこいろ）とは、赤みがかったごく淡い黄色のことです。鎌倉時代からの色で、色名の「鳥の子」とは鶏 の雛 ではなく玉子を指し、その殻の色に由来しました。なお、『玉子色 』という名の伝統色もありますが、こちらは殻の色ではなく黄身に由来する明るい黄色のことです。
平安時代の重 ねの色目 には『鳥の子襲』という名があり、「表・塋色 、裏・蘇芳 」が配され、老人の衣装に使うとされていました。",https://irocore.com/torinoko-iro/
丼鼠（どぶねずみ）,"['089', '084', '085']","['00', '06', '04', '65']",#595455,丼鼠（どぶねずみ）とは、溝鼠（どぶねずみ）の毛色に似た素鼠よりやや暗い鼠色です。色名で「どぶ」の字は本来「溝」とも書きますが、不潔な印象を避けるためか「丼」の字があてられることが多いようです。「墨の五彩」、焦、重、濃、淡、清の中では「濃」にあたる色であり、江戸時代中期頃の常用色であったと思われます。,https://irocore.com/dobunezumi/
苗色（なえいろ）,"['176', '202', '113']","['13', '00', '44', '21']",#B0CA71,"苗色（なえいろ）とは、稲の苗のような少し淡い黄緑色です。『淡萌黄 』（薄萌木 ）の別名。夏の色として平安時代から使われてきました。
平安時代の有職故実の書「助無智秘抄 」にも「苗色トハ黄気アル青物也」と記されている。
また重ねの装束としても用いられ、その色目は「表・薄青、裏・黄」（薄様色目）などがあり、表裏の裂を合わせると『淡萌黄』となります。（出典：薄色模様）
萌葱色は藍と黄蘗 をかけた染色ですが、苗色は青白橡 や麹塵 と同様に紫と刈安 をかけた染色になります。
苗色は天皇の側に仕える人々の服色に用いられました。
ちなみに若苗色は苗色よりも少し青みの明るい色のようです。",https://irocore.com/naeiro/
中紅花（なかくれない）,"['238', '134', '154']","['00', '60', '20', '00']",#EE869A,"中紅花（なかくれない）とは、明るい薄みの紅色のことです。平安時代の式目『延喜式 』にもその名が記された由緒ある伝統色。「なかのくれない」とも読まれます。
紅花 だけで染められた薄い紅色で、濃い紅花染めの『韓紅 』と、淡い紅花染めの『退紅 』との中間の色にあたります。
単に『中紅』とも書かれますが、これを「なかべに」と読むと、江戸前期以降の鬱金 などで黄みを加えた紅色の『中紅 』を指し、まったくの別の色になるので注意が必要です。
ちなみに、『紅』は古代では「くれない」と読んでいましたが、「べに」と読んで色名になるのは江戸時代からです。",https://irocore.com/nakakurenai/
中縹（なかはなだ）,"['000', '079', '128']","['100', '30', '00', '50']",#004F80,"中縹（なかはなだ）とは、古代の藍染 めの色名で少し暗い青色のことです。『深縹 』より明るい色で、さらに明るいのが『次縹 』になります。
古くは単に『縹 』と呼ぶ場合、この『中縹』を指していました。
平安時代の格式『延喜式 』では、藍染めの色（＝縹色）を濃い順に『深縹』『中縹』『次縹』『浅縹 』の4つに分けていましたが、近世以降、藍染めの色は同じく濃い順で『紺 』『藍 』『縹』『浅葱 』と呼ぶようになったこともあり、『縹色』の色合いも『次縹』に近い色となっています。
『中縹』の染料は「綾一疋につき、藍七囲、薪九十斤」とされ、藍だけで染めた色です。
※綾 は無地染めの綾織りの絹。一疋 は二反 分の長さで22ｍ前後。
※囲 は草の束を数える単位。
※一斤は約600g。両は1/16斤で約37.3g。
書籍やサイトによっては、『中縹』を『縹色』と同色と説明している場合もありますが、平安時代と現在での『縹色』の認識が違いますので、色合いを勘違いしないよう注意してください。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/nakahanada/
中紅（なかべに）,"['235', '097', '089']","['00', '75', '56', '00']",#EB6159,"中紅（なかべに）とは、紅花 から作られる片紅 で染めた、黄みが強い紅色のことです。江戸前期の色名。紅花を揉んで振り出す染の手法から「なかもみ」「ちゅうもみ」とも。
中紅の染法は、江戸後期の『臙脂染方秘傳 』には「中紅尋常／紅色、絹一反（掛目七十五匁に付）片紅五十二匁五分…右の染方は下地を鬱金 にて染て、後紅にて染めるなり、鬱金の染色は極薄き玉子色にてよし」と記されています。
ちなみに、平安時代の式目『延喜式 』に記された『中紅 （中紅花）』はまったくの別色で、こちらは薄く明るい紅色のことです。
「べに」はもとは口紅、頬 べにの呼称で、丹 （あか）を延べる、「のべに」に由来しています。江戸時代からは『紅 』を「べに」と呼ぶようになり、色名となりました。",https://irocore.com/nakabeni/
茄子紺（なすこん）,"['130', '072', '128']","['61', '82', '00', '28']",#824880,茄子紺（なすこん）とは、夏野菜として親しまれている茄子の実のような紫みの濃い紺色のことです。藍染の濃色に蘇芳で染め重ねられ、江戸時代になってから使われるようになった色名です。茄子はインド原産のナス科の一年草。熱帯から温帯まで広く栽培されており夏から秋にかけて淡紫色の花が咲きます。,https://irocore.com/nasukon/
菜種油色（なたねあぶらいろ）,"['222', '192', '049']","['20', '25', '90', '00']",#DEC031,"菜種油色（なたねあぶらいろ）は、菜種から搾った菜種油のような緑みの深い黄色のことです。別に『菜種色 』とも。菜種とは、あぶらなの種のことです。菜種油が灯油として普及した江戸時代から染色されるようになりました。元文年間（一七三六〜四一）には麻裃の色に使われて流行し、天明年間には（一七八一〜八九）には裏付き裃として流行しています。
菜種に由来する色名としては他に『菜の花色』があります。",https://irocore.com/nataneabura-iro/
撫子色（なでしこいろ）,"['238', '187', '203']","['08', '35', '10', '00']",#EEBBCB,"撫子色（なでしこいろ）とは、撫子の花のような少し紫みのあるピンク系統の薄い赤色のことです。
撫子はナデシコ科の多年草で、秋の七草の一つ。
平安時代の襲の色目にもなっており、表紅、裏紫、または、表紅梅、裏青になります。",https://irocore.com/nadeshiko-iro/
浪花鼠（なにわねず）,"['216', '190', '189']","['00', '20', '10', '20']",#D8BEBD,"浪花鼠（なにわねず）とは、淡く渋い紅赤色のことです。
「浪花 」とは大阪市付近の古称で、地名にちなんだ色名。「四十八茶百鼠 」といわれる当時の流行色の一つです。
「浪花 」を「なみのはな」と読めば塩のことで、\bもしかすると当時の大阪でよく見られた天然の海塩が、不純物を多く含みこのように薄い赤みの色合いだったため、塩と地名をかけてできた色名かもしれません。
いずれにしても、『鼠色』という地味な色に紅みを含ませて味わい深く仕上げるあたり、「天下の台所」といわれた大阪商人の幕府に対する気概があらわれている気がします。
ちなみに『浪花鼠』と同じく関西の地名に由来する色には、京都にちなんだ『都鼠 』や、「嵯峨」にちなんだ『嵯峨鼠 』という色がありますが、同じ関西圏だからでしょうか、少し色合いが似ているのも面白いところです。",https://irocore.com/naniwanezu/
菜の花色（なのはないろ）,"['252', '217', '000']","['05', '15', '100', '00']",#FCD900,"菜の花色（なのはないろ）とは、油菜 の花色のような、明るく鮮やかな黄色のことです。
別に『菜種色 』とも呼ばれましたが、菜種油の色に因 んだ『菜種油色 』も『菜種色』と呼ばれていたため、混乱を避けて『菜の花色』と呼ばれるようになったようです。なお、色名としては『菜種油色』のほうが古く『菜種色』も当然この色を指していました。
菜の花は、アブラナまたはアブラナ科アブラナ属の花を指し、日本では食用、菜種油用、観賞用などに用いられてきました。また、身近な春の光景として親しまれてきたため、文学や言葉に登場することも多い植物です。季語は晩春。
『菜種油色』が江戸中期に流行していたのに対し、『菜の花色』は近代になって登場した新しい色名で、古来よりこの系統の色は『刈安 』や『黄蘗 』と呼ばれていました。
ちなみに、平安装束の合色目と織色目に『花葉色 』という色がありますが、その色がこの『菜の花色』のような色目です。",https://irocore.com/nanohana-iro/
生壁色（なまかべいろ）,"['170', '140', '099']","['40', '55', '75', '00']",#AA8C63,生壁色（なまかべいろ）は、塗りたての乾いていない土壁のような灰色みの黄褐色のことです。江戸時代に愛好されるようになった鼠系統の色の一つでもあります。「藍生壁」、「藤生壁」、紅がかった「江戸生壁」などの変相色も生まれました。現代でも和服などに用いられ、また大手鉛筆メーカーが発売した240色の色鉛筆に含まれています。,https://irocore.com/namakabe-iro/
鉛色（なまりいろ）,"['123', '124', '125']","['02', '01', '00', '51']",#7B7C7D,"鉛色（なまりいろ）とは、鉛のような少し青みを帯びた灰色のことです。鉛は「あおがね」ともいわれ、加工が容易で耐蝕性にすぐれた蒼白色の柔らかく重い金属で、本来金属的光沢を伴った明るい灰色なのですが、色名としての鉛色は一般的に錆びた感じの色合いで、銀色や錫色より暗い灰色になります。
鉛色が使われるようになったのはわりと新しく明治以降。鉛色の空、鉛色の海など、鉛の暗く重い印象から、今にも雨の降り出しそうな空模様の表現や、どんよりとした海の描写などによく使われます。",https://irocore.com/namari-iro/
納戸色（なんどいろ）,"['000', '136', '153']","['82', '36', '36', '00']",#008899,"納戸色（なんどいろ）とは、藍染めの一つで、緑色を帯びた深い青色のことです。赤みの強いものを「縹 」といい、赤みが少なくやや鼠色を帯びた色を「納戸」といいます。別名、「御納戸色」。江戸城内の納戸の垂れ幕やふろしきに用いらてきました。
藍色の濃度により濃い順で、紺、縹、納戸、浅葱 、甕覗 となります。",https://irocore.com/nando-iro/
丹色（にいろ）,"['228', '094', '050']","['00', '59', '78', '11']",#E45E32,丹色（にいろ）とは、赤みがかった灰黄色から赤褐色に用いられる、いわゆる赤土の色のことです。「丹」は、赤土の古語で、「あか」とも読みます。また「丹（たん）」の黄色みを帯びた鮮やかな赤の別名でもあります。,https://irocore.com/ni-iro/
似紫（にせむらさきいろ）,"['081', '055', '067']","['00', '32', '17', '68']",#513743,"似紫（にせむらさき）とは、くすんだ青みのある赤紫のことです。紫根染による紫は高価であったため、紫根の代わりに藍で下染して、茜や蘇芳を重ねたり、蘇芳を鉄で発色させて紫色に染めることが行われていました。これらは紫根で染めた「本紫」に対して、紫に似せた色ということで「似紫」と呼ばれました。江戸初期は本紫が禁制であったため、偽色が盛んに染められうようになりましたが、あえて「似せ」を冠したあたりに江戸庶民の知恵を感じます。
",https://irocore.com/nisemurasaki/
鈍色（にびいろ）,"['114', '113', '113']","['00', '01', '01', '55']",#727171,"鈍色（にびいろ）とは、橡色 などと同じく、無彩色系の鈍い鼠色のことです。平安時代から使われたきて色名で、「にぶいろ」とも呼ばれます。色相としては、墨色の淡いものから濃いものまであり、昔は近しい人に不幸があったときに着用する喪服の色でした。後世では鉄色の錆びたような色として、墨染に薄く藍をかけた青みの鼠色を指すようになりました。
ちなみに、青色に橡などの墨系の染料でそめて鉄で媒染した色は「青鈍」と呼びます。",https://irocore.com/nibi-iro/
濡羽色（ぬればいろ）,"['000', '011', '000']","['100', '00', '100', '96']",#000B00,"濡羽色（ぬればいろ）とは、烏 の羽のような艶のある黒色のことです。別名「濡烏 」、「烏羽色 」とも。万葉集の時代より「髪は、烏の濡れ羽色」といわれるように、黒く艷やかな女性の髪の毛を形容する言葉として用いられました。

烏 といえば真っ黒というイメージですが、よく見るとその羽は青や紫、緑などの光沢を帯びて見えます。これは羽毛の表面にわずかに構造色を持つためです。
まっすぐで健康的な女性の髪もまた同様に、水や髪油などを含むことで、わずかな干渉色を浮かべた「烏の濡羽色」のような美しい黒となるのです。",https://irocore.com/nureba-iro/
根岸色（ねぎしいろ）,"['144', '142', '101']","['04', '00', '40', '55']",#908E65,"根岸色（ねぎしいろ）とは、緑がかった渋い薄茶色のことです。江戸時代、根岸では砂質の上質な壁土がとれたので、その土で上塗りした壁を特別に『根岸壁 』と呼びました。その根岸壁の色が『根岸色』の由来です。ちなみに、壁土に関連す色名としては『生壁色 』という色名もあります。
根岸とは、江戸の地名。現在の東京都台東区。上野の山の北東側の麓 に当たる地名で江戸時代は閑静な鶯 の名所でした。「根岸」の名前の由来は、上野の山まで海が入り込んでいた頃、岸辺が木の根のように続いていたからといわれます。
茶色や鼠色が流行した江戸中期に登場した色名で、両方の色相をそなえた『根岸色』は穏やかで渋い色合いが人気の色でした。",https://irocore.com/negishi-iro/
鼠色（ねずみいろ）,"['125', '125', '125']","['00', '00', '00', '65']",#7D7D7D,"鼠色（ねずみいろ）とは、鼠 の体毛の色のような暗い灰色、および灰色系統全般を指す色名です。室町末期から江戸時代にかけて生まれた色名。『素鼠 』『御召鼠 』は同色、古くは『鈍色 』や『うす墨』などと呼ばれていました。
江戸中期には幕府が『紅色 』などの派手な色を禁止したこともあり、人々は彩度の低い色に関心を持つようになります。そんな中で鼠色は『茶色』や『藍色 』とともに「粋」な色とされ、江戸後期には美妙な色調の変化ごとにさまざまな派生色が誕生しました。桜や柳などの樹木、自然、 “千利休” や “小野小町” などの歴史上の人物などなど。さまざまなものと組み合わせることでイメージを広げ、大流行したのが「四十八茶百鼠 」です。
鼠色の染料は櫟 、楢 、栗 、樫 などさまざまで、いずれも煎じたものを鉄媒染 して染められました。江戸後期に多様な「鼠色」が流行した背景には、これらの染料が手に入れやすかったという側面もあります。
別名で『灰色』とも呼ばれますが、厳密には違う色であり、あえて区別をつけるなら少しだけ明るく黄みを含んだ鼠色を『灰色』とすることがあります。",https://irocore.com/nezumi-iro/
熨斗目色（のしめいろ）,"['023', '091', '102']","['91', '64', '60', '00']",#175B66,"熨斗目色（のしめいろ）とは、織物の小袖のひとつである熨斗目に用いられたやや灰みの濃い鈍い青色のことです。熨斗目の地染めが藍染であったので、熨斗目色は藍色の系統に分類されました。ちなみに、熨斗目色から出た色名には熨斗目浅葱、熨斗目空色、熨斗目納戸、熨斗目紺青などがあり、また江戸時代に士分以上の者の礼服として、縞や格子を織り出したものを熨斗目模様と呼ばれました。市川團十郎の役者色である舛花色は、この色から派生したと言われています。
",https://irocore.com/noshime-iro/
熨斗目花色（のしめはないろ）,"['066', '101', '121']","['45', '17', '00', '53']",#426579,"熨斗目花色（のしめはないろ）とは、熨斗目色よりも灰みの強い濃い青色のことです。江戸時代の「手鑑模様節用」には「舛花いろ、三舛所好の色、濃きをのしめ花色と云ふ」と書いてあります。なお、三升とは市川團十郎の家紋で、舛花色 の色名は五世団十郎が好んだ薄花色のこと。それよりも濃い藍染の色を「熨斗目花色」といいます。
ちなみに、熨斗目は経 を生糸、緯 を半練糸 を用いた生染の平織のことで、縞 や格子 などに織り出しました。後にこれで仕立てられた小袖を指すようになり、江戸時代では士分以上の礼服として麻裃 の下に必ず着用しました。｢熨斗目花色｣は、この織物の地色に用いた花色の一種です。また熨斗目の色から出た染色には他に、熨斗目空色、熨斗目浅葱、熨斗目紺青などがあります。",https://irocore.com/noshime-hanairo/
灰色（はいいろ）,"['159', '157', '154']","['00', '03', '05', '50']",#9F9D9A,灰色（はいいろ）は、白と黒の中間の色のことです。物を燃やした際に出る灰のような色で薄い鼠色に用いられます。鼠色と呼ぶこともありますが、厳密には違う色です。平安時代には凶色のイメージが強く、墨や鈍色といわれ嫌われていましたが、江戸時代には『四十八茶百鼠』として鼠色系の色が流行しました。,https://irocore.com/hai-iro/
灰桜（はいざくら）,"['232', '211', '209']","['00', '09', '10', '09']",#E8D3D1,灰桜（はいざくら）とは、やや灰色がかった明るい桜色のことです。桜色に薄墨がかった「桜鼠（さくらねずみ）」も同系統ですが、こちらの方が明るくやわらかい風合いです。語源としては文字通り灰みを含んだ桜色の意味で、現代に多く用いられていることから、近代以降に現れた色名と思われます。,https://irocore.com/haizakura/
灰茶（はいちゃ）,"['152', '098', '060']","['00', '36', '61', '40']",#98623C,灰茶（はいちゃ）とは、灰色がかったややくすんだ茶色のことです。別名「雀色」ともいいます。灰色が入っているためか「灰茶」という色名になりました。灰茶は茶色系統が流行した江戸時代の色名ではなく、実は近代にできた色名です。陶磁器のほか、衣料品やメガネフレームなどの色名に用いられています。,https://irocore.com/haicha/
萩色（はぎいろ）,"['226', '079', '147']","['00', '80', '00', '05']",#E24F93,"萩色（はぎいろ）とは、秋の山野に咲く萩 の花のような紫みの明るい紅 色のことです。　古くからの色名で、もともとは重 ねの色や織り色の名前でした。平安時代の古典「栄花物語」にも、女房装束として「萩の唐衣 」の記述がみられます。
萩は「秋の七草」に選ばれているように秋を代表する花で、可憐な紅色の花が古くから日本人に愛されました。万葉集にも萩をテーマにした歌が数多く詠まれ、“清少納言”の「枕草子」など平安文学にも数多く登場します。
萩はマメ科ハギ属の総称。落葉低木。秋の七草のひとつで、花期は7月から10月。
萩の文字は日本固有の字で、文字形成はその草が秋を代表することから、「秋」の字に「草かんむり」をつけたものとなった。古くは「芽子 」と書かれている。
また萩の花は、花札の7月札のモチーフとしても有名。
重 ねの色目では「表紫、裏白」で萩の花を表した配色となっています。 着用時期は六・七月。
なお、『萩』の織色が「経糸・青、緯糸・蘇芳 」であることから、「表蘇芳、裏青」の別説もあります。
ちなみに、萩がつく色名には他に『夏萩 』や『萩経青 』、『萩重 』がありますが、いずれも襲の色に由来する色名です。
萩は江戸時代の俳人“森川許六 ”も「萩はやさしき花也。」と紹介しているように、たおやかで儚い印象です。『萩色』を使用する場合はそのイメージのように控えめに使いたいものですね。
萩の花
萩の花",https://irocore.com/hagi-iro/
白銅色（はくどういろ）,"['211', '219', '226']","['10', '03', '00', '15']",#D3DBE2,"白銅色（はくどういろ）とは、金属の白銅の色ようなわずかに青みを含んだ明るい灰色のことです。白銅に因 んだ色ですが、実際の白銅の色はさらに金属的な光沢があります。白銅色が使われるようになったのは近代からで、明治以降の新しい色になります。
白銅は、銅にニッケルを約20パーセントほど加えた合金です。銀白色で硬く、展延性・耐食性に富むので、硬貨や装飾品に用いられます。ちなみに、日本の100円硬貨、50円硬貨、旧500円硬貨は 銅５％-ニッケル25% の白銅です。
金属にちなんだ色としては、『金色』『銀色』はもちろん『錫色 』『鉛色 』『赤銅色 』『白銀』など多数みられます。",https://irocore.com/hakudou-iro/
半色（はしたいろ）,"['166', '132', '163']","['20', '40', '00', '30']",#A484A3,"半色（はしたいろ）とは、淡い渋みの紅紫色のことです。『半色』は規定から外れた中間の色、半端な色という意味で、別に『端色 』とも書きました。平安文学にもその名が見られる古い色名で、もとは古代の染めの色に由来します。
平安時代の格式「延喜式 」では、紫色は『深紫 』と『浅紫 』の二色が規定されており、この二色に当てはらまない色を『半色』と呼んでいました。
紫に限らず、赤や青など他の色にも『半色』はあったのですが、我が国では『紫』が特別な色であったため紫系の色として色名が残ったのでしょう。
また、『半色』を中間的な紫の『中紫 』と同色とする説もありますが、色合い的には『中紫』と『浅紫』の中間で「許色 」になります。
※許色（聴色）とは身分を問わず着用を許された色のこと。
ちなみに、半色は染め色の他にも、織り色や重 ねの色にも見られ、織り色は有職故実書「桃花蘂葉 」（一四八○）によると「経緯 ともに薄紫」で織られていたようです。
襲の色目では「表・淡紫、裏・淡紫」とあり『淡色』と同じ色となっています。（出典：薄様色目）
もともと『半色』は、どんな色とも呼べない中途半端な色の意味でしたが、『禁色 』に当てはまらない紫色ということで人気となり色名として定着したようです。
",https://irocore.com/hashita-iro/
櫨染（はじぞめ）,"['217', '166', '046']","['00', '24', '79', '15']",#D9A62E,櫨染（はじぞめ）は、暖かみのある赤みの深い黄色のことです。山櫨（やまはぜ）の黄色い心材を染料にし、灰汁媒染で染めました。山櫨は山野に自生し、実から蠟をとる落葉樹で、古くはこれで紙を染めました。染紙としての染め色は『正倉院文書』に、裂染の色は、『延喜縫殿式』に名があります。また古くは平安時代、高貴な身分を表す衣の色として愛されていました。,https://irocore.com/hajizome/
鳩羽色（はとばいろ）,"['149', '133', '156']","['04', '15', '00', '39']",#95859C,"鳩羽色（はとばいろ）とは、鳩の羽のような灰みがかった薄い青紫色のことです。明治以降は着物の色として流行し、現代でも和服や和装小物などに多く用いらています。ちなみに、灰みの強い鳩羽色を『鳩羽鼠』、紫みの強い鳩羽色を『鳩羽紫』といいます。
鳩の羽に由来する色名には、他に天皇が平常着用された袍 の色でもある『山鳩色』がありますが、こちらは灰みの黄緑色で青鳩の羽の色に由来しています。",https://irocore.com/hatoba-iro/
鳩羽鼠（はとばねずみ）,"['158', '139', '142']","['00', '12', '10', '38']",#9E8B8E,鳩羽鼠（はとばねずみ）とは、薄い紫色である藤色に鼠色をかけた赤みがかった灰紫色のことです。「鳩羽」は山鳩の背羽の色に用いられ、『手鑑模様節用』新古染色考説には「鳩羽鼠　やまばといろといふは別々にして此いろにあらず」とあり、鳩羽鼠として紫みのある鼠色の色票が貼ってあります。染色として、「○○鼠」という鼠の変相色が数多く現れた江戸時代後期頃に始まったと推察されます。,https://irocore.com/hatobanezumi/
花浅葱（はなあさぎ）,"['030', '136', '168']","['90', '32', '23', '00']",#1E88A8,"花浅葱（はなあさぎ）とは、文字通り「花色がかった浅葱色」の意味で、少し緑がかった鮮やかな青色のことです。
花色は藍の単一染による青色で、鴨頭草 （露草）の青い花の汁を用いて染色したことに由来しています。",https://irocore.com/hanaasagi/
花色（はないろ）,"['000', '134', '173']","['82', '39', '26', '00']",#0086AD,"花色（はないろ）とは、青系統の代表的な伝統色で強い青色のことです。奈良時代以前は『はなだ色』、平安の頃は『縹色 』の色名で、江戸の頃より「花色」「花田色 」と呼ばれるようになりました。現代でいうところの『青色』にあたります。
ちなみに、「花色」の名前は平安時代にも見られ、これはもともと鴨頭草 （露草 の古名）の花の青い汁で摺染 していたことに由来します。いつからか藍染 めに黄蘗 をかけた色を指すようになりましたが、色名はそのまま残ったようです。
『熨斗目色 』と同色とする説もありますが、花色のほうが少し明るい色になります。
江戸時代、花色は裏地や木綿などの色としてとても一般的な色であり、落語の古典演目にも『花色木綿 』というが噺 があるほどです。※「出来心」の別名。",https://irocore.com/hana-iro/
花紺青（はなこんじょう）,"['006', '044', '084']","['90', '65', '00', '48']",#062C54,"花紺青（はなこんじょう）とは、紫色を帯びた暗い青色のことです。人類最古のコバルト顔料「スマルト」の和名。スマルトはエジプトやミケーネ文明の頃から用いられていました。
日本では顔料の「紺青色 」の中でも、人造の顔料を「花紺青」、天然のアズライトを原料とする顔料を「石紺青 」と呼んで区別しています。",https://irocore.com/hanakonjou/
縹色（はなだいろ）,"['000', '134', '173']","['82', '39', '26', '00']",#0086AD,"縹色（はなだいろ）とは、古くから知られた藍染めの色名で、藍色よりも薄く浅葱色よりも濃い色のことです。古くははなだ色、平安時代は縹色、江戸時代は花色と色名を変えて伝わってきました。『日本書紀』には既に『深縹 』、『浅縹 』の服色名が見られます。
平安時代の格式『延喜式 』では藍と黄蘗 で染められる『藍』に対して、藍だけで染める縹が区別されています。さらに、藍は、深・中・浅の三段階に、縹は深・中・次・浅の四段階に分けられていましたが、現在では、藍染の色は薄い方から、浅葱、縹、藍、紺と呼ぶのが一般的です。『花田』と書かれたり『花色』とも呼ばれるのは、かつて月草の花の青汁で摺染をしたことに由来しています。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/hanada-iro/
花葉色（はなばいろ）,"['251', '210', '107']","['0', '16', '57', '02']",#FBD26B,花葉色（はなばいろ）とは、襲の色名のひとつで、表地に香を裏地に青を配した色目のことです。主に春に用いられます。『飾鈔（かざりしょう）』に「経黄色緯欵冬（やまぶき）色。大略（おおよそ）花山吹か」と載っています。,https://irocore.com/hanaba-iro/
花萌葱（はなもえぎ）,"['000', '141', '086']","['90', '00', '79', '20']",#008D56,"花萌葱（はなもえぎ）とは、若い青ネギの葉のような強く濃い緑色のことです。その名のとおり『萌葱色 』の一種で、青系統の代表的な伝統色である『花色 』に『黄色 』を染め重ねて作られたことから特別に『花萌葱』と呼ばれました。
江戸時代の色の解説本である『染物早指南 』にその名が見られるように、江戸中期より見られるようになった色名です。
鮮やかな緑色である花萌葱の色合いは、若々しさと落ち着きをあわせ持つ活気のある色といえるでしょう。
ちなみに、萌葱色と同じ読みの『萌黄色 』がありますが、こちらは黄緑色であり完全に別の色です。",https://irocore.com/hanamoegi/
花緑青（はなろくしょう）,"['090', '181', '178']","['60', '00', '30', '10']",#5AB5B2,"花緑青（はなろくしょう）とは、明るく渋い青緑色のことです。十九世紀初めのパリで生産された酢酸銅 と亜砒酸銅 の複塩 による緑系の人工顔料『パリス・グリーン』の色で、青みの濃い『緑青 』ということから日本では『花緑青』と呼ばれるようになりました。我が国で青色を意味する「花（花色）」を冠して、旧来の『緑青』と区別しています。
『花緑青』の顔料は、海外では絵具や建築用塗料として盛んに利用されていましたが、有毒で、しかもヒ素に由来する強い毒性を持っているため、顔料としては次第に使われなくなり、現在では色名だけが残りました。
ちなみに、花緑青の海外での呼び名は、パリス・グリーンの他に、ドイツのシュバインフルトで工業生産されたことから『シュバインフルト・グリーン』や、その鮮やかな色合から『エメラルドグリーン』とも呼ばれています。",https://irocore.com/hanarokusho/
朱華（はねず）,"['244', '165', '122']","['00', '45', '50', '00']",#F4A57A,"朱華（はねず）とは、黄色がかった薄い赤色のことです。『万葉集』にもその名が見られる由緒ある伝統色で、他に『波泥孺』『唐棣花』『棠棣』『翼酢』などの字が当てられることもありました。
日本書紀によると天武天皇 の頃、親王や諸王の衣装の色として定められ、３年ほどの短い期間ですが『紫色』の上に朱華の服が着られていたという記述がみられます。また、それを継承した持統天皇 の色制でも親王の色とされており、平安時代には『禁色 』のひとつでした。
文武天皇 の頃より『黄丹 』と呼ばれるようになりましたが、朱華 と黄丹 では色合いにかなりの違いがあるため、同じ紅花 と支子 で染められるものですが、その配合の比率が変わったものでしょう。
朱華の色合いを郁李 の花弁の色味に由来する薄い紅色の『唐棣色 』と同じとする説や、『万葉集』の「山吹 の匂へる妹が朱華色 の赤裳 の姿夢にみえつつ」という一首から黄色とする説などがあり、色名の「朱華」についても、中国の蓮の花の名前が伝わったとものとも、庭梅の古名に由来しているとも言われ、現在でも謎に包まれている色ともいえます。
ちなみに、朱華の染色は褪色 しやすかったようで、『万葉集』には「移 ろいやすい心」にかけて詠まれた歌がいくつかみられます。",https://irocore.com/hanezu/
榛摺（はりずり）,"['121', '82', '11']","['00', '40', '80', '65']",#79520B,"榛摺 （はりずり）とは、榛 の木の実や樹皮で染めた深く渋い橙色のことです。古くから見られる色名で、万葉集にもその名が詠まれています。平安時代の格式『延喜式 』では、「鎮魂斎服。神祇官の伯已下。弾琴已上十三人。榛摺ノ帛袍十三領」との記載があり、最服の色とされていました。
榛 の木はカバノキ科の落葉高木。「はりのき」とも。湿原のような過湿地において森林を形成する数少ない樹木で、松かさ状の果実は橡 とともに古くから染色に用いられ親しまれてきました。初めは榛の実の熟したものを蒸し焼きにして黒灰を作り、膠 汁を加えて黒染を行っていましたが、後に煎汁と鉄媒染によって黒褐色に染めるようになりました。

榛の木（はんのき）
榛の木（はんのき）
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/harizuri/
梅幸茶（ばいこうちゃ）,"['170', '167', '081']","['45', '31', '82', '00']",#AAA751,"梅幸茶（ばいこうちゃ）とは、茶みを含んだ淡い萌黄色 のことです。歌舞伎の大立者であった“初代 尾上菊五郎 ”の好みの色に由来しており、菊五郎の俳名である“梅幸”から色名も「梅幸好みの茶 = 梅幸茶」となっています。ちなみに俳名「梅幸」も後に「尾上梅幸」として歌舞伎の名跡のひとつとなりました。
当時は『浅葱色 』が全盛でしたがそれと全く異なる『萌黄色 』を打ち出したのは、個性を強調するためだったのでしょう。梅幸茶は通人の贔屓客の間で喜ばれ、天保の頃まで流行したそうです。
尾上菊五郎は京都生まれで始めは女形として舞台に立ちましたが、後に江戸に下り立役に転じて人気を集めました。ただ、その人気は彼の美貌よりも達者な芸にあったようです。
尾上菊五郎の家紋
重ね扇に抱き柏
梅幸茶の渋みを含んだ色合にも芸風に通じる鮮やかさがあります。『手鑑模様節用』では、『草柳』という色の別名とされており、『茶色』と名がつくものの実際は黄緑系の色でした。",https://irocore.com/baikoucha/
薔薇色（ばらいろ）,"['231', '050', '117']","['00', '90', '23', '0']",#E73275,"薔薇色（ばらいろ）とは、赤い薔薇 の花のような鮮 やかな紅色 のことです。『そうびいろ』『しょうびしょく』とも読まれます。
薔薇は中国から伝わり、平安時代の『枕草子 』や『古今和歌集 』にもその名が登場しますが、一般的な色名として使われるようになるのは明治以降からです。ただし、重 ねの色としては『薔薇襲 』があり「表・紅 、裏・紫」の組み合わせで表しました。
薔薇色は「薔薇色の人生」「薔薇色の未来」というように、華やかなことや楽しいことの比喩として使われることが多い色です。反対に悲観的な色としては『灰色 』があります。
『古今和歌集』紀貫之。
「今朝、初めて薔薇の花を見たけれど、花の色は移ろいやすく儚 いものだった」という意味で、「女性の本性」を薔薇の花にかけたもの。
※そうひ…薔薇の花
※うひ…初めて
※あだ…はかない・移ろいやすい
薔薇はバラ科バラ属の総称。葉や茎に棘を持つ灌木 、低木の植物。古くは「うまら」「うばら」と呼ばれ、『万葉集』にもその名がみられました。
日本は薔薇の自生地として世界的に知られており、品種改良に使用された原種のうち3種類（ノイバラ、テリハノイバラ、ハマナシ）は日本原産です。
「ばら」の名は和語で、「いばら」が転訛 したもの。漢語「薔薇」の字をあてますが、音読みで「そうび」「しょうび」とも読まれます。
6月の誕生花。季語は夏（ただし、「冬薔薇 」は冬の季語）。 花言葉は「愛情」です。
伝統色では『薄紅 』に似ていますが、薔薇色のほうが近代にできた色だけあってより鮮やかな色をしています。また、古い薔薇の品種である「庚申薔薇 」を元にした『長春色 』という色があり、こちらは大正時代に流行しました。

薔薇（バラ）
薔薇（バラ）",https://irocore.com/bara-iro/
肥後煤竹（ひごすすたけ）,"['137', '120', '088']","['00', '12', '36', '46']",#897858,"肥後煤竹（ひごすすたけ）とは、黒みがかった黄褐色のことです。『煤竹色 』の派生色。江戸時代の染色解説書である『手鑑模様節用 』の色譜にもその名がみられ、蘇芳 と梅に渋色 を重ねて染められていました。
色名の「肥後 」についてですが、地名の「肥後（現在の熊本県）」か人名由来のの「肥後守 」などに因 んだものだと思われますが、詳しくは判っていません。
元禄時代に『柳煤竹 』や『藤煤竹 』など『◯◯煤竹』という色名が多くあらわれていることから、その頃から行われるようになった染め色でしょう。",https://irocore.com/higosusutake/
秘色（ひそく）,"['171', '206', '216']","['38', '11', '15', '00']",#abced8,"秘色（ひそく）とは、青磁の肌の色のような浅い緑色のことで、焼き物の青磁の美しい肌色を模した色名です。青磁は釉薬に含まれる鉄分により独特の灰みを帯びた青緑色になりますが、その色が神秘的な美しさであることから『秘色』の色名がつきました。
襲の色としては、「表・瑠璃色、裏・薄色」を配した色目です。青磁の肌色は淡い微妙な青色で、濃淡にも違いがありますが、襲の色目の『秘色』は表が『瑠璃色』となっています。",https://irocore.com/hisoku/
一重梅（ひとえうめ）,"['242', '156', '159']","['00', '50', '25', '00']",#F29C9F,"一重梅（ひとえうめ）とは、一重咲きの梅の花のような明るい紅赤 色のことです。
『紅梅色 』と『薄紅梅 』の中間色で、平安時代の重 ねの装束 に由来した色名。重ねの色目としては「表地の色が白、裏地の色が紅」で、一重の梅の花の色を表した配色です。主に十一月から二月にかけて着用されていました。
古来より梅は桜と並んで人気の春の花で、色名としても『紅梅色』『薄紅梅』『梅重 』『雪下紅梅 』『梅鼠 』など数多くみられます。
『一重梅』の優しく上品な色合いは、春の華やかさを表した着物の色として今も昔も人気があるのは当然といえるでしょう。

梅の花
梅の花",https://irocore.com/hitoeume/
檜皮色（ひはだいろ）,"['123', '67', '52']","['0', '60', '60', '50']",#7B4334,檜皮色（ひはだいろ）とは、染め色の名。黒みがかった蘇芳(すおう)色のことです。当初は檜の樹皮で染めた染色の色だったともいわれていますが、一般には檜の樹皮のような黒ずんだ赤茶色を指します。平安時代には既によく知られた色名だったようで、『源氏物語』には「ひはだいろの紙」や「ひはだいろの袴」などが登場しています。襲の色目としては、「表が檜皮色、裏が檜皮色または縹、或いは、表が黒みのある蘇芳、裏が縹」など十種ほど見られ、四季を通して用いられました。,https://irocore.com/hihada-iro/
鶸色（ひわいろ）,"['214', '208', '000']","['15', '00', '100', '15']",#D6D000,"鶸色（ひわいろ）とは、小鳥の鶸の羽の色にちなんだ色名で、黄みの強い明るい萌黄色のことです。
鶸はスズメ目アトリ科の小鳥。スズメより一回り小さい。北海道で繁殖する他、シベリア方面から冬鳥として全国に渡来します。
鎌倉時代の武士が礼服に用いた狩衣を表した「布衣記 」の「狩衣事 」の項に見られることから鎌倉以降の色名と思われます。
『鶯色 』に比べるとより鮮やかな色を指しており、緑みが強くなると『鶸萌黄 』、さらに緑がかると『萌黄色 』、茶みが加わると『鶸茶 』とよばれます。",https://irocore.com/hiwa-iro/
,,,,,'NoneType' object has no attribute 'text',https://irocore.com/hiwacha/
鶸萌黄（ひわもえぎ）,"['130', '174', '070']","['25', '00', '60', '32']",#82AE46,"鶸萌黄（ひわもえぎ）とは、鶸色と萌黄色の中間の色で、黄みの強い黄緑色のことです。江戸中期頃に広く用いられており、『手鑑模様節用』に「ひわもえぎ。古名浅みどり」とあるように、江戸期より『浅緑』が鶸萌黄と呼ばれるようになったようです。
緑色の染色には古くから刈安 が黄染めに用いられていますが、この染色では刈安を強く、藍を弱くして黄みの強い緑になるようにしていました。『染物早指南』には「鶸萌黄、かやこくにつめて裏表二へんづつ　あいけし」と記されています。
ちなみに「鶸」を冠した色名には『鶸色 』の他に『紅鶸色 』『鶸茶 』などがあります。",https://irocore.com/hiwamoegi/
白群（びゃくぐん）,"['131', '204', '210']","['38', '03', '00', '18']",#83CCD2,"白群（びゃくぐん）とは、柔らかい白みを帯びた青色のことです。岩絵の具に用いる青色の顔料である藍銅鉱 （アズライト）という石を砕いて作られた粒子を、さらに細かく粉末に砕いてできる白っぽい淡青色のことをいいます。粒子の状態や色の濃淡から『群青 』『紺青 』『白群』と呼び名が変わります。

ちなみに、藍銅鉱 は緑色の顔料である緑青の原石である孔雀石 （マカライト）と共に産出されますが、この孔雀石を砕いたものの色名は『白緑 』といいます。

",https://irocore.com/byakugun/
白緑（びゃくろく）,"['218', '234', '208']","['20', '00', '25', '00']",#DAEAD0,"白緑（びゃくろく）とは、鉱物の「孔雀石 」から作られる岩絵具の色で淡い緑色のことです。色名の「白」とは「淡い」という意味。英名はオパールグリーン（opal green）。
『金青 』『緑青 』などの岩絵具は飛鳥時代（五九三〜七一○）に中国から製法とともに伝来し、奈良時代（七一○〜七九四）には仏像や仏画の彩色に使用されました。『白緑』もまた同時期に伝来したと思われます。
ちなみに、『緑青』も『白緑』と同じく「孔雀石」から作られる顔料ですが、粒子が荒いため色合は「孔雀石」に近い緑色となっています。
中国の画譜『芥子園畫傳 』には「孔雀石」を水飛 して、『頭緑』『二緑」「三緑』に分けると記されており、この『頭緑』が『白緑』のことを指しています。
※水飛…水とともに砥 る
顔料名としては非常に古い『白緑』ですが、色名が染色名や一般色名として使われるようになったのはずっと後代になってからでした。
孔雀石（マカライト）",https://irocore.com/byakuroku/
天鵞絨（びろうど）,"['000', '069', '030']","['80', '00', '80', '75']",#00451E,"天鵞絨（びろうど）とは、ビロードの生地のような暗い青みの緑色ことです。生地が光沢のある白鳥の翼に似ているところから「天鵞絨」の字があてられていました。「天鵞」が白鳥を意味し、「絨 」が毛の厚い織物を意味しています。
天鵞絨 はポルトガル語の「veludo」またはスペイン語の「velludo」からきた言葉で、本来は添毛織物の名称です。この織物はポルトガル商船から京都に伝わり、慶長年間より織り始められました。",https://irocore.com/veludo/
枇杷茶（びわちゃ）,"['174', '124', '079']","['00', '29', '55', '32']",#AE7C4F,枇杷茶（びわちゃ）とは、熟した枇杷の実が茶色がかったようなくすんだ黄褐色のことです。江戸時代後期に書かれた『手鑑模様節用』には、「びわ茶、俗に土器色（かわらけいろ）といふ」とあります。かわらけとは、神前に供える釉薬をかけない素焼きの土器のことです。その色に似ていることから、別名になったようです。,https://irocore.com/biwacha/
檳榔子黒（びんろうじぐろ）,"['000', '008', '026']","['50', '13', '00', '100']",#00081A,"檳榔子黒（びんろうじぐろ）とは、青みを含んだ気品のある黒色のことで\b『檳榔子染 』の別名もあります。檳榔子黒は、藍を下染めに檳榔樹 の実「檳榔子 」で染められた最高級の黒染の色であり、藍を下染めにすることから『藍下黒 』とも呼ばれました。また、紋付きの最高級の色とされています。
檳榔子はヤシ科の常緑木で、マレーシア原産。日本への渡来は古く、奈良時代には薬用として、南北朝時代より染色にも利用されるようになりました。
江戸の当時、檳榔子は大変高価な物だったようで、“井原西鶴 ”の『好色五人女 』には「檳榔子の買置して家をうしなはれける」という記述があり、檳榔子の相場買いで家を失うほどの価格だったようです。
ちなみに、檳榔子染めには紅を下染めにする『紅下黒 』もあり、こちらは紅みを含んだ柔らかい印象の黒色です。なお、紅下黒もまた『檳榔子黒』と呼ばれます。
",https://irocore.com/binroujiguro/
檳榔子染（びんろうじぞめ）,"['067', '061', '060']","['00', '09', '10', '74']",#433D3C,"檳榔子染（びんろうじぞめ）とは、檳榔子染は檳榔樹の実を染料として染めた黒褐色のことです。きわめて気品のある色で別名『檳榔子黒 』とも呼ばれました。
「手鑑模様節用 」の「くろ」の色譜に「上品をびんらうじそめといふ。下たそめあさぎなるを吉岡染という」と書かれており、紋付の黒染の中で最高級とされた色です。
檳榔子はヤシ科の常緑木で、マレーシア原産。東アジアで生育されており、日本への渡来は古く、天平勝宝8年（756）の輸入記録があります。",https://irocore.com/binjirouzome/
深藍（ふかあい）,"['000', '065', '080']","['100', '00', '25', '75']",#004150,"深藍（ふかあい）とは、藍染 めを黒に近づくほどに染められた濃く暗い青色のことです。『しんらん』とも読まれます。『深藍』のような濃い藍色は、藍染めの際に藍を搗 つことから『褐色 』と呼ばれました。またその威厳を感じさせる色合いが質実剛健を尊ぶ中世の武士たちに非常に好まれ、さらに「かち」の響きが「勝ち」と同じことから『勝』の字をあて『勝色 』という縁起色になっています。
※搗つ：臼 うすでつく。
ちなみに、『ふかきあいいろ』や『こきらん』と読む場合は、平安時代の『延喜式 』に定められた青みがかった暗い緑色の『深藍色 』を指すので注意が必要です。",https://irocore.com/fukaai/
深川鼠（ふかがわねずみ）,"['133', '161', '160']","['30', '00', '15', '40']",#85A1A0,"深川鼠（ふかがわねずみ）とは、薄い青緑みの灰色のことです。藍の薄染めは緑がかった青になり、『浅葱色 』とよばれますが、この浅葱の色みをさらに抑えた色が深川鼠です。江戸時代後期に流行した色で、色名は江戸「深川」のいなせな若衆や、華美を嫌い、渋さを好んだ芸妓衆が愛用したことに由来します。
また、江戸天明期 を代表する狂歌師で御家人の “大田南畝 ”は、『手鑑模様節用 』の中で「みなと鼠。此 のころ流行して”深川鼠”と云ふ」と記しており、『湊鼠 』は同色です。
ちなみに、地名に由来する深川鼠の色ですが、湊鼠もまた大阪の「湊村」に由来する地名に因んだ色名でした。
明暦 の大火（一六五七）後、江戸の深川には富岡八幡宮を中心とした庶民的な享楽街が生まれました。木場があり、木材商の人足たちも多い土地柄から、意気と侠気 が売り物の辰巳芸者 が活躍し、ある意味、江戸の文化の中心地だったとされています。
そんな江戸で最も粋な深川界隈で好まれたのがこの深川鼠であり、やがて江戸庶民の間にも流行していきました。
幕府の奢侈禁止令 により派手な色がたびたび禁止された江戸の庶民たちは、『茶色』や『鼠色』を「粋な色」として重用し流行しました。それがいわゆる『四十八茶百鼠 』です。",https://irocore.com/fukagawanezumi/
深藍色（ふかきあいいろ）,"['000', '106', '102']","['90', '00', '45', '50']",#006A66,"深藍色（ふかきあいいろ）とは、『延喜式 』に書かれた『藍 』で暗い青緑色のことです。『こきらん』とも読まれ、藍と黄蘗 を染め重ねた色でした。平安時代には庶民の生活にも浸透していた色ですが、のちの藍染めの『藍色』とは全く違う色になります。
ちなみに、同じ『深藍』でも『ふかあい』『しんらん』と読む場合は藍染めの濃い青色を指します。そちらの色は『勝色 』として鎌倉以降の武家に好まれました。
延喜式とは、平安時代初期にまとめられた禁中の儀式や規則などを記した50巻にものぼる法令集。三代格式の一つ。
延喜五年 (九〇五) 、左大臣藤原忠平らが醍醐天皇の命令により編集。延長五年 (九二七) 完成。古代政府の根本法令を補う形で、その後発布された施行細則を集大成したもの。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/fukakiaiiro/
深緑（ふかみどり）,"['000', '064', '037']","['100', '00', '75', '75']",#004025,"深緑（ふかみどり）とは、青みと黒みの強い濃い緑色のことです。『浅緑 』の対色。「ふかきみどり」とも読まれ、常緑樹の葉などの濃い緑色の形容に使われます。古くからある色名ですが、平安時代の深緑は黄みが薄く青色に近いものでした。
色名は染色法に由来しており、平安の頃は濃く染めたものを「深」と表記し「ふか、こき」と読まれました。他の色では『深緋 』『深縹 』などがあります。また薄く染めたものは「浅」と表記し「あさ、うす」と読まれ、『浅緋 』『浅黄 』などがありました。
「養老律令 （七五七）」の朝服条によれば、深緑は朝廷への出仕に着用する朝服の六位の色とされており、対語の『浅緑』は七位の色と規定されています。",https://irocore.com/fukamidori/
柴色（ふしいろ）,"['153', '140', '120']","['47', '44', '52', '']",#998C78,"柴色（ふしいろ）とは、柴木 の煎 じた汁で染めた灰みのくすんだ茶色のことです。「ふし」とは「しば」と同じ意味で、いわゆる雑木、「山に柴刈りに行く」の柴のことです。
古くは低い身分を表した色とされていますが、江戸時代に茶色系統が流行した際に一般的な色となりました。灰汁色（あくいろ）に近い色合いです。",https://irocore.com/fushi-iro/
柴染（ふしぞめ）,"['178', '140', '110']","['00', '21', '38', '30']",#B28C6E,柴染（ふしぞめ）とは、柴色（ふしいろ）ともいい暗い灰みの黄赤のことです。柴木（しばき）、クロモジ木の煎汁から染料がつくられます。柴は山野に生する栗、楢、樫、櫟など小さい雑木のことで、柴染はタンニン物質を含んだ樹皮や柴木を染料とした黒褐色や黒系の染色の総称です。どこででも採れる染料であるため、下位の人間の服の色とされました。ちなみに、フシはシバの古名です。,https://irocore.com/fushizome/
藤色（ふじいろ）,"['186', '167', '204']","['32', '37', '06', '00']",#BAA7CC,藤色（ふじいろ）とは、藤の花からきた色名で淡い青みのある紫色のことです。古くから馴染み深い色であり、『若紫』とも呼ばれます。平安時代から近代にかけて日本女性の服色として好まれ、その時々の流行色として現れました。明治以降にも｢大正藤｣や｢小町藤｣などの変相色も生まれています。襲の色目としては、「表・淡紫、裏・青」、「表・紫、裏・薄紫」など数種類が見られ、その多くは面の色が淡紫となっています。,https://irocore.com/fuji-iro/
藤煤竹（ふじすすたけ）,"['090', '083', '089']","['00', '08', '01', '65']",#5A5359,"藤煤竹（ふじすすたけ）とは、藤色がかった煤竹色 で赤みの暗い灰紫色のことです。
『藤煤竹』は貞享4年刊行（一六八七）の小袖雛形本「源氏ひなかた」の小袖 の地色のなかに見られるように、江戸前期にはすでに染色が行われていました。また、江戸時代の染色指南書「手鑑模様節用 」の色譜に「藤煤竹。紅消鼠の紅を梅にかへて染めたる色也」と記されています。
「煤竹」がつく色名は『柳煤竹 』『銀煤竹 』『肥後煤竹 』『洒落煤竹』をはじめ約20種類あり、それらの多くは江戸時代の元禄〜宝永の時期の色見本や雛形本にも数多く出てきており、江戸時代前期には一般的な色でした。",https://irocore.com/fujisusutake/
藤納戸（ふじなんど）,"['096', '109', '161']","['60', '45', '00', '25']",#606DA1,"藤納戸（ふじなんど）とは、灰みを帯びた淡い青紫色のことです。『藤御納戸』とも。　
『納戸色 』は江戸時代に流行した代表的な青系の色で、納戸の暗がりの色とも、納戸の垂れ幕の色ともいわれます。その色に平安の昔から多くの女性に愛された『藤色』を組み合わせた色で、江戸後期にできた色名だと思われます。
落ち着きのある大人びた印象の色合いから現代でも着物などの色として人気です。",https://irocore.com/fujinando/
藤鼠（ふじねずみ）,"['110', '117', '164']","['69', '56', '17', '00']",#6E75A4,"藤鼠（ふじねずみ）とは、薄い紫の藤色を鼠がからせたような落ち着いた雰囲気の青紫色のことです。江戸中期より婦人の和服の地色として好まれ、明治・大正にかけてたびたび流行しました。明治27年頃には「新駒色」と呼ばれて流行衣装の雑誌『都の華』に紹介されています。
染色法は『染物早指南』（嘉永６年・1853）に「蘇芳水等分、唐藍少々、鉄漿ポッチリ、もも皮少々、石灰水へ入る」と記されています。",https://irocore.com/fujinezumi/
藤紫（ふじむらさき）,"['143', '130', '188']","['50', '50', '00', '00']",#8F82BC,"藤紫（ふじむらさき）とは、藤の花のような明るい青紫色のことです。平安の頃より女性に人気の高い『藤色』と、高貴な色の象徴である『紫』を組み合わせた色名で、藤色よりも紫みが強い色になります。
藤紫が染め色として登場するのは江戸時代後期ですが、明治期の文学作品や美人画などに数多く見られることから、明治文化を代表する色名の一つといわれています。
また、『藤紫』は大正浪漫の女性を虜にしたことから『大正藤 』とも呼ばれました。",https://irocore.com/fujimurasaki/
二藍（ふたあい）,"['136', '138', '188']","['58', '50', '00', '00']",#888ABC,"二藍（ふたあい）とは、藍の上に紅花を染め重ねた明るく渋い青紫色のことです。古くは紅のことを『紅藍 』と表記し、色名はこの紅藍と藍の二色の藍で染めたという意味から。この染色が行われるのは平安時代からで、若年ほど紅を強めに、壮年ほど藍を強くするため、二藍は使用者の年齢によって各種存在していました。『源氏物語』では、“光源氏”が息子の“夕霧”に対し「紅みの強い二藍では軽く見られる」と嗜める場面があります。
二藍は、『源氏物語』の他に『栄華物語』や『蜻蛉日記』などの平安文学でよく見られる当時の人気の色でした。",https://irocore.com/futaai/
二重緑（ふたえみどり）,"['000', '076', '109']","['90', '00', '00', '70']",#004C6D,"二重緑（ふたえみどり）とは、古い藍染め による色で暗い青色のことです。「二重 」とは色の濃さを表し、「藍 」と「黄蘗 」を染め重ねた濃い色合いを意味しています。
古代の日本では『緑色』と『青色』の区別をつけていないため、現代でいえば緑系の色を『青』、青系の色を『緑』と呼ぶことがありました。そのため『藍色』に似ている『二重緑』に『緑』とついても不思議ではありません。
ちなみに「緑」の語源についてですが、古くは濃い緑色を『ソニドリのあお』と呼んでいました。「ソニドリ」とは翡翠（カワセミ）の古名で、「ソニドリ」から転じて「みどり」となっています。
",https://irocore.com/futaemidori/
二人静（ふたりしずか）,"['088', '059', '085']","['25', '50', '00', '70']",#583B55,"二人静（ふたりしずか）とは、暗く渋い紅紫色のことです。『二人静』は能楽の演目で、「静」とは源義経の愛妾「静御前」のこと。室町幕府の八代将軍「足利義政」が二人静を舞ったとき、紫地に鳳凰の丸紋の金襴の衣装をまとったことからこの色名が残りました。ちなみに、鳳凰の丸紋の金襴地も『二人静』と記しますが、この場合は「ににんしずか」と読まれるのが通例です。
『二人静』の花もやはり能の演目からきており、４〜６月に咲く白い小さな花の2本の花序 を静御前とその亡霊の舞姿にたとえたものです。花言葉は「いつまでも一緒に」。
二人静の落ち着いた色は、舞の名手「静御前」の美しさと面影を偲ぶ色名といえます。
二人静金襴
二人静金襴",https://irocore.com/futarishizuka/
葡萄鼠（ぶどうねずみ）,"['112', '091', '103']","['00', '19', '08', '56']",#705B67,葡萄鼠（ぶどうねずみ）とは、葡萄の色を鼠がからせた鈍い赤紫のことです。浮世絵に描かれた着物の地色によく見られる色で、古代では葡萄も｢えび｣と呼ばれたことから、古名で｢えびねず｣ともいいました。また染刷毛 で染汁を引染することを「引く」というが、鼠を引いた葡萄色をいう意味から「引葡萄 」の色名も葡萄鼠と同じように用いられました。,https://irocore.com/budounezumi/
碧色（へきしょく）,"['000', '127', '137']","['90', '00', '34', '35']",#007F89,"碧色（へきしょく）とは、強い青緑色のことです。碧は「碧玉 」を指しており、その中でも「緑碧玉 」の色が元になっています。
碧玉は不純物が多く混じった石英の結晶。混ざっている不純物の違いにより青・赤・緑・紫・黄褐色と様々な色があることから、古代より曲玉・首飾りなどの装飾品として用いられてきました。
我が国では出雲の「玉造石 」、佐渡の「赤玉」、津軽の「錦石 」の一部が碧玉に当たります。また、三月の誕生石であるブラッド・ストーンも碧玉の一つ。
「碧」が付く伝統色には他に『青碧 』や『紺碧 』などがあります。
ちなみに、「碧」の字は「あお」「みどり」と読まれますが、これは青い\b碧を「あお」、緑の碧を「みどり」と石の色によって読み方を変えた名残ではないかと思われます。",https://irocore.com/hekishoku/
紅赤（べにあか）,"['229', '000', '079']","['00', '100', '50', '00']",#E5004F,"紅赤（べにあか）とは、光の三原色のひとつである赤と絵具の三原色の紅の中間の色で、わずかに紫みを含んだ鮮やかな赤色のことです。基本色名に修飾語を組み合わせた「系統色名」の表記では『紅色』と同じ「鮮やかな赤」となっていますが、色見を数値化したもので比べると紅色よりも少し薄い色になります。
一般的に赤みが強く少し暗い色を紅赤とする場合もありますが、正式には色見本の色が本来の紅赤です。
江戸時代、紅色は庶民の憧れの色でしたが、本物の紅は「紅一匁金一匁 」と呼ばれるほど高価であり、金と同じくらいの価値がありました。そのため、庶民は比較的安価な蘇芳や茜を紅の代用としていたようです。そんな紅染めの中でも紅赤は、紅花から黄色の色素を除いて染められており、大量の紅花を使用したことから最も価値のある色でした。
現在でも紅赤の色は人気があり、化粧品やインキの色名のほかにも、地ビールや焼酎、薩摩芋の品種などでもその名がみられます。",https://irocore.com/beniaka/
紅色（べにいろ）,"['225', '052', '076']","['00', '90', '56', '05']",#E1344C,"紅色（べにいろ）とは、紅花の濃染による鮮やかな赤色のことです。または色料の三原色CMYのM100％『マゼンタ』を指す場合もあります。別に「くれない」や「こうしょく」とも読まれ、「こうしょく」の場合はもう少し赤みの強い色になります。
平安時代からの色名で、中国の呉から伝わった藍 という意味の「呉藍 」から「紅 」と呼ばれるように。なお、この場合の藍とは『藍色』のことではなく「染料」を表しています。また、
さらに唐から伝わったという意味で『唐紅（韓紅） 』とも呼ばれていました。
紅花はキク科ベニバナ属の一年草です。古代より紅花から抽出された色素は世界中で用いられ、日本には上代頃に伝来しました。平安の頃から盛んに栽培されており、紅花の花を摘んでから発酵・乾燥させた物が、紅色の染料や口紅などの化粧品、食品の着色料となっています。
ちなみに、紅花はもともと黄色い花であり黄色色素のほうが多いのですが、いくつもの処理を施すことにより黄色色素を除去し紅色色素を取り出しています。
紅花が茎の末から咲きはじめていくのを順次摘み取ることから、「末摘花 」の雅称で呼ばれました。『源氏物語』の「末摘花」も紅花に由来しています。
艶やかな紅色は平安朝の人々に人気でしたが、紅花染は非常に高価であり濃染は『禁色 』とされて高貴な身分しか着用できませんでした。『日本色彩文化史』によれば、絹一疋 を紅色に染めた価格が約二十貫文、これは約米十三石にあたり、現代換算で130万円ほどになります。（※一疋＝二反。一反は大人一人分の布地の量。）
紅染めは江戸時代に入っても変わらず人気でしたが、奢侈禁止令 などにより何度も禁制とされ、それでも紅色系の色を欲した人々によって『甚三紅 』などの紅を使わない色が生み出されることになります。
紅色は古くから多くの人々に愛されたばかりか、日本の国旗の赤丸が『紅色』と定められているなど、我が国にとっても馴染みの深い大切な色と言えそうです。",https://irocore.com/beni-iro/
紅鬱金（べにうこん）,"['203', '131', '071']","['00', '35', '65', '20']",#CB8347,紅鬱金（べにうこん）とは、温かみのある黄みがかった濃い橙色のことです。曲げ物や弓の巻に用いられた樺桜の樹皮の色から名付けられた染色の色名で、西鶴の『好色一代男』(1682)にも記述がみられます。江戸後期の染色の書籍には、「一名紅柑子、紅鬱金と云ふ」と紹介されており、紅柑子や紅鬱金と同じ色の名前として用いられたことが伺われます。,https://irocore.com/beniukon/
紅掛空色（べにかけそらいろ）,"['132', '145', '195']","['32', '26', '00', '24']",#8491C3,"紅掛空色（べにかけそらいろ）とは、かすかに紅がかった淡い空色のことです。色名は、藍で空色に下染した上に紅花で染め重ねる染色法から生まれました。別名『紅碧 』。　

ちなみに、通常『碧』は緑色を指しますが、『紅碧』の場合は『空色 』を指します。
同じように二つの染料をかさねたものに淡い紫系の色で『二藍 』や、鮮やかな青紫の「紅掛花色 」などがあります。",https://irocore.com/benikakesorairo/
紅掛花色（べにかけはないろ）,"['104', '105', '155']","['33', '32', '00', '39']",#68699B,"紅掛花色（べにかけはないろ）とは、あでやかな明るい青紫色のことで、花色の下染に紅を染めた重ねた色です。
『手鑑模様節用』の色譜には「紅かけ花色。古、薄ふたあい」と記されており、色譜としては「二藍 」の系統になります。
紅掛がつく色名としては他に「紅掛空色」や「紅掛納戸」があり、これらの色調は濃淡や色味に多少の違いはありますが青紫系統の粋な色です。",https://irocore.com/benikakehanairo/
紅樺（べにかば）,"['182', '061', '027']","['38', '90', '95', '0']",#B63D1B,紅樺（べにかば）とは、紅色がかった樺色のことです。樺色は蒲の穂に似た茶褐色を指します。変相色に紅樺茶があります。紅樺系統の色は、江戸時代中期頃、小袖の地色として愛好され、「朱さくら」という風雅な名前でも呼ばれました。,https://irocore.com/benikaba/
紅桔梗（べにききょう）,"['156', '48', '141']","['45', '90', '00', '00']",#9C308D,"紅桔梗（べにききょう）とは、桔梗色に紅を重ね染めした色味の濃い紅紫色のことです。
江戸時代から見られるようになった色名ですが、優雅さと気高さと品格を併せ持つ美しい色合いであることから、現代でも着物などの色として人気です。
『桔梗色 』は平安時代から使われている紫系の伝統ある色名。染色技術が向上した江戸期以降に、派生色として『紺桔梗』『桔梗納戸』『桔梗紫』など多くの色が生まれました。",https://irocore.com/benikikyou/
紅消鼠（べにけしねずみ）,"['082', '071', '072']","['00', '13', '12', '68']",#524748,"紅消鼠（べにけしねずみ）とは、紅の上に黒を重ねたような暗い灰みがかった赤紫色のことです。色名の「消」「鼠」ともに色味のないことを表しており、紅の匂いを弱くした鼠色の意味。江戸時代後期に行われた鼠色の変相色で、「四十八茶百鼠」の一つとして知られています。
江戸時代の染色技法の指南書『手鑑模様節用』の新古染色考説には「紅けし鼠　古名くろがき又紅なんどともいふ」と書かれ、『黒柿 』とも『紅納戸 』とも呼ばれていたと紹介されていますが『黒柿』とは色合いが違います。",https://irocore.com/benikeshinezumi/
紅柑子（べにこうじ）,"['204', '82', '41']","['13', '80', '95', '2']",#CC5229,紅柑子（べにこうじ）とは、ミカン科常緑低木のベニコウジの果実のような紅色を帯びた柑子色のことです。江戸後期の染色の書籍「手鑑模様節用」には、「紅かば　一名紅柑子、紅鬱金と云ふ」と紹介されており、紅樺（べにかば）、紅鬱金（べにうこん）と同じ色の名前として用いられたことが伺われます。,https://irocore.com/benikouji/
紅唐（べにとう）,"['212', '87', '80']","['00', '75', '56', '15']",#D45750,"紅唐（べにとう）とは、紅唐桟の織物の色のような黄みがかった渋い赤色のことです。『弁柄色 』と同じとする説もありますが弁柄色よりも鮮やかな色になります。
紅唐とは、もともとは紅色の『唐桟 織り』のことです。唐桟織りは緻密で光沢があり地合いのなめらかな綿縞織物 で、天保年間には身分男女を問わず冬着の生地として大人気でした。特に珍重されたのが赤い地色の『紅唐桟 』です。親しみと憧れをこめて『紅唐』とよばれるようになり、それがいつしか色名として定着しました。
『唐桟』は唐桟縞 とよばれる織物の一種です。『桟留 』または『桟留縞 』ともよばれ、とくに舶来物の高価な桟留を『唐桟留 』と呼びました。そこから略して『唐桟』と呼ばれるようになり、やがて桟留縞織物の総称となりました。なお、桟留の由来はインドのサントメ地方から伝わったからだと言われています。
ちなみに、紅唐の漢字を逆にした『唐紅 （＝韓紅）』という色名もありますが、こちらのほうが古くからある伝統色であり鮮やかな紅色です。",https://irocore.com/benitou/
紅鳶（べにとび）,"['154', '073', '063']","['00', '53', '59', '40']",#9A493F,紅鳶（べにとび）とは、紅色がかった濃い赤褐色です。江戸時代中期ごろに流行しましたが、この時期にはこのほか鳶色をはじめ、｢藍鳶｣、｢紺鳶｣、｢紫鳶｣など鳶系統の色が流行しました。,https://irocore.com/benitobi/
紅鼠（べにねず）,"['160', '111', '112']","['37', '56', '56', '00']",#A06F70,紅鼠（べにねず）とは、赤みがかった鼠色に用いられます。『四十八茶百鼠』として江戸時代に流行した色のひとつです。,https://irocore.com/beninezu/
紅緋（べにひ）,"['232', '057', '041']","['00', '75', '82', '09']",#F83929,"紅緋（べにひ）とは、冴えた黄みの赤色のことです。紅花染めと鬱金 や支子 などの黄みの色を染め重ねられた色。同じような染め色として『猩々緋 』と『黄丹 』がありますが、紅緋はその中間にあたります。英名では『スカーレット』。
古くは『緋 』の色は茜 染めの赤を指し、「あけ」と呼ばれていました。それが平安時代の中頃より茜のかわりに支子の黄を下染めに明礬 媒染 の蘇芳 の赤を重ねた色が染められ、この冴えた赤が「ひ」と呼れるようになりました。いわゆる女官の緋袴 の色。
現在でも「緋色 」といえば、一般的にはこの紅緋の色調を指します。
紅緋の染色は明治初期の『絹糸染物秘傳』によれば、「緋縮緬染粉合セ方。紅花目方一匁、ウコンゴ目方二十匁、焼メウバン一分。酒二勺。ハクライベニコ（舶来紅粉）二分。近来ヒコ（緋粉）ト云モノアル由」と記されており、天然染料と化学染料を併用して染められていたことがわかります。
ちなみに紅緋の色調は、現代で言えば印刷インキの『金赤 』に近い色です。",https://irocore.com/benihi/
紅檜皮（べにひはだ）,"['123', '071', '065']","['00', '42', '47', '52']",#7B4741,紅檜皮（べにひはだ）とは、樹皮を剥いだ時のような赤褐色のことです。檜皮は檜、杉などの樹皮のことで、檜皮色は赤褐色を指します。庶民のための染色なので、楊梅や蘇芳などが使用されたとされています。ちなみに同じ手法で染める紅鳶にくらべて紅染めを1回多くしており、その分、色調が濃い目になります。,https://irocore.com/benihihada/
紅鶸（べにひわいろ）,"['201', '057', '109']","['0', '80', '21', '0']",#C9396D,"紅鶸色（べにひわいろ）とは、紅鶸 の頭頂の羽色に由来する、わずかに紫みをおびた明るい紅色のことです。
紅鶸はスズメ目アトリ科の小鳥で、主に日本北部に冬鳥として渡来します。大きさは雀くらいで頭と胸に鮮やかな紅色を帯びているのが特長です。その鮮やかな色合いは現代でも帯締めなどの小物の色として人気です。
ちなみに、紅がつかない『鶸色』は黄みの強い明るい黄緑色を指しています。",https://irocore.com/benihiwa-iro/
紅藤（べにふじ）,"['208', '147', '191']","['19', '50', '00', '00']",#D093BF,"紅藤（べにふじ）とは、紅がかった藤色のことで、赤みの淡い紫色です。藤色の派生色。染色法は、藍を薄く下染めし紅花で上掛けしたことから『紅掛藤 』とも呼ばれました。
江戸時代後期に特に人気が高く、和装の色としては『藤色』が熟年向きであるのに対し、紅藤は若向きとされていました。そのため『若藤』の別名もあります。また、慣例的に赤みの藤色に『紅藤色』、青みの藤色に『青藤色 』が用いられています。",https://irocore.com/benifuji/
紅碧（べにみどり）,"['132', '145', '195']","['32', '26', '00', '24']",#8491C3,"紅碧（べにみどり）とは、かすかに紅がかった淡い空色のことです。「碧」は一般に緑色を指しますが、「紅碧」の場合は空色を指しており、空色の上に紅色を薄く重ねた色合いを現した色名です。
『手鑑模様節用』に「紅碧。俗にべにかけそらいろといふ」とあるように「紅掛空色 」とも呼ばれました。",https://irocore.com/benimidori/
弁柄色（べんがらいろ）,"['143', '046', '020']","['00', '68', '86', '44']",#8F2E14,弁柄色（べんがらいろ）とは、暗い赤みを帯びた茶色のことです。「ベンガラ」とは、土中の鉄が酸化した『酸化第二鉄』を主成分とする顔料で、染料だけでなく、食料としても多く使われています。インドのベンガル地方で良質のものが取られたことからベンガラの色名がつきました。紅柄、紅殻と書かれることもあります。JISの色彩規格では「暗い黄みの赤」と表記してあります。,https://irocore.com/bengara-iro2/
紅柄色（べんがらいろ）,"['170', '086', '046']","['45', '80', '90', '00']",#AA562E,紅柄色（べんがらいろ）とは、濃い赤みの褐色のことで紅殻、弁柄とも書きます。インドのベンガル地方で産出したことから、「べんがら」と名づけられました。天然に産するものもありますが、今日紅柄は合成されたものが多く使われています。江戸時代の流行色で日差しで変色しにくく、耐熱性にも優れるため、壁や瓦の塗料などに多く用いられた色です。,https://irocore.com/bengara-iro/
本紫（ほんむらさき）,"['106', '052', '136']","['64', '85', '00', '00']",#6846A5,"本紫（ほんむらさき）とは、紫根染 で染められたあざやかな紫色のことです。
紫根染は古くからの『紫色』の染色法で、ムラサキ科の「紫草 」の根で染められました。
江戸時代、贅沢を禁じる『奢侈禁止令 』により紫根染めによる高価な『紫色』の使用が禁制となると、江戸の人々の間で「蘇芳 」や「茜 」といった植物から染めた紫色『似紫 』が大流行となります。
この『似紫』に対し、紫根で染めた『江戸紫 』や『今紫 』といった色を、本物の『紫』という意味で区別したのが「本紫」の呼び名であり、やがてそれが色名となっていきました。
当時の市井 の人々が身につけることができなかった『本紫』。その色名には、本物への憧憬 や羨望 の思いが込められているのかもしれません。",https://irocore.com/honmurasaki/
牡丹（ぼたん）,"['231', '097', '164']","['12', '75', '4', '0']",#E761A4,"牡丹（ぼたん）とは、春から夏のはじめにかけて咲く牡丹の花びらのような紫紅色のことです。
襲の色目としては、平安時代からありましたが、色名として定着したのは江戸時代になってからのようです。
襲の色目は、「表・白、裏・紅梅」で、女房の衣の場合は、表は薄蘇芳、裏を白の袿（うちき）に生絹単という組み合わせで、4月のあいだ着用された小袖、または袷のひとつを指します。",https://irocore.com/botan-iro/
舛花色（ますはないろ）,"['091', '126', '145']","['37', '13', '00', '43']",#5B7E91,"舛花色（ますはないろ）とは、灰みのある淡い青色で、浅葱色に渋みを加えた淡縹系統の色です。江戸後期の人気役者、”五世市川団十郎“が当時の流行の浅葱に渋みを加えた色を市川家の家芸に用い、これが通人の間で評判になりました。
色名の｢舛｣は、市川家の家紋である「三舛 」のことで、花色は『縹色 』の別名、つまり、市川家所用の縹色という意味です。
三升（三つ入れ子枡）紋",https://irocore.com/masuhana-iro/
松葉色（まつばいろ）,"['063', '119', '053']","['60', '00', '80', '50']",#3F7735,"松葉色（まつばいろ）とは、松の葉のような深みのある渋い青緑色のことです。別名を『松の葉色』とも呼ばれ、「枕草子」にもその名が見られる古い色名です。
染色は藍 と刈安 で染められますが、藍を濃くすれば『木賊色 』になります。
江戸時代の『手鑑模様節用 』には「松葉色。古名とくさいろ、寛政年中あいびろうどの名ありて、一時のりうこうたり」とあり、『木賊色』を『松葉色』の古名と紹介していますが、色合いは『松葉色』のほうが黄みが強く、また色名も古くからみられました。
縁起の良い松の葉に因んだ色名はとても多く、『老松 』『若緑 』『老緑 』『千歳緑 』『常磐色 』など、いずれも「おめでたい色」とされました。この『松葉色』も、生命力をあらわす「吉色」として使われています。

松の葉
松の葉",https://irocore.com/matsuba-iro/
蜜柑色（みかんいろ）,"['240', '131', '000']","['00', '45', '100', '06']",#F08300,"蜜柑色（みかんいろ）とは、蜜柑の果実の表皮のような黄赤色のことです。JISの色彩規格では橙色よりも少し赤みが少なく黄色みが強いとされています。
蜜柑はミカン科の常緑小高木で、皮がむきやすく、甘みのある果実の総称です。
国産の温州 みかんが代表的で、そこから『柑子色 』より色鮮やかな『蜜柑色』が生まれました。『蜜柑色』は温州みかんが普及した明治時代に生まれた色名です。",https://irocore.com/mikan-iro/
水浅葱（みずあさぎ）,"['140', '210', '188']","['45', '00', '20', '00']",#8CD2BC,"水浅葱（みずあさぎ）とは、文字通り「水色がかった浅葱色 」の意味で、緑みの淡い青色のことです。
『手鑑模様節用 』の色譜には『水浅葱』について「俗にのぞき色とも又かめのぞきともいふ」と記されています。
藍染 の薄い色は緑がかっており、『水浅葱』は『水縹 』や『水色』と同様に緑みのある淡い青色です。なお、紫みのある淡い青色は一般的に『空色』と呼ばれます。",https://irocore.com/mizuasagi/
水色（みずいろ）,"['127', '204', '227']","['55', '00', '10', '00']",#7FCCE3,"水色（みずいろ）とは、澄んだ水の色を模した淡い青色のことです。『水浅葱 』をやや淡くし、藍がからせた染め色をいいます。
『万葉集』には『水縹 』の名で、平安文学には｢水の色｣と記述がみられるなど、古くから親しまれてきた色です。また江戸時代には、『空色』や『浅葱色 』と共に夏の着物の色として愛用され、帷子の地色として流行しました。",https://irocore.com/mizu-iro/
水柿（みずがき）,"['181', '108', '96']","['36', '67', '59', '0']",#B56C60,水柿（みずがき）とは、うすい灰みの紅赤色のことです。江戸時代は渋柿と弁柄で染めた柿渋色を「柿」と呼んでいました。本字は水柿と書きます。水柿の名は水色がかった柿色の意で、柿色は染料を何度も染め重ねることで色を濃くしていきます。別名、鴇浅葱とも。,https://irocore.com/mizugaki/
み空色（みそらいろ）,"['108', '155', '210']","['60', '30', '00', '00']",#6C9BD2,"み空色（みそらいろ）とは、明るく澄んだ秋の空のような薄い青色のことです。色名の「み空」は「空」を上品に呼んだ美称 であり、漢字では「御空 」と表記します。
ちなみに、「み・御」は神や自然、皇室など神聖なものをあらわす場合によく使われる接頭語で、主に尊称として使われています。他にも「み山」「み雪」「み吉野」など。
空に由来する伝統色としては、一般的な『空色』『真空色 』『空天色 』、さらに『天色 』などどさまざまな色名がありますが、そんな中でも『み空色』は接頭語の「み」をつけることで空に対する敬意をこめた、美しく高潔な色といえそうです。

み空
み空",https://irocore.com/misora-iro/
密陀僧（みつだそう）,"['253', '224', '165']","['00', '15', '40', '00']",#FDE0A5,"密陀僧（みつだそう）とは、古代から用いられた黄色顔料で赤みを帯びたうすい黄色のことです。
名前のは由来はペルシャ語の「mildassa」を音訳したとされています。
鉛を焼いて得られる一酸化鉛 による顔料で、古くから壁画などに用いられました。代表的なものでは法隆寺所蔵の仏教工芸「玉虫厨子 」（制作は飛鳥時代）が有名です。
『密陀僧』は鉛の酸化状態によって色合いが微妙に異なり、薄く灰色に近い色を『銀密陀 』、黄みの濃い色は『金密陀 』と呼ばれます。
また、同じ酸化鉛を用いた顔料には『鉛丹 』もあり、こちらも古くからの色名です。
余談ですが、「密陀僧」はα型一酸化鉛の別名でもあり、古くは顔料の『密陀僧』の原料でした。ただ、一酸化鉛は毒性が強いため、現在ではほとんど使われていません。


",https://irocore.com/mitsudasou/
緑（みどり）,"['062', '179', '112']","['65', '00', '37', '30']",#3EB370,緑（みどり）とは、成長した樹葉のような深い緑色のことです。露草による青色と刈安、または黄檗の黄で染めました。古くは、寒色系統の色を「あお」と呼びましたが、特に深い緑色を指す場合は、鴗鳥（そにどり：翡翠かわせみの古名）の羽根の緑色にちなんで「そにどりのあお」と呼んでいました。和名「みどり」はその「そにどり」の転じたものともいわれています。ちなみに、草木が緑に色づいたことを「青い」と形容する、青山、青田、青葉などの青は、青色ではなく緑色を表していますが、これは緑と青の色の区別がなかった訳ではなく、言葉として使い分けていなかった為です。,https://irocore.com/midori/
湊鼠（みなとねずみ）,"['119', '150', '154']","['63', '38', '40', '00']",#77969A,"湊鼠（みなとねずみ）とは、薄い青緑みの鼠色のことです。色名の由来は、大阪の湊村でつくられていた、壁や襖の腰貼り などに使われた湊紙から。『手鑑模様節用』の中で、「みなと鼠。此のころ流行して”深川鼠”と云ふ」とあり、『深川鼠』とも呼ばれます。
江戸後期には、前期の豪華で派手な色に対して粋で洒落た感じの色が好まれるようになり、湊鼠のような鼠系統の色が『四十八茶百鼠 』として大流行しました。",https://irocore.com/minatonezumi/
水縹（みはなだ）,"['126', '199', '216']","['50', '00', '13', '05']",#7EC7D8,"水縹（みはなだ）とは、藍染 の薄い色で明るい青色のことです。別に『みずはなだ』とも読まれ、『万葉集』にもその名が見られます。『水色』の古い色名で中世の頃までは混在して使われていました。しかし、江戸の頃になると完全に『水色』のほうが主流になり、今日 にいたります。
ちなみに、『縹 』とは藍染で染められた青色のこと。藍染は明るく染めると緑みがかって見え、濃く染めると紫みがかって見えます。『水縹』は『縹色』を水で薄めたような色という意味を『水』をつけることで表している色名です。『延喜式 』に記された『浅縹 』とは混同されることが多いですが、『水縹』のほうがわずかに淡い色になります。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/mizuhanada/
海松色（みるいろ）,"['089', '099', '039']","['26', '00', '70', '70']",#596327,"海松色（みるいろ）とは、海藻の海松 の色を表した茶みを帯びた深い黄緑色のことです。「海松」の名は万葉の頃より見られますが、服色名として定着するのは平安以後から。
重 ねの色目としては「表地・萌黄、裏地・縹」を配して海中の岩に生える海藻、海松の色を表現しています。
海松とは浅海の岩石につく緑藻 の一種。色は深緑色。枝は二叉分岐して扇状に広がり、高さ40cmほどに成長します。現代の日本ではあまり食べられませんが、古代には一般的な食用の海藻として親しまれていました。そのため『万葉集』にも「見る」の掛詞 として多数詠まれています。
海松は色名になった他に、枝の先が揃っており形状が面白いことから伝統的な文様としても使われ「海松模様 」と呼ばれています。
『海松色』はオリーブ系の色があまりなかった我が国ではとても親しまれ、幽玄でクールなその色調が質実剛健を旨 とした鎌倉武士や、室町時代の文化人に深く愛好されました。
また江戸時代には茶みを強くした流行色の『海松茶 』や青みが強い『海松藍 』、さらに『藍海松茶』などの変相色が数多く誕生することになります。",https://irocore.com/miru-iro/
海松茶（みるちゃ）,"['087', '084', '061']","['52', '40', '59', '29']",#57543D,海松茶（みるちゃ）とは、海松色を褐色がらせた暗い黄緑色のことです。海松色の変相色で、江戸時代に広く愛用されました。もとの海松色に近いものを素海松茶、少し黄みのあるものを黄海松茶と呼んでいます。,https://irocore.com/mirucha/
麦藁色（むぎわらいろ）,"['227', '197', '118']","['00', '17', '55', '15']",#E3C576,"麦藁色（むぎわらいろ）とは、麦藁の色のような赤みを帯びたくすんだ黄色のことです。麦藁帽子の色。英名では『ストロー』。麦わら自体は古くからありますが、色名としては日本古来のものではなく、明治以降に西洋から『ストロー色』が伝わった際に和訳してできたものでしょう。
「淡い麦藁色の輝き」などのように白ワインの色を表現する際によく使われる色です。
麦藁は麦の穂を落としたあとの茎の部分。屋根を葺 いたり、麦藁帽子や細工物の材料として使用します。「麦稈 」「むぎから」とも。麦わら帽子の略。夏の季語。
ちなみに、麦藁蛸 といえば６〜７月の麦藁ができる時期にとれる旬の蛸のことです。",https://irocore.com/mugiwara-iro/
槿花色（むくげいろ）,"['211', '131', '167']","['00', '60', '00', '10']",#D283A7,"槿花色（むくげいろ）とは、木槿 の花のような明るく渋い紅色のことです。
古くからの色名で、国史書の「群書類従 」の「装束部」にその名が見られます。染色法は伝わっていませんが、江戸時代には蘇芳 の鉄媒染 により染めていたようです。
余談ですが、平安の頃は「槿」の字を「あさがお」と読んでいたことから、「源氏物語」の「朝顔」は木槿 を指しているとの説もあります。
ムクゲは、アオイ科フヨウ属の落葉樹。夏の暑い盛りに10～20cmほどの大きな美しい花を咲かせる。庭木として広く植栽され、武家によっては子供が生まれると、そのたびにムクゲを植える習慣があったという。
ムクゲの花は、朝開き、夕にはしぼんでしまう「一日花」と言われているが、これは誤解で実際は数日持つ花もある。
木槿の花には白や赤など様々な色がありますが、「槿花一日の栄」や「槿花一朝の夢」の諺もあるように「儚 い」イメージがあります。
『槿花色』の色合いも、赤や白ではなく、あえてこの色にすることでその儚さを表しているのかもしれません。
槿花（ムクゲ）",https://irocore.com/mukuge-iro/
虫襖（むしあお）,"['038', '069', '061']","['90', '63', '66', '30']",#20604F,"虫襖（むしあお）とは、玉虫の翅 のような暗い青みのある緑色のことです。別名「夏虫色」とも。
玉虫の翅は光の角度により緑や紫色に光を放ちますが、織物で玉虫色を表すには、縦糸を緑に横糸を赤みの紫追ったものがそれに近いと云われます。
襲の色としては、「表・青黒、裏・二藍 または薄色」を配して玉虫の色を表現しています。",https://irocore.com/mushiao/
蒸栗色（むしくりいろ）,"['239', '234', '204']","['00', '02', '20', '10']",#EFEACC,"蒸栗色（むしくりいろ）とは、蒸した栗の皮を向いた実のような、緑みがかった淡い黄色のことです。栗の実に由来する色といえば赤茶色の『栗色』や『栗皮色 』を想像しがちですが、蒸栗色は炊きあがった栗ごはんの間から顔を出す美味しそうな栗の実の色です。
蒸栗色の色名がいつ頃から使われるようになったかは不明で、古代中国の辞書『爾雅 』にこの色名が記されていますが、その色は我が国の蒸栗色とは違うという説もあります。
「栗」のつく色名には、ほかにも栗の皮のような茶色の『落栗色 』『栗皮茶 』や、やや赤みの明るい栗色の『栗梅 』など多数あり、栗がいかに我々日本人に身近な存在だったかがよく分かります。


",https://irocore.com/mushikuri-iro/
紫（むらさき）,"['136', '072', '152']","['100', '100', '07', '00']",#884898,"紫（むらさき）とは、紫根 で染められた絹のような赤と青の中間の色のことです。または紫系統の色の総称。虹を構成する七色のひとつ。飛鳥時代（五九二〜七一○）にはその名が見られる非常に古い色であり、現代ではJIS規格に定められた基準色でもあります。
名前の由来は多年草の「紫草 」の根（紫根 ）で染められたことから、色名も「ムラサキ」と呼ばれるようになりました。
平安文学にも数多く登場する日本文化を象徴する植物で、乾燥した根（紫根）は生薬や染料として珍重されてきた。近年は絶滅の危機にひんしている。
三代格式のひとつ「延喜式 」では、紫根 の単一染めを『深紫 』と『浅紫 』の二級にわけていますが、この中間にあたる『中紫』が一般的な『紫色』にあたります。
古代より『紫』は宮廷の位階 の色である当色 において上位の色であり、僧侶の最高位を表す「紫の袈裟 」も勅許 がなければ着用を許されませんでした。
平安時代に編纂された歴史書「日本三代実録 」（九○一）には、五世以下で位階五位の皇族“豊前王 ”が禁色である紫の衣を着ていたことを咎められ緋色の衣に改めたと掲載されており、この制度が厳格に守られていたことがわかります。
「法不聽着紫。豊前爲五世五位着紫。爲有司所糺。然後着緋。」貞観7年2月2日条（八六五）　：日本三代実録
江戸時代に入ると庶民は紅花染 めの『紅』とともに紫根染 めの『紫』が禁制となりました。そのため安価な染料を使った代用の紫染めを開発し『似紫 』として流行します。市井 の人々もそれほど『紫』を求めていたのでしょう。
ちなみに、『似紫』が流行したため、伝統的な紫根染めは『本紫 』と呼ばれ区別されるようになりました。
いつの時代においても『紫』は人々の憧れの色でもあり、現代でも「紫綬褒章 」のような栄誉ある色のひとつとなっているのも、我が国の紫を尊ぶ文化があるからでしょう。
余談ですが、『紫』は英語では『パープル（purple）』と訳されますが、JIS規格では『紫』と『パープル』は異なる色となっており、伝統的な『紫』は『ロイヤルパープル（Royal purple）』にあたります。",https://irocore.com/murasaki/
紫式部（むらさきしきぶ）,"['144', '050', '109']","['20', '80', '00', '40']",#90326D,"紫式部（むらさきしきぶ）とは、紫式部の実のような赤みのある渋い紫色のことです。
紫式部は山野に自生するクマツヅラ科の低木で、紫色の小さな実がたくさん重なり合ってなります。その実の色からこの色名ができました。
かつてはその様から「紫重実 」「紫敷実」と呼ばれていましたが、その呼び名が紫式部を連想させることから、いつしか「むらさきしきぶ」と呼ばれるようになったようです。
ちなみに、紫式部によく似た植物に「コムラサキ」がありますが、こちらは別種であり、またこの植物に因んだ『小紫 』という色名もあります。",https://irocore.com/murasakishikibu/
紫鳶（むらさきとび）,"['095', '065', '075']","['00', '32', '21', '63']",#5F414B,紫鳶（むらさきとび）とは、暗く灰がかった赤紫色のことです。蘇芳を主染料にして染めた、鳶色の変相色です。江戸中期の安永・天明の頃に小袖や女性の衣服の裏地に愛好され大流行したといいます。,https://irocore.com/murasakitobi/
滅紫（めっし）,"['089', '066', '085']","['00', '26', '04', '65']",#594255,"滅紫（めっし）とは、灰みのある暗い紫色のことです。色名の「滅 」は、「けし」とも読み、赤みや紫みなどの色がとれて黒みのくすんだ色になるという意味で「けしむらさき」とも読まれます。『延喜式縫殿寮 』によれば、深滅紫・中滅紫・浅滅紫の3つに分けられていました。紫草の根（紫根 ）による染色は、低温で染める「紫」や「葡萄」のように華やかな紫になりますが、高温になるにつれ紫みが失われ、灰色がかった暗い紫色になります。滅紫は紫根を90度以上の高温で染めたものです。
「縫殿寮 」の項目に、衣服や染色材料などについて詳細に記されている。",https://irocore.com/messhi/
萌木色（もえぎいろ）,"['167', '189', '000']","['40', '00', '100', '15']",#A7BD00,萌木色（もえぎいろ）とは、春先に新緑が萌え出るような緑色のような冴えた黄緑色のことです。平安時代から用いられた伝統ある色名で、「萌黄」とも書き、また葱（ねぎ）が萌え出る色ということで「萌葱」とも書きます。萌黄色の場合は少し黄みがかった色を、萌葱色の場合は濃い緑色を指しています。ちなみに、歌舞伎の定式幕の色も、黒、柿、そして萌葱色です。,https://irocore.com/moegi-iro2/
萌葱色（もえぎいろ）,"['0', '109', '77']","['80', '0', '65', '50']",#006D4D,萌葱色（もえぎいろ）とは、萌え出る葱（ねぎ）の芽のような緑色のことです。平安時代から用いられた色名で、青みがかった色を「萌木」、黄みがかった色を「萌黄」とも書きます。ちなみに、歌舞伎の定式幕の色も、黒、柿、そして萌葱色です。,https://irocore.com/moegi-iro3/
萌黄色（もえぎいろ）,"['167', '189', '000']","['50', '00', '100', '10']",#86B81B,"萌黄色（もえぎいろ）とは、春先に萌え出る若葉のようなさえた黄緑色のことです。平安時代から用いられた伝統ある色名で、別に『萌木』とも表記します。
『萌黄色』は新緑の若木の色ということから若さを象徴する色であり、平安時代では若者向けの色として愛好されました。
「平家物語」では十八歳の平家の貴公子 “平敦盛”が萌黄縅 の鎧を着ていたり、二十歳の弓の名手 “那須与一”が萌黄匂 の鎧を着ているなど、『萌黄色』が若武者の象徴として使われています。
『萌葱 』とも書かれますが、この場合は青葱 に由来する濃い緑色を指しており、江戸の頃に流行しました。ちなみに歌舞伎の定式幕の色が、『黒』『柿』『萌葱色』です。",https://irocore.com/moegi-iro/
木蘭（もくらん）,"['199', '179', '112']","['00', '10', '44', '22']",#C7B370,"木蘭（もくらん）とは、中国渡来の木蘭の樹皮を染料として染められた香色や黄橡（きつるばみ）のような薄茶系統の鈍い黄褐色のことです。位の高い僧侶の袈裟の色の一つです。
襲の色としては、「表・黄、裏・黒」を配した色目で、やや黒みがかった黄色を表と裏の重なりで表現したと思われます。
",https://irocore.com/mokuran/
紅葉色（もみじいろ）,"['226', '066', '031']","['00', '86', '90', '05']",#E2421F,"紅葉色（もみじいろ）とは、晩秋の赤く色づく楓 のようなあざやかな赤色のことです。　
古くからの色名で、もとは平安装束の重 ねの色目『紅葉 』に由来しています。
「もみじ」とは｢色を揉み出ずる｣が語源で、植物が色づくことを指していました。中でも楓が最も美しく色づくことから、いつしか楓を「もみじ」とも呼ぶようになったのです。
重ねの色では『表赤・裏濃赤』の色目で、真っ赤に色づく楓の葉の重なりを表しています。出典：『雁衣鈔 』
また、他にも『表黄色・裏蘇芳』という説もあり、こちら黄葉 ・紅葉 した楓の二色を表現したものでしょう。
（他に5説ほどあり）
もちろん、重ねの『紅葉』の着用時期は秋です。


楓 （カエデ）

楓（カエデ）とは、ムクロジ科カエデ属の落葉高木。「モミジ」とも呼ばれる。
日本でもっとも多く見られるのはイロハカエデ（イロハモミジ）。


また紅葉 は、花札の10月札のモチーフとしても有名。余談だが、この花札の鹿がそっぽを向いていることから「シカト」の語源になった。


「紅葉」が付く重 ねの色も、『紅紅葉 』『青紅葉 』『黄紅葉 』『初紅葉 』『櫨紅葉 』『楓紅葉 （蝦手紅葉）』と数多く、またモチーフも楓に限らず、櫨 や楡 など様々な樹々による紅葉 を表しています。

「もみじ」は古来より日本人にとって身近で、『万葉集』でも「もみじ」を読んだ歌は百首を超えます。なお、古代では「黄蘗」を「もみじ」と読んでいました。

秋の山野に輝く赤を表現した『紅葉色』は、日本の秋を代表する色といっても過言ではないかもしれません。

赤く色づいた紅葉

",https://irocore.com/momiji-iro/
桃色（ももいろ）,"['245', '143', '152']","['0', '55', '25', '0']",#F58F98,桃色（ももいろ）とは、桃の花のような、紅花で淡く染めた色のことです。その起源は古く、万葉集にはすでに「桃花褐（ももそめ）」という記述が見られます。ただし、今日では必ずしも桃の花で染色した色のことを意味せず、桃の花のような淡い赤色のほとんどを桃色もしくはピンクと呼ぶ傾向にあります。英語にもピーチという色名がありますが、これもやはりモモの果肉に近い色で表現され、モモの花の鮮やかなピンクを表す場合にはピーチブロッサム（peach blossom）という色名が用いらています。,https://irocore.com/momo-iro/
百塩茶（ももしおちゃ）,"['114', '073', '056']","['61', '70', '68', '25']",#724938,百塩茶（ももしおちゃ）とは、赤みの焦茶色のことで、今日の「チョコレート色」に近い色です。百塩の「百」は回数の多いこと、「塩」は「入」で浸染をいい、何回も染め重ねた濃い色を指しています。「百塩茶」はその染法から名付けられた江戸時代の染色です。別名「羊羹色」とも呼ばれ、僧侶の袈裟が色褪せた黒色として形容として使われました。,https://irocore.com/momoshiocha/
桃花色（ももはないろ）,"['249', '174', '165']","['00', '45', '30', '00']",#F9AEA5,"桃花色（ももはないろ）とは、美しく咲く桃の花のような淡い紅色のことです。色調的には鴇色 よりもやや淡く、桜色より赤みが強い色になります。女性らしい色合いのため、江戸時代には女性の肌着や裏地によく使われました。
古代では桃という字は「つき」と読まれており、『日本書紀』にも「桃染布 」との表記が見られるように万葉の時代から用いられた古い色名です。",https://irocore.com/momohana-iro/
柳色（やなぎいろ）,"['173', '180', '069']","['19', '00', '75', '30']",#ADB445,"柳色（やなぎいろ）とは、初夏の柳の葉色を思わせる明るい黄緑色のことです。
古くからの色名で、重色目 や織色 などにもその名が見られるなど、平安時代、柳の色は盛んに使われていました。実際、『紫式部日記』にも「左京は青色に柳の無紋の唐衣 」「柳の上白 の御小袿 」との表記が見られます。
重色目では「表 白・裏 淡青 」で表し、薄い緑色の色目から、別に『薄柳』とも呼ばれました。出典：『装束抄』
また、別説には「表 淡青・裏 淡青」などがありますが、どちらの説の『青』も現代でいう『緑色』の色調です。
『柳』の着用時期は、冬より春です。
柳に因んだ重色目は、この他にも『面柳 』『黄柳 』『青柳 』『花柳 』『柳重 』などがあり、様々な柳の色調を表現しました。
織色 では、経糸 が『萌葱 』、緯糸 を『白』で柳の色を表現しています。
柳（ヤナギ）は、ヤナギ科ヤナギ属の落葉性の樹木の総称。
日本では「ヤナギ」と言えば、一般的に枝垂柳（シダレヤナギ）を指す。
また柳は、花札11月札のモチーフとしても有名。ちなみに、絵札の人物は平安時代の能書家“小野道風 ”。
禅語の「柳緑花紅 」「柳はみどり、花はくれない」という言葉もある通り、日本では柳は古くから身近で愛好された植物です。そのため、柳にちなんだ色名は非常に多く、平安時代の『青柳』や『面柳』『裏柳』、江戸時代の流行色となった『柳鼠』『柳茶』など十数種類も存在しています。
『古今和歌集』に「見渡せば 柳桜をこきまぜて 都ぞ春の 錦なりける」の歌もあるように、『柳色』は『桜色』とともに、日本の春の色の代名詞といえるでしょう。
水辺の枝垂柳
水辺の枝垂柳",https://irocore.com/yanagi-iro/
柳煤竹（やなぎすすたけ）,"['074', '089', '061']","['76', '57', '70', '17']",#4A593D,"柳煤竹（やなぎすすたけ）とは、灰がかった暗い黄緑色のことです。江戸時代元禄期に作られた人気の『煤竹色 』からの派生色で、緑みがかったことを表すため「柳」という字があてられました。
江戸前期の『當世染物鑑 』（元禄九年・一六九六）の序に「色々の茶ぞめ、すす竹、替りたる染出し有之……」とあり、この頃『煤竹色』の変わ染めとして現れたようです。
柳煤竹の染色法は楊梅皮 の煮汁で下染した上に、鉄漿 や明礬 の媒染で発色させました。これが江戸末期には薄浅黄 と刈安 で染めた、かなり明るい色に変化していきました。ちなみに、この柳煤竹をさらに黒ずませたのが『柳煤竹茶 』です。",https://irocore.com/yanagisusutake/
柳染（やなぎそめ）,"['147', '184', '129']","['20', '00', '30', '28']",#93B881,"柳染（やなぎそめ）とは、柳の葉の色のようなかすかに灰色を含んだ黄緑色のことです。別名「柳葉色」とも。柳はヤナギ科ヤナギ属の落葉高木で、並木として一般的な枝垂柳 は梅などと共に奈良時代に渡来しました。平安貴族にも愛好され、その名は『宇津保物語』に「やなぎがさね」、『源氏物語』に「柳の汗杉 」、『栄花物語』に「柳の唐衣」と見えますが、これらは襲や織色のことで、染色の柳としては江戸時代からになります。
ちなみに柳の付く色名は、他に草柳、裏柳、柳茶、柳鼠などがあります。",https://irocore.com/yanagisome-2/
柳茶（やなぎちゃ）,"['163', '168', '108']","['13', '00', '50', '40']",#A3A86C,"柳茶（やなぎちゃ）とは、茶がかかった柳染の意で灰色をおびた鈍い黄緑色のことです。『柳染 』に黄みと灰みが加わった変相色。江戸中期に生まれた色名で『染物重宝記』にもその名がみられます。柳茶の染法は『染物屋覚書』に「京鼠 の上へ刈安 二度引。あく留」と紹介されており、この時代の『茶』の系統では「うす茶」に分類されました。
『手鑑模様節用 』の『威光茶 』の色譜には「威光茶。或いは柳茶ともいふ。」との記述があり『威光茶』と『柳茶』は同色と紹介されていますが、二色を比べると『柳茶』のほうがより黄みがかっています。
江戸の頃、柳の木は身近な樹木であったためか、柳に因 んだ染色が他にも『柳煤竹 』や『柳鼠 』など多数生まれました。
『柳茶』のやわらかい色合いは、新緑の柳の芽の色を思わせます。",https://irocore.com/ynagicha/
柳鼠（やなぎねずみ）,"['200', '213', '187']","['06', '00', '12', '16']",#C8D5BB,柳鼠（やなぎねずみ）とは、柳の緑色を帯びた鼠色の意で、薄い緑がかった鼠色のことです。江戸時代後期に現れた「四十八茶百鼠」のように一つの色が茶と鼠の二種の色名で呼ばれるのは低彩色の色だから。一般に『茶』の名で呼ばれる色は渋みや暖味を表し、『鼠』と呼ばれる色はクールでやわらかい色調を表しています。当然、柳鼠の変異色として柳茶という色名も存在します。,https://irocore.com/yanaginezumi/
山藍摺（やまあいずり）,"['103', '162', '160']","['50', '00', '25', '30']",#67A2A0,"山藍摺（やまあいずり）とは、染料植物の山藍 で摺 り染めた布の色で、灰色がかった青緑のことです。
山藍による摺染 めは、『万葉集』にも「山藍もち 摺 れる衣 きて」の一文がみられる古い染色技法。しかし、色落ちが早く、蓼藍 を使った藍染 めが平安期以降に普及したこともあり、徐々に廃 れていきました。
ただし、現在でも宮中で行われる神事用の衣服の染色として伝わっており、新嘗祭 に用いられる「小忌衣 」の文様は山藍で染められているそうです。
※新嘗祭（にいなめさい）とは、十一月二十三日に行われる宮中行事のひとつ。大祭。祝日の勤労感謝の日のルーツ。

※小忌衣（おみごろも）とは、飛鳥時代から伝わる神事などに用いられる上衣 。ちなみに「忌」という文字は畏 れ敬 う意味があります。


『山藍摺』の色合いは、植物による日本最古の染色方法ということもあり、染色された色目や染色技法の記録も残っていないため正確には分かっていません。

色相は『青』と伝わっていますが、インジゴ（青色色素）を含まない山藍の葉の摺染 では緑にしかならないことや、当時の『青』は緑系も含む色合いであったことから、緑色だという説もあります。
ただ、山藍の茎や根にはインジゴとは別の青色色素が含まれているので、完全に『緑』とも言い切れません。

※このページで紹介している『山藍摺 』の色見本は、“辻村喜一”氏が昭和五十一年に再現した山藍染めを参考にしています。


山藍（やまあい）

山藍（やまあい）とはトウダイグサ科の宿根草 （多年草）。高さは約40cmほどで、山地に群生します。対生した葉は長楕円形で、春から夏にかけて緑色の小花を穂状につけます。

飛鳥時代には摺り染めの染料とされた最古の染料植物ですが、タデ科の蓼藍 や、キツネノゴマ科の琉球藍 と違ってインジゴ（青色色素）を含まないので、藍染のような浸し染めには向きません。



古くから我が国に自生する山藍は、後に渡来した蓼藍と違い、日本古来の純潔な染料植物として今でも神事に使用され、大切にされています。
そんな山藍で染めた『山藍摺』の色もまた、「神聖な色」といえるかもしれません。

山藍：ものづくり工房 ひとつ屋


",https://irocore.com/yamaaizuri/
大和柿（やまとがき）,"['239', '174', '124']","['00', '38', '50', '05']",#EFAE7C,"大和柿（やまとがき）とは、江戸時代の人気役者に由来する、ややくすんだ明るい橙色のことです。『柿色』を薄すくしたような色。なお、果物の柿の品種にも「大和柿」がありますが、こちらは「大和地方の柿」という意味であり、色名との関連はありません。
『大和柿』は江戸後期の歌舞伎 役者・三代目“坂東三津五郎 ”が好んだ色で、当時の流行色のひとつ。坂東流は踊りの名手であったため特に女性に好まれたようです。
ちなみに、色名の「大和」は三津五郎の屋号「大和屋 」にちなんで名付けられました。
歌舞伎役者の名前を冠した伝統色は、『団十郎茶 』『璃寛茶 』『路考茶 』『芝翫茶 』など数多くありますが、このような役者色は現在でも歌舞伎の「一門の色」として大事にされています。
余談ですが、先ほど紹介した役者色の中でも『芝翫茶』は、当時、坂東三津五郎と人気を争った三代目“中村歌右衛門 ”にちなんだ色名であり、ある意味『大和柿』のライバル色といえるかもしれません。
三代目“坂東三津五郎”（ばんどうみつごろう　1775-1832）は、江戸後期の歌舞伎役者。文化文政期を代表する花形役者で、日本舞踊坂東流の祖。和実、変化舞踊などの所作事を得意とし、上方の名優・三代目中村歌右衛門と舞台で芸を競いあっていました。現在でもしばしば上演される「汐汲」「傀儡師」「まかしょ」「玉兎」などは、三代目の初演した変化舞踊の一部であり、日本舞踊の坂東流の基礎をきずいています。",https://irocore.com/yamatogaki/
山鳩色（やまばといろ）,"['118', '124', '107']","['05', '00', '14', '51']",#767C6B,"山鳩色（やまばといろ）とは、山鳩の羽のような灰みの強い鈍い黄緑色のことです。山鳩とは青鳩のことで、色名はその羽の色に由来しています。「麹塵」や「青白橡」は同じ色であり、禁色 における「青」をあらわす一般の使用が禁じられた色でした。
ちなみに、天皇が平常着用された袍 の色で、「山鳩色の袍」または「麹塵の袍」「青白橡の袍」と呼ばれていたようです。
染色方法は、青白橡や麹塵と同様に刈安と紫根で染められていました。",https://irocore.com/yamabato-iro/
山吹色（やまぶきいろ）,"['248', '180', '000']","['00', '36', '95', '00']",#F8B400,"山吹色（やまぶきいろ）は、山吹の花のような鮮やかな赤みを帯びた黄色のことです。　色名は黄色の花を咲かせる植物の山吹に由来し、平安時代より用いられてきました。また『花山吹』として重 ねの色目 にもなっており「表、朽葉色 ・裏、山吹色」等があります。
山吹はバラ科ヤマブキ属の落葉低木。北海道から九州まで広く分布し、美しい花を咲かせることから万葉の頃より親しまれてきました。山の中に生え、しなやかな枝が風にゆれる様子から『万葉集』では「山振 」と呼ばれ、転じて「山吹」になったと言われています。晩春に花が咲くことから春の季語。
山吹の花の色が黄金に似ていることから、別名『黄金色 』とも呼ばれ、また逆に江戸時代の隠語では、「賄賂 の小判」が『山吹』と呼ばれました。",https://irocore.com/yamabuki-iro/
山吹茶（やまぶきちゃ）,"['200', '153', '050']","['00', '24', '75', '22']",#C89932,山吹茶（やまぶきちゃ）は、茶がかった赤みの深い黄色のことです。金色に近い色合いのため、別名金茶（きんちゃ）とも呼ばれます。江戸時代後期に書かれた『手鑑模様節用』の色譜に「山ぶき茶。古名支子染」と記されています。この支子染とは、紅花と支子とで黄橙色に染めたもののことです。,https://irocore.com/yamabukicha/
楊梅色（やまももいろ）,"['198', '163', '091']","['00', '23', '60', '30']",#C6A35B,"楊梅色（やまももいろ）とは、明るく渋い黄褐色のことです。楊梅 はヤマモモ科ヤマモモ属の常緑高木で、食用の鮮やかな暗紅色の甘酸っぱい実を付けます。ただし、楊梅色はこの実の色ではなく樹皮を染材として染められた布の色です。
楊梅の樹皮を乾燥させたものは『楊梅皮 』とよばれ、古代より茶系の代表的な染材として、『茶色』の色名よりも古くから用いられてきました。
『楊梅色』はこの染材に明礬 を混ぜて染められた布の色で、鉄塩を用いると『焦茶』に染まります。
江戸時代に茶系が流行したことから、楊梅皮は広く用いられました。
楊梅の実
",https://irocore.com/yamamomo-iro/
雄黄（ゆうおう）,"['238', '157', '025']","['00', '45', '90', '05']",#EE9D19,"雄黄（ゆうおう）とは、明るい鮮やかな黄色のことです。硫化砒素 を主成分とする鉱物の『石黄 』から作られた顔料の色。石黄は『雄黄 』とも呼ばれ、それが色名の由来です。
ちなみに石黄は厳密には色が淡いものを「雄黄 」と呼び、色が濃いものを「雌黄 」と呼んで区別していました。古くは「雄黄 」を「鶏冠石 」と呼んでいましたが、現在では「雌黄」の別称が「鶏冠石」とされています。
石黄は純度の高いものほど黄色が鮮やかであり、各地で産していましたが、毒性が強く、現在は顔料として使用されていません。その危険性は江戸後期の読本『雨月物語 』で、蛇の化身を退治するために雄黄を用意させる場面があるほどです。
雄黄は平安時代の歴史書『続日本紀 』に記載がみられるほど古い顔料ですが、昔の日本画にあっても、その豊かな黄色は現在まで保たれています。",https://irocore.com/yuuou/
柚葉色（ゆずはいろ）,"['0', '101', '67']","['80', '00', '68', '55']",#006543,"柚葉色（ゆずはいろ）とは、濃く暗い緑色のことです。文字通り柚子の葉に由来する色で、別に「ゆばいろ」とも読まれます。
柚子はミカン属の常緑小高木で、柑橘類の一種。独特の清々しい香りと、ほどよい酸味が特徴。奈良時代には既に栽培されていたとの記録があり、その頃から薬用や薬味として親しまれてきました。古くは「柚 」と呼ばれており、果実のすっぱさから「柚の酢」とよばれ、それが「ゆず」になったといわれています。ちなみに、冬至の日に「柚子湯」に入るという風習は比較的新しく、江戸時代からのものです。

柚子
柚子",https://irocore.com/yuzuha-iro/
聴色（ゆるしいろ）,"['252', '212', '213']","['00', '25', '10', '00']",#FCD4D5,"聴色（ゆるしいろ）とは、紅花で染められた淡い紅色のことです。紅花大一斤で絹一疋 が染められた色合いを指し、一般的には『一斤染 』という色名で知られています。『退紅 』と『中紅 』の中間の色。
古代、紅花は大変高価な染料であり、それを用いた紅染 も色が濃くなるほど高額でした。そのため、濃染 の紅色は皇族や高い身分の人にしか使用を許されない『禁色 』とされ、逆にだれでも着用が許された色が『聴色』だったのです。
ただ、聴色とされた色でも、徐々に色が濃くなる傾向があり、本来は一斤染よりも薄い色だった『今様色 』も、後年は聴色の限界を越えた濃い紅色となっています。
濃い紅色以外に濃い紫色も『禁色』とされていたので、紫根染めによる薄い紫色を聴色とする場合もあります。
※一斤=600g　※一疋は二反。一反は大人一人分の布地の量。",https://irocore.com/yurushi-iro/
羊羹色（ようかんいろ）,"['109', '060', '020']","['00', '53', '70', '70']",#6D3C14,"羊羹色（ようかんいろ）とは、その名のとおり菓子の羊羹 のようなわずかに赤みを帯びた濃い茶色のことです。江戸時代からの色名で、『染物重宝記 』には『百塩茶 』と同色と表記されています。
当時、『羊羹色』は黒染や濃紫の衣服が色褪 せてきた様を形容するのに用いられました。昔の黒染めは紅や藍などで下染してから黒く染めていたため、色が褪せてくるとちょうど羊羹のような色になっていたのです。古典落語の『夢金 』でも登場人物の貧乏侍の姿を「黒羽二重 ５つ所の紋付と言いたい所だが、黒が焼けて、紋が汚れて黒くなっているので羊羹羽二重黒紋付」と、色褪せた黒の紋付きを「羊羹の紋付」と表現しています。
羊羹は、一般には小豆の餡を型に流し込み寒天で固めた和菓子のことです。室町時代に中国から伝わりましたが、当時の羊羹は「蒸し羊羹」でした。その後、江戸初期に現在のような寒天の入った透明感のある「練り羊羹」が作られるようになっています。
",https://irocore.com/youkan-iro/
洋紅色（ようこうしょく）,"['218', '000', '061']","['00', '100', '63', '08']",#DA003D,"洋紅色（ようこうしょく）とは、深く鮮やかな紅赤色のことです。別に『ようべに』とも読まれるとおり、江戸後期に西洋から伝わった『紅色』のことで洋名は『カーマイン』。
カーマインは、メキシコのサボテンに寄生するコチニール（カイガラムシの一種）の雌から得られる紅色の色素で、江戸後期にオランダ経由で輸入され、絵の具や化粧品、食品の着色料にと現代でも幅広く使われています。
コチニールの別名を『臙脂虫 』といいますが、その名のとおり『臙脂色 』の元になっています。『臙脂色』はより暗く深みがある色ですが、古くからの伝統色『臙脂色』と明治の文化人に流行したハイカラな『洋紅色』にカーマインという共通項があるというのもじつに面白いものです。",https://irocore.com/youkoushoku/
吉岡染（よしおかぞめ）,"['067', '052', '027']","['76', '71', '73', '47']",#43341B,"吉岡染（よしおかぞめ）とは、赤みがかった黄みの暗い黒茶色のことです。兵法家 ・剣客 の “吉岡憲法 ” が考案したとされる黒染で、『憲房染 』『憲法染 』ともいわれる小紋染めの方法の一つです。
染や色の名前としては、個人の名を冠した最も古い例であり、江戸前期に日常の衣服の黒として広く愛用されました。",https://irocore.com/yoshiokazome/
駱駝色（らくだいろ）,"['191', '121', '078']","['00', '37', '59', '25']",#BF794E,駱駝色（らくだいろ）とは、駱駝の毛のような黄みの薄い茶色のことです。駱駝は上代には渡来していましたが、駱駝色の色名は近世になってキャメルの訳語として誕生した、比較的新しいものです。駱駝の毛から作られた織物の色という意味ではなく、駱駝の毛のような色をした毛織物などに一般的な色名として使われています。,https://irocore.com/rakuda-iro/
蘭茶（らんちゃ）,"['209', '152', '038']","['17', '44', '89', '0']",#D19826,蘭茶（らんちゃ）は、茶がからせた赤みのある黄褐色のことです。江戸時代に流行した『四十八茶百鼠』の一つで、色名の由来は「木蘭染 の茶色」からだと思われます。よく似た色に山吹茶があります。,https://irocore.com/rancha/
璃寛茶（りかんちゃ）,"['106', '093', '033']","['00', '12', '69', '58']",#6A5D21,"璃寛茶（りかんちゃ）とは、やや緑がかった黄みの暗い茶色のことで、媚茶 に藍みを加えた色になります。江戸後期の文化文政の頃、大坂で人気があった歌舞伎役者二世嵐吉三郎（俳名：瑠寛 ）が好んで用いた色で、同じく人気のあった三世中村芝翫の芝翫茶 と共に人気を二分しました。
江戸時代には璃寛茶も含めて歌舞伎役者に由来した茶色が流行しましたが、これは歌舞伎の舞台や役者たちに愛用されたからです。ちなみに璃寛の名称は、璃寛縞 といわれる大柄の縞模様 にも用いられています。",https://irocore.com/rikancha/
利休白茶（りきゅうしらちゃ）,"['230', '227', '197']","['00', '01', '20', '15']",#E6E3C5,"利休白茶（りきゅうしらちゃ）とは、薄い灰みがかった黄褐色のことです。 わび茶道の祖・ “千利休 ” をイメージさせる上品で穏やかな白茶色。色名では茶とされていますが色調は鼠色系にあたります。『利休茶 』の派生色。
利休白茶がいつから染められるようになったか定かではありませんが、寛政九年の手写の『染物秘傳 』に『利休染 』が記されていることや、『手鑑模様節用 』に利休茶が記されていることから寛政年間以降で、『白茶 』が流行した文化・文政の頃からでしょう。
※寛政年間：1789年から1801年
※文化年間：1804年から1818年
※文政年間：1818年から1830年
名称に付けられた「利休」はもちろん茶人 “千利休”のことですが、実際に利休に縁 のある色ではなく、『利休茶』や『利休鼠』のように名前を借りただけのものと思われます。他にも『利休色』『利休生壁 』『錆利休 』など、千利休の死から二百年後の江戸後期には「利休」がつく色名が数多く生まれました。",https://irocore.com/rikyushiracha/
利休茶（りきゅうちゃ）,"['137', '120', '069']","['10', '18', '50', '40']",#897845,"利休茶（りきゅうちゃ）とは、色あせた挽き茶のような緑がかった薄茶色のことです。
室町・桃山時代の茶人“千利休 ”が好んだ色とされていますが、この色名が文献に現れたのが利休死後の江戸中期頃であるため、その時代の染屋あるいは呉服屋が千利休の名を借りて流行色を作ったとも言われています。
ちなみに、江戸中期には、緑を帯びた色には『利休色』『利休白茶』『信楽利休』『利休鼠』『錆利休 』『利休生壁』など“利休”がつく色名が数多く生まれました。",https://irocore.com/rikyucha/
柳緑（りゅうりょく）,"['123', '170', '23']","['50', '00', '100', '20']",#7BAA17,"柳緑（りゅうりょく）とは、青々とした新緑の柳のような青みの強い黄緑色のことです。禅語の『柳緑花紅 』という言葉が出典。元は中国の詩人「蘇軾 」の詩の一節です。
柳緑花紅は「やなぎはみどり、はなはくれない」とも読まれ、柳の木には緑が茂り、花が紅色に咲く、そんな春の美しい風景を形容する言葉であり、自然の姿をそのまま表現してあることから、禅的には「あるがまま」「自然体」を意味します。ちなみに『花紅柳緑』とも表記されますが同じ意味です。
緑色に比べると黄みが強く少しくすみのある柳緑は、出典の禅語のように「あるがまま」で穏やかな落ち着いた気持ちにさせてくれる色です。",https://irocore.com/ryuuryoku/
竜胆色（りんどういろ）,"['105', '103', '171']","['69', '96', '09', '00']",#6967AB,"竜胆色（りんどういろ）とは、竜胆の花のような薄い青紫色のことです。

竜胆は日本の山野に自生するリンドウ科の多年草。桔梗と共に日本の秋を代表する花です。
竜胆の小さく可憐な花は、日本人に古くから愛好され、色名も平安の頃より重ねの色目として用いられてきました。
ちなみに、竜胆の根は極めて苦いことから「竜の胆」のようだと例えられ、そこから竜胆とよばれるようになったようです。
襲の色目としては、「表・蘇芳、裏・青」などが用いられ代表的な秋の配色になります。",https://irocore.com/rindou-iro/
瑠璃色（るりいろ）,"['000', '072', '152']","['100', '70', '00', '10']",#004898,"瑠璃色（るりいろ）とは、濃い紫みの鮮やかな青色のことです。もとは仏教世界の中心「須弥山 」にて産する宝玉で、仏教の七宝の一つ。その宝石の色にちなんだ瑠璃色も至上の色として神聖視されました。実際、透明感のあるその色合いは、静かで幻想的な深海を思わせます。
瑠璃は一般的に濃い青色の形容に用いられており、『瑠璃色の地球』という曲はあまりにも有名でしょう。さらに『瑠璃紺』『瑠璃鉄』『瑠璃花色』など、瑠璃を冠する色名がいくつか存在します。
また、瑠璃は青色系のガラス質も指し、正倉院の宝物には鉛系ガラスの『白琉璃高杯 』『白琉璃碗 』『緑瑠璃十二曲長坏』『紺琉璃坏』などがみられます。
平安初期に書かれた『竹取物語』には「金、しろかね、るりいろの水、山より流れ出たる」の記述があるように、瑠璃は貴重な鉱物とされ、光沢のある鮮やかな濃青色であることから『碧瑠璃 』とも呼ばれました。
ラピスラズリの原料となる鉱物を日本では「青金石 」と呼び、英名ラズライト（lazurite）と表記しますが、リン酸塩鉱物の一種の「天藍石 」も英名ラズライト（lazulite）と欧文のスペルは違うのですが、カタカナ表記では同じであるため、混同しやすく注意が必要です。
数ある伝統色の中でも、瑠璃色は『臙脂色 』や『山吹色 』などとならんで現在でもよく使われている色ではないでしょうか。


正倉院の宝物、瑠璃盃（るりのつき）
正倉院の宝物、瑠璃盃（るりのつき）",https://irocore.com/ruri-iro/
瑠璃紺（るりこん）,"['035', '076', '142']","['89', '54', '11', '03']",#224B8F,"瑠璃紺（るりこん）とは、瑠璃色がかった紺色の意味で深い紫みの青色のことです。 別名「紺瑠璃 」とも。仏の髪や仏国土などの色として経典にも見られる伝統ある色名です。
近世風俗志『守貞漫稿 』によれば、あらかじめ紺に染めたものを蒸気で蒸し、やや明るく派手に染めたもので、江戸の小袖 の色として大流行しました。",https://irocore.com/rurikon/
檸檬色（れもんいろ）,"['236', '223', '043']","['07', '13', '83', '00']",#ECDF2B,"檸檬色（れもんいろ）とは、やや緑みを帯びた薄い黄色のことです。果実のレモンに由来した色名で、19世紀にヨーロッパで誕生した絵の具の「レモンイエロー」が日本で知られるようになり、「檸檬色」と呼ばれるようになりました。
なおレモンの果実は明治時代初期に渡来しており、「檸檬」の和名は当て字です。",https://irocore.com/remon-iro/
煉瓦色（れんがいろ）,"['170', '092', '063']","['00', '60', '60', '40']",#AA5C3F,"煉瓦色（れんがいろ）とは、赤煉瓦 のような赤みのくすんだ茶色のことです。弁柄のような色ですが、明治以降に誕生した比較的新しい色名です。
日本で煉瓦が製造されるようになった明治以降、西洋から入ってきた目新しい赤煉瓦の色は、当時の日本人にとっては心踊るハイカラな色だったためか、文学者や知識人に盛んに用いられ流行しました。
赤煉瓦づくりの建築物は、文明開化の象徴で数多く建てられましたが、耐震性が低いため徐々に装飾として使われるようになっていきます。",https://irocore.com/renga-iro/
呂色（ろいろ）,"['12', '12', '12']","['00', '00', '00', '100']",#0c0c0c,"呂色（ろいろ）とは、黒漆の濡れたような深く美しい黒色のことです。漆工芸の塗りの技法のひとつである呂色塗からきた色名で、蝋色とも書きます。呂色塗は京漆の代表で、中でも本堅地 呂色塗は大変な工程と高い技術を必要とし、また表面を平滑に磨き上げる非常に技術の高い塗りだからこそ専門職の呂色師が存在するほどです。
生漆 に油類を加えないで精製したものを塗ることで、色は黒色に近い深い光沢をもつ色になります。",https://irocore.com/roiro/
緑青（ろくしょう）,"['091', '173', '146']","['60', '00', '45', '15']",#5BAD92,"緑青（ろくしょう）とは、孔雀石から作られる顔料の色で明るく鈍い青緑色のことです。緑系の代表的な伝統色で、飛鳥時代に中国から色名とともに伝来しました。『続日本紀』には『金青 』とともに献上された記録がみられます。（※孔雀石＝マラカイト）
緑青は古くから建築物や彫刻の彩色に用いられ、橙色系の『丹色 』とともに古代の顔料を代表する色でした。また、日本画では緑色を表すのに欠かせない色でもあります。
ちなみに、緑青よりも孔雀石をさらに細かく砕いて作られる白みを帯びた淡い緑色の顔料が『白緑 』になります。
銅製品に発生する青緑のサビもまた「緑青 」と呼ばれていますが、孔雀石はこのサビと同じ成分なので、現在では人工的に銅や青銅を酸化させて、表面に発生する錆から顔料を作る製法もあります。
緑青",https://irocore.com/rokusho/
路考茶（ろこうちゃ）,"['144', '122', '048']","['0', '20', '70', '55']",#927A30,路考茶（ろこうちゃ）とは、鶯色に近い渋い緑みの茶色のことです。江戸の歌舞伎役者で二代目瀬川菊之丞を襲名した通称・王子路考が愛用したことからその名が付けられた染め色です。この色の人気は桁外れで、江戸中の女性がこぞって真似をしたといい、代々の路考の人気とともに七十余年にわたって流行色のトップに位置づけられました。当時の染色記事や浮世絵美人の衣裳に多く見られ、その流行ぶりがうかがえます。このため、特定の人物名を冠した色名としては最も代表的な色といえます。,https://irocore.com/rokocha/
若草色（わかくさいろ）,"['171', '201', '0']","['38', '00', '100', '05']",#ABC900,"若草色（わかくさいろ）とは、早春に芽吹いた若草のようなあざやかな黄緑のことです。古くから見られる伝統的な色で、もとは平安装束の重 ねの色目『若草』に由来します。
「若」には新鮮な、未熟な、新しいなどの意味があり、俳句では「若草」は春の季語です。また、平安前期の歌物語「伊勢物語 」では、みずみずしさを感じさせる「若草」は若い女性に例えられました。
由来となった『若草』の重 ねの色ですが、「表・薄青、裏・濃青」の色目で早春に若草が萌え出た野原の情景を表しています。
『若草』は旧暦の年始から2月初めにかけて用いられました。（出典：薄色模様）
ちなみに、若草から成長した夏の野原は『草色』として、冬に枯れた野原は『枯野』としてそれぞれ色名となっています。",https://irocore.com/wakakusa-iro/
若竹色（わかたけいろ）,"['124', '194', '142']","['60', '00', '60', '00']",#7CC28E,"若竹色（わかたけいろ）は、若竹のように黄みの薄い爽やかな緑色のことです。青竹に比べてより若い青竹の色を表しています。「若」は若々しく新しいという意味から鮮やかさの形容としても用いられました。
竹は若々しさを強調するため、淡めの色になることが多く、大正時代に流行した時もかなり明るい色調でした。ちなみに、若竹色を黄みのにぶい緑にすると『老竹色 』になります。",https://irocore.com/wakatake-iro/
若菜色（わかないろ）,"['204', '222', '104']","['26', '00', '70', '00']",#CCDE68,"若菜色（わかないろ）とは、初春の若菜のような明るい黄緑色のことです。春先の山菜の色全体を指す爽やかな色ですが、「若菜」が「春の七草」の別名であることから春の七草に因 んだ色とも言われています。
芹 、薺 、御形 、繁縷 、仏の座 、菘 、蘿蔔 といった春の七草は、古代の宮中では万病を除くとされ、正月七日の「若菜摘み」と「七草粥」は年始の大切な行事のひとつでした。若菜摘む女性の風景は、『万葉集 』『枕草子』『源氏物語』などでもよく見られるように、古くより馴染みのものだったようです。
ちなみに、「若」がつく伝統色は新緑の草花に由来する緑色に多く、『若草色 』『若苗色 』『若竹色 』『若芽色 』など多数見られます。
若菜（はこべ）",https://irocore.com/wakana-iro/
若苗色（わかなえいろ）,"['199', '220', '104']","['10', '00', '53', '14']",#C7DC68,"若苗色（わかなえいろ）とは、田植えの時期の若い苗のような新鮮な黄緑色のことです。若苗色の出典は古く、夏の色として平安時代から使われてきました。『源氏物語』（宿木）にも「濃き袿 に、撫子 と思しき細長、若苗色の小袿着たり。」と見られます。
ちなみに少し緑みを濃くした色は『苗色』になります。",https://irocore.com/wakanae-iro/
若葉色（わかばいろ）,"['164', '202', '104']","['40', '00', '70', '05']",#A4CA68,"若葉色（わかばいろ）とは、夏前の草木の若葉のようなやわらかい黄緑色のことです。
「若葉」といえば春のイメージがありますが、季語としては夏。春の色である『若菜色 』より少し青みが強い色で、夏前の爽やかな木々の葉を表す範囲の広い色になります。
ちなみに、若葉色は明治以降の近代になって登場した色で、古くからの伝統色でいえば『苗色 』がもっとも近い色といえるでしょう。

他にも「若」がつく色には『若草色 』『若苗色 』『若竹色 』『若芽色 』などがあり、ほとんどが新緑の草花に由来しています。
",https://irocore.com/wakaba-iro/
若緑（わかみどり）,"['165', '205', '137']","['39', '00', '55', '05']",#A5CD89,"若緑（わかみどり）とは、みずみずしい松の若葉のような明るく浅い黄緑色のことです。江戸時代からの色名。「若緑」は晩春の季語で本来は「松の新芽」のことですが、その色合いとともに色名として定着したようです。
ちなみに、年を経た老松 の葉の色である『老緑 』は対色にあたります。
色名につく「若」や「老」は、草木系の緑色を形容するのに使われる修飾語であり、若は「明るい」「鮮やかさ」を、老は「くすんだ」「鈍い」「暗い」などを形容しました。
ただし「老」を冠する色名はそれほど多くないため、『若緑』『老緑』のような対色関係にあるのは、他には『若竹色 』『老竹色 』のみとなります。
『若緑』のような新緑に因んだ色には『萌黄色 』『若草色 』『若芽色 』などがありますが、いずれも若緑に比べて黄みが強い鮮やかな色をしています。
松の新芽",https://irocore.com/wakamidori/
若紫（わかむらさき）,"['190', '132', '184']","['28', '55', '00', '00']",#BE84B8,"若紫（わかむらさき）とは、明るい紅みの紫色のことです。色名の由来は「うすい紫色」を意味する「若紫」という言葉から。江戸時代からの染めの色です。
「若紫」は平安時代（七九四〜一一八五）の和歌や「源氏物語」などでもその名を見られますが、この時代は色名ではなく薄い紫を意味する修飾語、または掛詞 として使われていました。
ちなみに、当時の薄い紫色といえば『薄色 』『浅紫 』などがあります。
『若紫』が色名となるのは紫染めの染色技術が上がった江戸時代からで、言葉の響きの美しさから修飾語がそのまま色名として定着したのでしょう。
元禄期（一六八八〜一七○四）には若向けの色とされ、歌舞伎や浄瑠璃などでは華やかで若々しい紫色としてえがかれました。
“近松門左衛門”の浄瑠璃「心中天網島 」（一七二○）に「走り書 、謡 の本は近衛流 、野郎帽子 は若紫」とあり、女形がかぶる野郎帽子の色は『若紫』が決まりごとだと記されています。
※野郎帽子とは歌舞伎の女形などが月代 を隠すために頭においた縮緬 の布のこと。
四代目岩井半四郎の乳人重の井（東洲斎写楽）

",https://irocore.com/wakamurasaki/
若芽色（わかめいろ）,"['232', '236', '152']","['13', '00', '50', '00']",#E8EC98,"若芽色（わかめいろ）とは、植物の若い芽のような淡い黄緑色のことです。早春に生え出て間もない草木の芽の色を「若」と「芽」を重ねて強調した色名で『若葉色』『若草色』『若苗色』など「若」がつく和色の中でも、ひときわ色味が薄く黄色に近い色です。

若芽色は色名としては比較的新しく、近代から使われるようになりました。

ちなみに、英色名では『Sprout 』、フランス名では『Bourgeon 』と呼ばれ、文字通り「芽」の色のことです。


",https://irocore.com/wakame-iro/
山葵色（わさびいろ）,"['142', '194', '152']","['45', '00', '45', '10']",#8EC298,"山葵色（わさびいろ）とは、すり下ろした山葵 のような薄い黄緑色のことです。江戸中期以降、山葵が庶民に普及するのに合わせて生まれた色名だと思われます。
山葵 （ワサビ）はアブラナ科ワサビ属の多年草。日本原産で日本を代表する香辛料。古代より薬用・食用とされてきました。古い資料では『和佐比』との表記も。また現在では『西洋ワサビ』と区別するため、『本ワサビ』とも呼ばれます。
ワサビは室町時代には薬味としての利用が確立されており、江戸時代に入ると寿司、蕎麦などの普及にあわせ、広く一般に浸透していきました。
江戸時代は「四十八茶百鼠 」と呼ばれるように『茶色』や『鼠色』が流行しましたが、山葵色（わさびいろ）のような優しい緑色も人気が高く、抑えた色使いに美を見出した「粋 」な江戸の精神を感じることができます。
ちなみに、山葵色と漢字の１文字違いの色で『葵色 』がありますが、こちらは葵の花に由来する紫色のことです。",https://irocore.com/wasabi-iro/
勿忘草（わすれなぐさ）,"['156', '197', '230']","['40', '10', '00', '05']",#9CC5E6,"勿忘草（わすれなぐさ）とは、勿忘草の花のような可憐な明るい青色のことです。明治期からの新しい色名で、ドイツの伝説に由来する「フォーゲット・ミー・ノット」の和訳。上田敏訳『海潮音 』でドイツの詩人ウィルヘルム・アレントの『勿忘草』が紹介され、それがそのまま花の名前、色の名前として知られるようになったとも言われています。
勿忘草は、ムラサキ科ワスレナグサ属の一種。ヨーロッパが原産で、春から夏にかけて薄い青色の小花をつけます。ヨーロッパでは青い花が少ないことから神秘的な花として人々に愛されました。
この花が日本に伝来したのは明治時代。現在では野生化して日本全国に群生しています。また観賞用にも栽培され、姫ムラサキ、瑠璃草とも。ちなみに、日本古来のワスレナグサ属は蝦夷紫 一種のみです。
勿忘草の花は恋人たちの花ともいわれ、ヨーロッパでは４年に１度の閏年 の日に、恋人たちがこの花を贈りあう習慣があるようです。そんな花に因 んだ『勿忘草』の色は、恋人たちの愛の象徴なのかもしれません。",https://irocore.com/wasurenagusa/`;var L0=typeof globalThis<"u"?globalThis:typeof window<"u"?window:typeof global<"u"?global:typeof self<"u"?self:{};function M0(i){return i&&i.__esModule&&Object.prototype.hasOwnProperty.call(i,"default")?i.default:i}var v0={exports:{}};/* @license
Papa Parse
v5.4.1
https://github.com/mholt/PapaParse
License: MIT
*/(function(i,s){(function(d,C){i.exports=C()})(L0,function d(){var C=typeof self<"u"?self:typeof window<"u"?window:C!==void 0?C:{},$=!C.document&&!!C.postMessage,a0=C.IS_PAPA_WORKER||!1,r0={},O0=0,m={parse:function(o,n){var r=(n=n||{}).dynamicTyping||!1;if(g(r)&&(n.dynamicTypingFunction=r,r={}),n.dynamicTyping=r,n.transform=!!g(n.transform)&&n.transform,n.worker&&m.WORKERS_SUPPORTED){var t=function(){if(!m.WORKERS_SUPPORTED)return!1;var p=(R=C.URL||C.webkitURL||null,y=d.toString(),m.BLOB_URL||(m.BLOB_URL=R.createObjectURL(new Blob(["var global = (function() { if (typeof self !== 'undefined') { return self; } if (typeof window !== 'undefined') { return window; } if (typeof global !== 'undefined') { return global; } return {}; })(); global.IS_PAPA_WORKER=true; ","(",y,")();"],{type:"text/javascript"})))),f=new C.Worker(p),R,y;return f.onmessage=R0,f.id=O0++,r0[f.id]=f}();return t.userStep=n.step,t.userChunk=n.chunk,t.userComplete=n.complete,t.userError=n.error,n.step=g(n.step),n.chunk=g(n.chunk),n.complete=g(n.complete),n.error=g(n.error),delete n.worker,void t.postMessage({input:o,config:n,workerId:t.id})}var c=null;return m.NODE_STREAM_INPUT,typeof o=="string"?(o=function(p){return p.charCodeAt(0)===65279?p.slice(1):p}(o),c=n.download?new m0(n):new u0(n)):o.readable===!0&&g(o.read)&&g(o.on)?c=new f0(n):(C.File&&o instanceof File||o instanceof Object)&&(c=new d0(n)),c.stream(o)},unparse:function(o,n){var r=!1,t=!0,c=",",p=`\r
`,f='"',R=f+f,y=!1,a=null,B=!1;(function(){if(typeof n=="object"){if(typeof n.delimiter!="string"||m.BAD_DELIMITERS.filter(function(e){return n.delimiter.indexOf(e)!==-1}).length||(c=n.delimiter),(typeof n.quotes=="boolean"||typeof n.quotes=="function"||Array.isArray(n.quotes))&&(r=n.quotes),typeof n.skipEmptyLines!="boolean"&&typeof n.skipEmptyLines!="string"||(y=n.skipEmptyLines),typeof n.newline=="string"&&(p=n.newline),typeof n.quoteChar=="string"&&(f=n.quoteChar),typeof n.header=="boolean"&&(t=n.header),Array.isArray(n.columns)){if(n.columns.length===0)throw new Error("Option columns is empty");a=n.columns}n.escapeChar!==void 0&&(R=n.escapeChar+f),(typeof n.escapeFormulae=="boolean"||n.escapeFormulae instanceof RegExp)&&(B=n.escapeFormulae instanceof RegExp?n.escapeFormulae:/^[=+\-@\t\r].*$/)}})();var u=new RegExp(p0(f),"g");if(typeof o=="string"&&(o=JSON.parse(o)),Array.isArray(o)){if(!o.length||Array.isArray(o[0]))return U(null,o,y);if(typeof o[0]=="object")return U(a||Object.keys(o[0]),o,y)}else if(typeof o=="object")return typeof o.data=="string"&&(o.data=JSON.parse(o.data)),Array.isArray(o.data)&&(o.fields||(o.fields=o.meta&&o.meta.fields||a),o.fields||(o.fields=Array.isArray(o.data[0])?o.fields:typeof o.data[0]=="object"?Object.keys(o.data[0]):[]),Array.isArray(o.data[0])||typeof o.data[0]=="object"||(o.data=[o.data])),U(o.fields||[],o.data||[],y);throw new Error("Unable to serialize unrecognized input");function U(e,D,j){var _="";typeof e=="string"&&(e=JSON.parse(e)),typeof D=="string"&&(D=JSON.parse(D));var I=Array.isArray(e)&&0<e.length,x=!Array.isArray(D[0]);if(I&&t){for(var O=0;O<e.length;O++)0<O&&(_+=c),_+=S(e[O],O);0<D.length&&(_+=p)}for(var h=0;h<D.length;h++){var l=I?e.length:D[h].length,F=!1,z=I?Object.keys(D[h]).length===0:D[h].length===0;if(j&&!I&&(F=j==="greedy"?D[h].join("").trim()==="":D[h].length===1&&D[h][0].length===0),j==="greedy"&&I){for(var E=[],T=0;T<l;T++){var v=x?e[T]:T;E.push(D[h][v])}F=E.join("").trim()===""}if(!F){for(var A=0;A<l;A++){0<A&&!z&&(_+=c);var N=I&&x?e[A]:A;_+=S(D[h][N],A)}h<D.length-1&&(!j||0<l&&!z)&&(_+=p)}}return _}function S(e,D){if(e==null)return"";if(e.constructor===Date)return JSON.stringify(e).slice(1,25);var j=!1;B&&typeof e=="string"&&B.test(e)&&(e="'"+e,j=!0);var _=e.toString().replace(u,R);return(j=j||r===!0||typeof r=="function"&&r(e,D)||Array.isArray(r)&&r[D]||function(I,x){for(var O=0;O<x.length;O++)if(-1<I.indexOf(x[O]))return!0;return!1}(_,m.BAD_DELIMITERS)||-1<_.indexOf(c)||_.charAt(0)===" "||_.charAt(_.length-1)===" ")?f+_+f:_}}};if(m.RECORD_SEP=String.fromCharCode(30),m.UNIT_SEP=String.fromCharCode(31),m.BYTE_ORDER_MARK="\uFEFF",m.BAD_DELIMITERS=["\r",`
`,'"',m.BYTE_ORDER_MARK],m.WORKERS_SUPPORTED=!$&&!!C.Worker,m.NODE_STREAM_INPUT=1,m.LocalChunkSize=10485760,m.RemoteChunkSize=5242880,m.DefaultDelimiter=",",m.Parser=E0,m.ParserHandle=b0,m.NetworkStreamer=m0,m.FileStreamer=d0,m.StringStreamer=u0,m.ReadableStreamStreamer=f0,C.jQuery){var h0=C.jQuery;h0.fn.parse=function(o){var n=o.config||{},r=[];return this.each(function(p){if(!(h0(this).prop("tagName").toUpperCase()==="INPUT"&&h0(this).attr("type").toLowerCase()==="file"&&C.FileReader)||!this.files||this.files.length===0)return!0;for(var f=0;f<this.files.length;f++)r.push({file:this.files[f],inputElem:this,instanceConfig:h0.extend({},n)})}),t(),this;function t(){if(r.length!==0){var p,f,R,y,a=r[0];if(g(o.before)){var B=o.before(a.file,a.inputElem);if(typeof B=="object"){if(B.action==="abort")return p="AbortError",f=a.file,R=a.inputElem,y=B.reason,void(g(o.error)&&o.error({name:p},f,R,y));if(B.action==="skip")return void c();typeof B.config=="object"&&(a.instanceConfig=h0.extend(a.instanceConfig,B.config))}else if(B==="skip")return void c()}var u=a.instanceConfig.complete;a.instanceConfig.complete=function(U){g(u)&&u(U,a.file,a.inputElem),c()},m.parse(a.file,a.instanceConfig)}else g(o.complete)&&o.complete()}function c(){r.splice(0,1),t()}}}function H(o){this._handle=null,this._finished=!1,this._completed=!1,this._halted=!1,this._input=null,this._baseIndex=0,this._partialLine="",this._rowCount=0,this._start=0,this._nextChunk=null,this.isFirstChunk=!0,this._completeResults={data:[],errors:[],meta:{}},(function(n){var r=C0(n);r.chunkSize=parseInt(r.chunkSize),n.step||n.chunk||(r.chunkSize=null),this._handle=new b0(r),(this._handle.streamer=this)._config=r}).call(this,o),this.parseChunk=function(n,r){if(this.isFirstChunk&&g(this._config.beforeFirstChunk)){var t=this._config.beforeFirstChunk(n);t!==void 0&&(n=t)}this.isFirstChunk=!1,this._halted=!1;var c=this._partialLine+n;this._partialLine="";var p=this._handle.parse(c,this._baseIndex,!this._finished);if(!this._handle.paused()&&!this._handle.aborted()){var f=p.meta.cursor;this._finished||(this._partialLine=c.substring(f-this._baseIndex),this._baseIndex=f),p&&p.data&&(this._rowCount+=p.data.length);var R=this._finished||this._config.preview&&this._rowCount>=this._config.preview;if(a0)C.postMessage({results:p,workerId:m.WORKER_ID,finished:R});else if(g(this._config.chunk)&&!r){if(this._config.chunk(p,this._handle),this._handle.paused()||this._handle.aborted())return void(this._halted=!0);p=void 0,this._completeResults=void 0}return this._config.step||this._config.chunk||(this._completeResults.data=this._completeResults.data.concat(p.data),this._completeResults.errors=this._completeResults.errors.concat(p.errors),this._completeResults.meta=p.meta),this._completed||!R||!g(this._config.complete)||p&&p.meta.aborted||(this._config.complete(this._completeResults,this._input),this._completed=!0),R||p&&p.meta.paused||this._nextChunk(),p}this._halted=!0},this._sendError=function(n){g(this._config.error)?this._config.error(n):a0&&this._config.error&&C.postMessage({workerId:m.WORKER_ID,error:n,finished:!1})}}function m0(o){var n;(o=o||{}).chunkSize||(o.chunkSize=m.RemoteChunkSize),H.call(this,o),this._nextChunk=$?function(){this._readChunk(),this._chunkLoaded()}:function(){this._readChunk()},this.stream=function(r){this._input=r,this._nextChunk()},this._readChunk=function(){if(this._finished)this._chunkLoaded();else{if(n=new XMLHttpRequest,this._config.withCredentials&&(n.withCredentials=this._config.withCredentials),$||(n.onload=X(this._chunkLoaded,this),n.onerror=X(this._chunkError,this)),n.open(this._config.downloadRequestBody?"POST":"GET",this._input,!$),this._config.downloadRequestHeaders){var r=this._config.downloadRequestHeaders;for(var t in r)n.setRequestHeader(t,r[t])}if(this._config.chunkSize){var c=this._start+this._config.chunkSize-1;n.setRequestHeader("Range","bytes="+this._start+"-"+c)}try{n.send(this._config.downloadRequestBody)}catch(p){this._chunkError(p.message)}$&&n.status===0&&this._chunkError()}},this._chunkLoaded=function(){n.readyState===4&&(n.status<200||400<=n.status?this._chunkError():(this._start+=this._config.chunkSize?this._config.chunkSize:n.responseText.length,this._finished=!this._config.chunkSize||this._start>=function(r){var t=r.getResponseHeader("Content-Range");return t===null?-1:parseInt(t.substring(t.lastIndexOf("/")+1))}(n),this.parseChunk(n.responseText)))},this._chunkError=function(r){var t=n.statusText||r;this._sendError(new Error(t))}}function d0(o){var n,r;(o=o||{}).chunkSize||(o.chunkSize=m.LocalChunkSize),H.call(this,o);var t=typeof FileReader<"u";this.stream=function(c){this._input=c,r=c.slice||c.webkitSlice||c.mozSlice,t?((n=new FileReader).onload=X(this._chunkLoaded,this),n.onerror=X(this._chunkError,this)):n=new FileReaderSync,this._nextChunk()},this._nextChunk=function(){this._finished||this._config.preview&&!(this._rowCount<this._config.preview)||this._readChunk()},this._readChunk=function(){var c=this._input;if(this._config.chunkSize){var p=Math.min(this._start+this._config.chunkSize,this._input.size);c=r.call(c,this._start,p)}var f=n.readAsText(c,this._config.encoding);t||this._chunkLoaded({target:{result:f}})},this._chunkLoaded=function(c){this._start+=this._config.chunkSize,this._finished=!this._config.chunkSize||this._start>=this._input.size,this.parseChunk(c.target.result)},this._chunkError=function(){this._sendError(n.error)}}function u0(o){var n;H.call(this,o=o||{}),this.stream=function(r){return n=r,this._nextChunk()},this._nextChunk=function(){if(!this._finished){var r,t=this._config.chunkSize;return t?(r=n.substring(0,t),n=n.substring(t)):(r=n,n=""),this._finished=!n,this.parseChunk(r)}}}function f0(o){H.call(this,o=o||{});var n=[],r=!0,t=!1;this.pause=function(){H.prototype.pause.apply(this,arguments),this._input.pause()},this.resume=function(){H.prototype.resume.apply(this,arguments),this._input.resume()},this.stream=function(c){this._input=c,this._input.on("data",this._streamData),this._input.on("end",this._streamEnd),this._input.on("error",this._streamError)},this._checkIsFinished=function(){t&&n.length===1&&(this._finished=!0)},this._nextChunk=function(){this._checkIsFinished(),n.length?this.parseChunk(n.shift()):r=!0},this._streamData=X(function(c){try{n.push(typeof c=="string"?c:c.toString(this._config.encoding)),r&&(r=!1,this._checkIsFinished(),this.parseChunk(n.shift()))}catch(p){this._streamError(p)}},this),this._streamError=X(function(c){this._streamCleanUp(),this._sendError(c)},this),this._streamEnd=X(function(){this._streamCleanUp(),t=!0,this._streamData("")},this),this._streamCleanUp=X(function(){this._input.removeListener("data",this._streamData),this._input.removeListener("end",this._streamEnd),this._input.removeListener("error",this._streamError)},this)}function b0(o){var n,r,t,c=Math.pow(2,53),p=-c,f=/^\s*-?(\d+\.?|\.\d+|\d+\.\d+)([eE][-+]?\d+)?\s*$/,R=/^((\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+([+-][0-2]\d:[0-5]\d|Z))|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d([+-][0-2]\d:[0-5]\d|Z))|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d([+-][0-2]\d:[0-5]\d|Z)))$/,y=this,a=0,B=0,u=!1,U=!1,S=[],e={data:[],errors:[],meta:{}};if(g(o.step)){var D=o.step;o.step=function(h){if(e=h,I())_();else{if(_(),e.data.length===0)return;a+=h.data.length,o.preview&&a>o.preview?r.abort():(e.data=e.data[0],D(e,y))}}}function j(h){return o.skipEmptyLines==="greedy"?h.join("").trim()==="":h.length===1&&h[0].length===0}function _(){return e&&t&&(O("Delimiter","UndetectableDelimiter","Unable to auto-detect delimiting character; defaulted to '"+m.DefaultDelimiter+"'"),t=!1),o.skipEmptyLines&&(e.data=e.data.filter(function(h){return!j(h)})),I()&&function(){if(!e)return;function h(F,z){g(o.transformHeader)&&(F=o.transformHeader(F,z)),S.push(F)}if(Array.isArray(e.data[0])){for(var l=0;I()&&l<e.data.length;l++)e.data[l].forEach(h);e.data.splice(0,1)}else e.data.forEach(h)}(),function(){if(!e||!o.header&&!o.dynamicTyping&&!o.transform)return e;function h(F,z){var E,T=o.header?{}:[];for(E=0;E<F.length;E++){var v=E,A=F[E];o.header&&(v=E>=S.length?"__parsed_extra":S[E]),o.transform&&(A=o.transform(A,v)),A=x(v,A),v==="__parsed_extra"?(T[v]=T[v]||[],T[v].push(A)):T[v]=A}return o.header&&(E>S.length?O("FieldMismatch","TooManyFields","Too many fields: expected "+S.length+" fields but parsed "+E,B+z):E<S.length&&O("FieldMismatch","TooFewFields","Too few fields: expected "+S.length+" fields but parsed "+E,B+z)),T}var l=1;return!e.data.length||Array.isArray(e.data[0])?(e.data=e.data.map(h),l=e.data.length):e.data=h(e.data,0),o.header&&e.meta&&(e.meta.fields=S),B+=l,e}()}function I(){return o.header&&S.length===0}function x(h,l){return F=h,o.dynamicTypingFunction&&o.dynamicTyping[F]===void 0&&(o.dynamicTyping[F]=o.dynamicTypingFunction(F)),(o.dynamicTyping[F]||o.dynamicTyping)===!0?l==="true"||l==="TRUE"||l!=="false"&&l!=="FALSE"&&(function(z){if(f.test(z)){var E=parseFloat(z);if(p<E&&E<c)return!0}return!1}(l)?parseFloat(l):R.test(l)?new Date(l):l===""?null:l):l;var F}function O(h,l,F,z){var E={type:h,code:l,message:F};z!==void 0&&(E.row=z),e.errors.push(E)}this.parse=function(h,l,F){var z=o.quoteChar||'"';if(o.newline||(o.newline=function(v,A){v=v.substring(0,1048576);var N=new RegExp(p0(A)+"([^]*?)"+p0(A),"gm"),L=(v=v.replace(N,"")).split("\r"),K=v.split(`
`),Q=1<K.length&&K[0].length<L[0].length;if(L.length===1||Q)return`
`;for(var M=0,b=0;b<L.length;b++)L[b][0]===`
`&&M++;return M>=L.length/2?`\r
`:"\r"}(h,z)),t=!1,o.delimiter)g(o.delimiter)&&(o.delimiter=o.delimiter(h),e.meta.delimiter=o.delimiter);else{var E=function(v,A,N,L,K){var Q,M,b,w;K=K||[",","	","|",";",m.RECORD_SEP,m.UNIT_SEP];for(var t0=0;t0<K.length;t0++){var k=K[t0],s0=0,Z=0,i0=0;b=void 0;for(var Y=new E0({comments:L,delimiter:k,newline:A,preview:10}).parse(v),V=0;V<Y.data.length;V++)if(N&&j(Y.data[V]))i0++;else{var n0=Y.data[V].length;Z+=n0,b!==void 0?0<n0&&(s0+=Math.abs(n0-b),b=n0):b=n0}0<Y.data.length&&(Z/=Y.data.length-i0),(M===void 0||s0<=M)&&(w===void 0||w<Z)&&1.99<Z&&(M=s0,Q=k,w=Z)}return{successful:!!(o.delimiter=Q),bestDelimiter:Q}}(h,o.newline,o.skipEmptyLines,o.comments,o.delimitersToGuess);E.successful?o.delimiter=E.bestDelimiter:(t=!0,o.delimiter=m.DefaultDelimiter),e.meta.delimiter=o.delimiter}var T=C0(o);return o.preview&&o.header&&T.preview++,n=h,r=new E0(T),e=r.parse(n,l,F),_(),u?{meta:{paused:!0}}:e||{meta:{paused:!1}}},this.paused=function(){return u},this.pause=function(){u=!0,r.abort(),n=g(o.chunk)?"":n.substring(r.getCharIndex())},this.resume=function(){y.streamer._halted?(u=!1,y.streamer.parseChunk(n,!0)):setTimeout(y.resume,3)},this.aborted=function(){return U},this.abort=function(){U=!0,r.abort(),e.meta.aborted=!0,g(o.complete)&&o.complete(e),n=""}}function p0(o){return o.replace(/[.*+?^${}()|[\]\\]/g,"\\$&")}function E0(o){var n,r=(o=o||{}).delimiter,t=o.newline,c=o.comments,p=o.step,f=o.preview,R=o.fastMode,y=n=o.quoteChar===void 0||o.quoteChar===null?'"':o.quoteChar;if(o.escapeChar!==void 0&&(y=o.escapeChar),(typeof r!="string"||-1<m.BAD_DELIMITERS.indexOf(r))&&(r=","),c===r)throw new Error("Comment character same as delimiter");c===!0?c="#":(typeof c!="string"||-1<m.BAD_DELIMITERS.indexOf(c))&&(c=!1),t!==`
`&&t!=="\r"&&t!==`\r
`&&(t=`
`);var a=0,B=!1;this.parse=function(u,U,S){if(typeof u!="string")throw new Error("Input must be a string");var e=u.length,D=r.length,j=t.length,_=c.length,I=g(p),x=[],O=[],h=[],l=a=0;if(!u)return P();if(o.header&&!U){var F=u.split(t)[0].split(r),z=[],E={},T=!1;for(var v in F){var A=F[v];g(o.transformHeader)&&(A=o.transformHeader(A,v));var N=A,L=E[A]||0;for(0<L&&(T=!0,N=A+"_"+L),E[A]=L+1;z.includes(N);)N=N+"_"+L;z.push(N)}if(T){var K=u.split(t);K[0]=z.join(r),u=K.join(t)}}if(R||R!==!1&&u.indexOf(n)===-1){for(var Q=u.split(t),M=0;M<Q.length;M++){if(h=Q[M],a+=h.length,M!==Q.length-1)a+=t.length;else if(S)return P();if(!c||h.substring(0,_)!==c){if(I){if(x=[],i0(h.split(r)),l0(),B)return P()}else i0(h.split(r));if(f&&f<=M)return x=x.slice(0,f),P(!0)}}return P()}for(var b=u.indexOf(r,a),w=u.indexOf(t,a),t0=new RegExp(p0(y)+p0(n),"g"),k=u.indexOf(n,a);;)if(u[a]!==n)if(c&&h.length===0&&u.substring(a,a+_)===c){if(w===-1)return P();a=w+j,w=u.indexOf(t,a),b=u.indexOf(r,a)}else if(b!==-1&&(b<w||w===-1))h.push(u.substring(a,b)),a=b+D,b=u.indexOf(r,a);else{if(w===-1)break;if(h.push(u.substring(a,w)),n0(w+j),I&&(l0(),B))return P();if(f&&x.length>=f)return P(!0)}else for(k=a,a++;;){if((k=u.indexOf(n,k+1))===-1)return S||O.push({type:"Quotes",code:"MissingQuotes",message:"Quoted field unterminated",row:x.length,index:a}),V();if(k===e-1)return V(u.substring(a,k).replace(t0,n));if(n!==y||u[k+1]!==y){if(n===y||k===0||u[k-1]!==y){b!==-1&&b<k+1&&(b=u.indexOf(r,k+1)),w!==-1&&w<k+1&&(w=u.indexOf(t,k+1));var s0=Y(w===-1?b:Math.min(b,w));if(u.substr(k+1+s0,D)===r){h.push(u.substring(a,k).replace(t0,n)),u[a=k+1+s0+D]!==n&&(k=u.indexOf(n,a)),b=u.indexOf(r,a),w=u.indexOf(t,a);break}var Z=Y(w);if(u.substring(k+1+Z,k+1+Z+j)===t){if(h.push(u.substring(a,k).replace(t0,n)),n0(k+1+Z+j),b=u.indexOf(r,a),k=u.indexOf(n,a),I&&(l0(),B))return P();if(f&&x.length>=f)return P(!0);break}O.push({type:"Quotes",code:"InvalidQuotes",message:"Trailing quote on quoted field is malformed",row:x.length,index:a}),k++}}else k++}return V();function i0(q){x.push(q),l=a}function Y(q){var B0=0;if(q!==-1){var A0=u.substring(k+1,q);A0&&A0.trim()===""&&(B0=A0.length)}return B0}function V(q){return S||(q===void 0&&(q=u.substring(a)),h.push(q),a=e,i0(h),I&&l0()),P()}function n0(q){a=q,i0(h),h=[],w=u.indexOf(t,a)}function P(q){return{data:x,errors:O,meta:{delimiter:r,linebreak:t,aborted:B,truncated:!!q,cursor:l+(U||0)}}}function l0(){p(P()),x=[],O=[]}},this.abort=function(){B=!0},this.getCharIndex=function(){return a}}function R0(o){var n=o.data,r=r0[n.workerId],t=!1;if(n.error)r.userError(n.error,n.file);else if(n.results&&n.results.data){var c={abort:function(){t=!0,y0(n.workerId,{data:[],errors:[],meta:{aborted:!0}})},pause:_0,resume:_0};if(g(r.userStep)){for(var p=0;p<n.results.data.length&&(r.userStep({data:n.results.data[p],errors:n.results.errors,meta:n.results.meta},c),!t);p++);delete n.results}else g(r.userChunk)&&(r.userChunk(n.results,c,n.file),delete n.results)}n.finished&&!t&&y0(n.workerId,n.results)}function y0(o,n){var r=r0[o];g(r.userComplete)&&r.userComplete(n),r.terminate(),delete r0[o]}function _0(){throw new Error("Not implemented.")}function C0(o){if(typeof o!="object"||o===null)return o;var n=Array.isArray(o)?[]:{};for(var r in o)n[r]=C0(o[r]);return n}function X(o,n){return function(){o.apply(n,arguments)}}function g(o){return typeof o=="function"}return a0&&(C.onmessage=function(o){var n=o.data;if(m.WORKER_ID===void 0&&n&&(m.WORKER_ID=n.workerId),typeof n.input=="string")C.postMessage({workerId:m.WORKER_ID,results:m.parse(n.input,n.config),finished:!0});else if(C.File&&n.input instanceof File||n.input instanceof Object){var r=m.parse(n.input,n.config);r&&C.postMessage({workerId:m.WORKER_ID,results:r,finished:!0})}}),(m0.prototype=Object.create(H.prototype)).constructor=m0,(d0.prototype=Object.create(H.prototype)).constructor=d0,(u0.prototype=Object.create(u0.prototype)).constructor=u0,(f0.prototype=Object.create(H.prototype)).constructor=f0,m})})(v0);var P0=v0.exports;const q0=M0(P0),k0=q0.parse(T0).data,U0=0,F0=3,N0=4,J0=5,c0=[];function w0(){for(;;){const i=Math.floor(Math.random()*k0.length);if(c0.indexOf(i)===-1)return c0.push(i),c0.length>=k0.length&&(c0.length=0),k0[i]}}function rn(i){c0.length=0,i.forEach(s=>{c0.push(k0.indexOf(s))})}class K0{constructor(){J(this,"data");this.data=w0()}getColor(){return this.data[F0]}getDescription(){return this.data[N0]}getMaskedDescription(){const s=this.getColorName();let d=this.getDescription().replaceAll(s[0],"".padEnd(s[0].length,"X")).replaceAll(s[1],"".padEnd(s[1].length,"x"));return s[0].endsWith("色")&&(d=d.replaceAll(s[0].slice(0,-1),"".padStart(s[0].length-1,"X"))),d}getColorName(){const s=this.data[U0].split("（");return[s[0],s[1].slice(0,-1)]}getReference(){return this.data[J0]}}class z0{constructor(s){J(this,"x");J(this,"y");J(this,"pos");J(this,"quiz");this.x=s.x,this.y=s.y,this.pos=s.count,this.quiz=new K0}render(s){const d=s.filter($=>$.pos===this.pos);let C=`background:${this.quiz.getColor()};`;return d.length>0&&(d.length===1?C+=`border:1em solid ${d[0].color[F0]};`:C+=`border:1em solid white;
        border-image: linear-gradient(to right,${d.reduce(($,a0,r0)=>`${$} ${a0.color[F0]} ${100/d.length*r0}% ${100/d.length*(r0+1)}%,`,"").slice(0,-1)}) 30;`),C}}var W0=Object.defineProperty,$0=(i,s,d)=>s in i?W0(i,s,{enumerable:!0,configurable:!0,writable:!0,value:d}):i[s]=d,g0=(i,s,d)=>($0(i,typeof s!="symbol"?s+"":s,d),d);const x0=[0,1,2,3,4,5,17,18,19,20,21,6,16,27,28,29,22,7,15,26,25,24,23,8,14,13,12,11,10,9],o0=class{static getBoard(){const s=[];for(let d=0;d<this.row;d++)s.push(this.sortByPosition.slice(d*this.col,(d+1)*this.col));return s}static reset(){this.sortByPosition=[...Array(30).keys()].map(s=>new z0({x:s%6,y:Math.floor(s/6),count:x0[s]})),this.sortByCount=[...this.sortByPosition].sort((s,d)=>s.pos-d.pos)}};g0(o0,"sortByPosition");g0(o0,"sortByCount");g0(o0,"row",5);g0(o0,"col",6);o0.sortByPosition=[...Array(30).keys()].map(i=>new z0({x:i%6,y:Math.floor(i/6),count:x0[i]}));o0.sortByCount=[...o0.sortByPosition].sort((i,s)=>i.pos-s.pos);let D0=o0;class H0{constructor(s,d=0){J(this,"pos");J(this,"color");J(this,"goaled");J(this,"quit");J(this,"rank");this.pos=d,this.color=s,this.goaled=!1,this.quit=!1,this.rank=1/0}step(s){this.pos+=Math.floor(Math.random()*6)+1,this.pos>=D0.sortByCount.length&&(this.goaled=!0,this.pos=D0.sortByCount.length-1,this.rank=s)}getSquare(){return D0.sortByCount[this.pos]}getQuiz(){return this.getSquare().quiz}wrong(){this.pos=0}reset(){this.pos=0,this.goaled=!1,this.quit=!1,this.rank=1/0}}const G=j0([new H0(w0())]);let W=0;function Q0(){return e0(G).filter(i=>i.goaled).length}function Z0(){return W+=1,W>=e0(G).length&&(W=0),W}function G0(i=W){return e0(G)[i]}function en(){const i=e0(G);let s=0;for(;;){if(!i[W].quit)return i[W];if(s>i.length)break;Z0(),s++}return null}function X0(){return!e0(G).some(i=>!i.goaled)}function sn(){return G.update(i=>(G0().step(Q0()),i)),X0()?-1:W}function cn(){G.update(i=>{var s;return(s=i[W])==null||s.wrong(),i})}function an(){e0(G).forEach(i=>i.reset()),W=0}function hn(){return e0(G).map(i=>i.color)}export{D0 as B,H0 as P,G0 as a,en as b,hn as c,sn as d,on as e,an as f,w0 as g,F0 as h,U0 as n,G as p,rn as r,Z0 as s,cn as w};
